popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
/*
 * Copyright (c) 2009-2019 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     tle989x.h
 * @brief    CMSIS HeaderFile
 * @version  0.5.0
 * @date     28. September 2021
 * @note     Generated by SVDConv V3.3.39 on Tuesday, 28.09.2021 10:20:04
 *           from File 'tle989x.svd',
 *           last modified on Tuesday, 28.09.2021 08:14:18
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** DM           Daniel Mysliwitz                                              **
** BG           Blandine Guillot                                              **
** JO           Julia Ott                                                     **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.1.0: 2020-05-26, DM:   Initial version                                  **
** V0.2.0: 2020-07-08, JO:   Added external variables declaration for unit    **
**                           testing under condition UNIT_TESTING_OCN         **
** V0.2.1: 2020-08-11, JO:   EP-449: Disable warnirng 'Wpadded' locally where **
**                           violations can't be avoided                      **
** V0.3.0: 2020-09-13, BG:   Generated by SVDConv V3.3.35 on                  **
**                           Sunday, 13.09.2020 19:51:51 from File            **
**                           'tle989x.svd', last modified on                  **
**                           Sunday, 13.09.2020 16:03:21                      **
** V0.3.1: 2020-08-11, JO:   EP-484: Added external variables declaration for **
**                           unit testing under condition UNIT_TESTING_OCN    **
**                           again, with CACHE, without CANCONTR              **
** V0.3.2: 2020-10-02, BG:   EP-489: Added missing registers for MEMCTRL      **
** V0.3.3: 2020-10-06, BG:   EP-490: Separated CANCONTR registers into 3      **
**                           message objects                                  **
**                           Removed unused position and mask defines         **
** V0.3.4: 2020-10-06, BG:   EP-515: Added positions and masks for FS_SSD_CLR **
** V0.3.5: 2020-10-20, BG:   EP-532: Added positions and masks for XTALCON,   **
**                           XTALSTATC and NMISRC                             **
** V0.3.6: 2020-10-21, BG:   EP-539: Added positions and masks for GLOBCONF   **
**                           (ADC1), PMCON (SCU), GLOBCONF(ADC2)              **
** V0.3.7: 2020-10-27, BG:   EP-560: Renamed split compare bits for ADC2      **
** V0.3.8: 2020-10-27, BG:   EP-561: Renamed split compare bits for ADC1      **
** V0.3.9: 2020-11-16, BG:   EP-595: Added positions and masks for CP_CTRL    **
** V0.4.0: 2020-11-17, BG:   EP-600: Added position and mask for WD_CTRL.WDP  **
** V0.4.1: 2020-11-27, BG:   EP-610: Corrected MISRA 2012 errors              **
** V0.4.2: 2020-11-27, BG:   EP-627: Added positions and masks for CANTRX     **
** V0.4.3: 2020-12-02, BG:   EP-629: Updated interrupt naming                 **
** V0.4.4: 2020-12-04, JO:   EP-626: Added positions and masks for WAKE_CTRL  **
** V0.4.5: 2020-12-10, BG:   EP-622: Added positions and masks for SCON and   **
**                           BCON in UART                                     **
** V0.4.6: 2021-01-26, BG:   EP-680: Restructured the CANCONTR into CANNODE   **
**                           and CANNODEFD                                    **
**                           Removed unnecessary MOCTR and MOSTAT registers   **
**                           from CANMSGOBJ1 and CANMSGOBJ2                   **
** V0.4.7: 2021-02-26, BG:   EP-701: Added position and mask for WD_CTRL.SOW  **
** V0.4.8: 2021-04-16, JO:   EP-753: Removed CACHE_CONFIG register            **
**                           Added registers to control the cache             **
** V0.4.9: 2021-08-10, BG:   EP-898: Updated header file according to UM v0.2 **
** V0.5.0: 2021-09-28, BG:   EP-832: Updated NVIC priority number of bits     **
*******************************************************************************/                                                 

/** @addtogroup Infineon
  * @{
  */


/** @addtogroup tle989x
  * @{
  */


#ifndef TLE989X_H
#define TLE989X_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M3 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  tle989x Specific Interrupt Numbers  =========================================== */
  WARN_INP0_NVIC_IRQn       =   0,              /*!< 0  Interrupt node 0: warnings                                             */
  WARN_INP1_NVIC_IRQn       =   1,              /*!< 1  Interrupt node 1: warnings                                             */
  CCU7_INP0_NVIC_IRQn       =   2,              /*!< 2  Interrupt node 2: CCU7                                                 */
  CCU7_INP1_NVIC_IRQn       =   3,              /*!< 3  Interrupt node 3: CCU7                                                 */
  CCU7_INP2_NVIC_IRQn       =   4,              /*!< 4  Interrupt node 4: CCU7                                                 */
  CCU7_INP3_NVIC_IRQn       =   5,              /*!< 5  Interrupt node 5: CCU7                                                 */
  NVM_INP0_NVIC_IRQn        =   6,              /*!< 6  Interrupt node 6: NVM                                                  */
  GPT_INP0_NVIC_IRQn        =   7,              /*!< 7  Interrupt node 7: GPT                                                  */
  GPT_INP1_NVIC_IRQn        =   8,              /*!< 8  Interrupt node 8: GPT                                                  */
  T20_INP0_NVIC_IRQn        =   9,              /*!< 9  Interrupt node 9: T20                                                  */
  ADC2_INP0_NVIC_IRQn       =  10,              /*!< 10 Interrupt node 10: ADC2                                                */
  ADC2_INP1_NVIC_IRQn       =  11,              /*!< 11 Interrupt node 11: ADC2                                                */
  MON_INP0_NVIC_IRQn        =  12,              /*!< 12 Interrupt node 12: MONx                                                */
  MON_INP1_NVIC_IRQn        =  13,              /*!< 13 Interrupt node 13: MONx                                                */
  ADC1_INP0_NVIC_IRQn       =  14,              /*!< 14 Interrupt node 14: ADC1                                                */
  ADC1_INP1_NVIC_IRQn       =  15,              /*!< 15 Interrupt node 15: ADC1                                                */
  ADC1_INP2_NVIC_IRQn       =  16,              /*!< 16 Interrupt node 16: ADC1                                                */
  ADC1_INP3_NVIC_IRQn       =  17,              /*!< 17 Interrupt node 17: ADC1                                                */
  BEMF_SDADC_INP0_NVIC_IRQn =  18,              /*!< 18 Interrupt node 18: SDADC, BEMF                                         */
  BEMF_SDADC_INP1_NVIC_IRQn =  19,              /*!< 19 Interrupt node 19: SDADC, BEMF                                         */
  EXT_INP0_NVIC_IRQn        =  20,              /*!< 20 Interrupt node 20: ExtInt                                              */
  EXT_INP1_NVIC_IRQn        =  21,              /*!< 21 Interrupt node 21: ExtInt                                              */
  UART_INP0_NVIC_IRQn       =  22,              /*!< 22 Interrupt node 22: UARTx                                               */
  UART_INP1_NVIC_IRQn       =  23,              /*!< 23 Interrupt node 23: UARTx                                               */
  SSC_INP0_NVIC_IRQn        =  24,              /*!< 24 Interrupt node 24: SSCx                                                */
  SSC_INP1_NVIC_IRQn        =  25,              /*!< 25 Interrupt node 25: SSCx                                                */
  MCAN_INP0_NVIC_IRQn       =  26,              /*!< 26 Interrupt node 26: MultiCAN                                            */
  MCAN_INP1_NVIC_IRQn       =  27,              /*!< 27 Interrupt node 27: MultiCAN                                            */
  MCAN_INP2_NVIC_IRQn       =  28,              /*!< 28 Interrupt node 28: MultiCAN                                            */
  DMA_INP0_NVIC_IRQn        =  29,              /*!< 29 Interrupt node 29: DMA                                                 */
  DMA_INP1_NVIC_IRQn        =  30,              /*!< 30 Interrupt node 30: DMA                                                 */
  T21_INP0_NVIC_IRQn        =  31               /*!< 31 Interrupt node 31: T21                                                 */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

