popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
/* ===========================  Configuration of the ARM Cortex-M3 Processor and Core Peripherals  =========================== */
#define __CM3_REV                 0x0201U       /*!< CM3 Core Revision                                                         */
#define __NVIC_PRIO_BITS               5        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  0        /*!< MPU present                                                               */
#define __FPU_PRESENT                  0        /*!< FPU present                                                               */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                           /*!< ARM Cortex-M3 processor and core peripherals                              */
#include "system_tle989x.h"                     /*!< tle989x System                                                            */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif

#ifdef UNIT_TESTING_OCN
  #undef __IM
  #define __IM volatile
#endif

/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wpadded"
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC1 (ADC1)
  */

typedef struct {                                /*!< (@ 0x40000000) ADC1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Global Configuration Register                              */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Module Enable                                                      */
            uint32_t            : 4;
      __IOM uint32_t ISTE       : 1;            /*!< [5..5] Idle shadow transfer enable                                        */
            uint32_t            : 26;
    } bit;
  } GLOBCONF;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Clock Control Register                                     */
    
    struct {
      __IOM uint32_t CLKDIV     : 4;            /*!< [3..0] Clock Divider Settings                                             */
            uint32_t            : 28;
    } bit;
  } CLKCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Suspend Control Register                                   */
    
    struct {
      __IOM uint32_t SUSEN      : 1;            /*!< [0..0] ADC1 Suspend Enable                                                */
      __IOM uint32_t SUSMOD     : 1;            /*!< [1..1] Suspend Mode                                                       */
            uint32_t            : 30;
    } bit;
  } SUSCTR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Suspend Status Register                                    */
    
    struct {
      __IM  uint32_t STAT       : 1;            /*!< [0..0] Suspend Mode Status                                                */
      __IM  uint32_t READY      : 1;            /*!< [1..1] Module Ready                                                       */
            uint32_t            : 30;
    } bit;
  } SUSSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Sequence Configuration Register                            */
    
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
      __IOM uint32_t COLLCFG    : 1;            /*!< [6..6] Collision Config                                                   */
      __IOM uint32_t WFRCFG     : 1;            /*!< [7..7] Wait for Read Enable                                               */
      __IOM uint32_t TRGSEL     : 4;            /*!< [11..8] Trigger Select                                                    */
      __IOM uint32_t GTSEL      : 2;            /*!< [13..12] Gating Select                                                    */
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
      __IOM uint32_t GTSW       : 1;            /*!< [15..15] Trigger Software Gating                                          */
            uint32_t            : 16;
    } bit;
  } SQCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) SQ Channel Slot Register                                   */
    
