popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CHSEL0     : 5;            /*!< [4..0] Channel Select                                                     */
            uint32_t            : 3;
      __IOM uint32_t CHSEL1     : 5;            /*!< [12..8] Channel Select                                                    */
            uint32_t            : 3;
      __IOM uint32_t CHSEL2     : 5;            /*!< [20..16] Channel Select                                                   */
            uint32_t            : 3;
      __IOM uint32_t CHSEL3     : 5;            /*!< [28..24] Channel Select                                                   */
            uint32_t            : 3;
    } bit;
  } SQSLOT0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Sequence Configuration Register                            */
    
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
      __IOM uint32_t COLLCFG    : 1;            /*!< [6..6] Collision Config                                                   */
      __IOM uint32_t WFRCFG     : 1;            /*!< [7..7] Wait for Read Enable                                               */
      __IOM uint32_t TRGSEL     : 4;            /*!< [11..8] Trigger Select                                                    */
      __IOM uint32_t GTSEL      : 2;            /*!< [13..12] Gating Select                                                    */
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
      __IOM uint32_t GTSW       : 1;            /*!< [15..15] Trigger Software Gating                                          */
            uint32_t            : 16;
    } bit;
  } SQCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) SQ Channel Slot Register                                   */
    
    struct {
      __IOM uint32_t CHSEL0     : 5;            /*!< [4..0] Channel Select                                                     */
            uint32_t            : 3;
      __IOM uint32_t CHSEL1     : 5;            /*!< [12..8] Channel Select                                                    */
            uint32_t            : 3;
      __IOM uint32_t CHSEL2     : 5;            /*!< [20..16] Channel Select                                                   */
            uint32_t            : 3;
      __IOM uint32_t CHSEL3     : 5;            /*!< [28..24] Channel Select                                                   */
            uint32_t            : 3;
    } bit;
  } SQSLOT1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Sequence Configuration Register                            */
    
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
      __IOM uint32_t COLLCFG    : 1;            /*!< [6..6] Collision Config                                                   */
      __IOM uint32_t WFRCFG     : 1;            /*!< [7..7] Wait for Read Enable                                               */
      __IOM uint32_t TRGSEL     : 4;            /*!< [11..8] Trigger Select                                                    */
      __IOM uint32_t GTSEL      : 2;            /*!< [13..12] Gating Select                                                    */
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
      __IOM uint32_t GTSW       : 1;            /*!< [15..15] Trigger Software Gating                                          */
            uint32_t            : 16;
    } bit;
  } SQCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) SQ Channel Slot Register                                   */
    
    struct {
      __IOM uint32_t CHSEL0     : 5;            /*!< [4..0] Channel Select                                                     */
            uint32_t            : 3;
      __IOM uint32_t CHSEL1     : 5;            /*!< [12..8] Channel Select                                                    */
            uint32_t            : 3;
      __IOM uint32_t CHSEL2     : 5;            /*!< [20..16] Channel Select                                                   */
            uint32_t            : 3;
      __IOM uint32_t CHSEL3     : 5;            /*!< [28..24] Channel Select                                                   */
            uint32_t            : 3;
    } bit;
  } SQSLOT2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Sequence Configuration Register                            */
    
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
      __IOM uint32_t COLLCFG    : 1;            /*!< [6..6] Collision Config                                                   */
      __IOM uint32_t WFRCFG     : 1;            /*!< [7..7] Wait for Read Enable                                               */
      __IOM uint32_t TRGSEL     : 4;            /*!< [11..8] Trigger Select                                                    */
      __IOM uint32_t GTSEL      : 2;            /*!< [13..12] Gating Select                                                    */
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
      __IOM uint32_t GTSW       : 1;            /*!< [15..15] Trigger Software Gating                                          */
            uint32_t            : 16;
    } bit;
  } SQCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) SQ Channel Slot Register                                   */
    
