popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CHSEL0     : 5;            /*!< [4..0] Channel Select                                                     */
            uint32_t            : 3;
      __IOM uint32_t CHSEL1     : 5;            /*!< [12..8] Channel Select                                                    */
            uint32_t            : 3;
      __IOM uint32_t CHSEL2     : 5;            /*!< [20..16] Channel Select                                                   */
            uint32_t            : 3;
      __IOM uint32_t CHSEL3     : 5;            /*!< [28..24] Channel Select                                                   */
            uint32_t            : 3;
    } bit;
  } SQSLOT3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Sequence Status Register                                   */
    
    struct {
      __IOM uint32_t SQ0        : 1;            /*!< [0..0] SQ 0 Interrupt Status                                              */
      __IOM uint32_t SQ1        : 1;            /*!< [1..1] SQ 1 Interrupt Status                                              */
      __IOM uint32_t SQ2        : 1;            /*!< [2..2] SQ 2 Interrupt Status                                              */
      __IOM uint32_t SQ3        : 1;            /*!< [3..3] SQ 3 Interrupt Status                                              */
      __IOM uint32_t WFR0       : 1;            /*!< [4..4] Wait for Read 0 Status                                             */
      __IOM uint32_t WFR1       : 1;            /*!< [5..5] Wait for Read 1 Status                                             */
      __IOM uint32_t WFR2       : 1;            /*!< [6..6] Wait for Read 2 Status                                             */
      __IOM uint32_t WFR3       : 1;            /*!< [7..7] Wait for Read 3 Status                                             */
      __IOM uint32_t COLL0      : 1;            /*!< [8..8] Collision 0 Status                                                 */
      __IOM uint32_t COLL1      : 1;            /*!< [9..9] Collision 1 Status                                                 */
      __IOM uint32_t COLL2      : 1;            /*!< [10..10] Collision 2 Status                                               */
      __IOM uint32_t COLL3      : 1;            /*!< [11..11] Collision 3 Status                                               */
            uint32_t            : 4;
      __IOM uint32_t SQNUM      : 3;            /*!< [18..16] Actual Sequence processed                                        */
            uint32_t            : 13;
    } bit;
  } SQSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Sequence Status Clear Register                             */
    
    struct {
      __IOM uint32_t SQ0CLR     : 1;            /*!< [0..0] SQ 0 Interrupt Status Clear                                        */
      __IOM uint32_t SQ1CLR     : 1;            /*!< [1..1] SQ 1 Interrupt Status Clear                                        */
      __IOM uint32_t SQ2CLR     : 1;            /*!< [2..2] SQ 2 Interrupt Status Clear                                        */
      __IOM uint32_t SQ3CLR     : 1;            /*!< [3..3] SQ 3 Interrupt Status Clear                                        */
      __IOM uint32_t WFR0CLR    : 1;            /*!< [4..4] Wait for Read 0 Status Clear                                       */
      __IOM uint32_t WFR1CLR    : 1;            /*!< [5..5] Wait for Read 1 Status Clear                                       */
      __IOM uint32_t WFR2CLR    : 1;            /*!< [6..6] Wait for Read 2 Status Clear                                       */
      __IOM uint32_t WFR3CLR    : 1;            /*!< [7..7] Wait for Read 3 Status Clear                                       */
      __IOM uint32_t COLL0CLR   : 1;            /*!< [8..8] Collision 0 Status Clear                                           */
      __IOM uint32_t COLL1CLR   : 1;            /*!< [9..9] Collision 1 Status Clear                                           */
      __IOM uint32_t COLL2CLR   : 1;            /*!< [10..10] Collision 2 Status Clear                                         */
      __IOM uint32_t COLL3CLR   : 1;            /*!< [11..11] Collision 3 Status Clear                                         */
            uint32_t            : 20;
    } bit;
  } SQSTATCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Sequence Status Clear Register                             */
    
    struct {
      __IOM uint32_t SQ0SET     : 1;            /*!< [0..0] SQ 0 Interrupt Status Set                                          */
      __IOM uint32_t SQ1SET     : 1;            /*!< [1..1] SQ 1 Interrupt Status Set                                          */
      __IOM uint32_t SQ2SET     : 1;            /*!< [2..2] SQ 2 Interrupt Status Set                                          */
      __IOM uint32_t SQ3SET     : 1;            /*!< [3..3] SQ 3 Interrupt Status Set                                          */
      __IOM uint32_t WFR0SET    : 1;            /*!< [4..4] Wait for Read 0 Status Set                                         */
      __IOM uint32_t WFR1SET    : 1;            /*!< [5..5] Wait for Read 1 Status Set                                         */
      __IOM uint32_t WFR2SET    : 1;            /*!< [6..6] Wait for Read 2 Status Set                                         */
      __IOM uint32_t WFR3SET    : 1;            /*!< [7..7] Wait for Read 3 Status Set                                         */
      __IOM uint32_t COLL0SET   : 1;            /*!< [8..8] Collision 0 Status Set                                             */
      __IOM uint32_t COLL1SET   : 1;            /*!< [9..9] Collision 1 Status Set                                             */
      __IOM uint32_t COLL2SET   : 1;            /*!< [10..10] Collision 2 Status Set                                           */
      __IOM uint32_t COLL3SET   : 1;            /*!< [11..11] Collision 3 Status Set                                           */
            uint32_t            : 20;
    } bit;
  } SQSTATSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Channel Configuration Register                             */
    
