popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Channel Configuration Register                             */
    
