popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG12;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG13;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) Channel Configuration Register                             */
    
