popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG14;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG15;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG16;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG17;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG18;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t INSEL      : 5;            /*!< [4..0] ADC Input Selection                                                */
            uint32_t            : 3;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 3;            /*!< [18..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 3;            /*!< [21..19] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [23..22] Conversion Class Selection                                       */
            uint32_t            : 8;
    } bit;
  } CHCFG19;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Channel Status Register                                    */
    
    struct {
      __IOM uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Status                                                   */
      __IOM uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Status                                                   */
      __IOM uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Status                                                   */
      __IOM uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Status                                                   */
      __IOM uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Status                                                   */
      __IOM uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Status                                                   */
      __IOM uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Status                                                   */
      __IOM uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Status                                                   */
      __IOM uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Status                                                   */
      __IOM uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Status                                                   */
      __IOM uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Status                                                */
      __IOM uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Status                                                */
      __IOM uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Status                                                */
      __IOM uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Status                                                */
      __IOM uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Status                                                */
      __IOM uint32_t CH15       : 1;            /*!< [15..15] Channel 15 Status                                                */
      __IOM uint32_t CH16       : 1;            /*!< [16..16] Channel 16 Status                                                */
      __IOM uint32_t CH17       : 1;            /*!< [17..17] Channel 17 Status                                                */
      __IOM uint32_t CH18       : 1;            /*!< [18..18] Channel 18 Status                                                */
      __IOM uint32_t CH19       : 1;            /*!< [19..19] Channel 19 Status                                                */
            uint32_t            : 4;
      __IOM uint32_t CHNUM      : 5;            /*!< [28..24] Current Channel under conversion                                 */
            uint32_t            : 3;
    } bit;
  } CHSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Channel Status Register                                    */
    
