popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t CH0CLR     : 1;            /*!< [0..0] Channel 0 Status clear flag                                        */
      __OM  uint32_t CH1CLR     : 1;            /*!< [1..1] Channel 1 Status clear flag                                        */
      __OM  uint32_t CH2CLR     : 1;            /*!< [2..2] Channel 2 Status clear flag                                        */
      __OM  uint32_t CH3CLR     : 1;            /*!< [3..3] Channel 3 Status clear flag                                        */
      __OM  uint32_t CH4CLR     : 1;            /*!< [4..4] Channel 4 Status clear flag                                        */
      __OM  uint32_t CH5CLR     : 1;            /*!< [5..5] Channel 5 Status clear flag                                        */
      __OM  uint32_t CH6CLR     : 1;            /*!< [6..6] Channel 6 Status clear flag                                        */
      __OM  uint32_t CH7CLR     : 1;            /*!< [7..7] Channel 7 Status clear flag                                        */
      __OM  uint32_t CH8CLR     : 1;            /*!< [8..8] Channel 8 Status clear flag                                        */
      __OM  uint32_t CH9CLR     : 1;            /*!< [9..9] Channel 9 Status clear flag                                        */
      __OM  uint32_t CH10CLR    : 1;            /*!< [10..10] Channel 10 Status clear flag                                     */
      __OM  uint32_t CH11CLR    : 1;            /*!< [11..11] Channel 11 Status clear flag                                     */
      __OM  uint32_t CH12CLR    : 1;            /*!< [12..12] Channel 12 Status clear flag                                     */
      __OM  uint32_t CH13CLR    : 1;            /*!< [13..13] Channel 13 Status clear flag                                     */
      __OM  uint32_t CH14CLR    : 1;            /*!< [14..14] Channel 14 Status clear flag                                     */
      __OM  uint32_t CH15CLR    : 1;            /*!< [15..15] Channel 15 Status clear flag                                     */
      __OM  uint32_t CH16CLR    : 1;            /*!< [16..16] Channel 16 Status clear flag                                     */
      __OM  uint32_t CH17CLR    : 1;            /*!< [17..17] Channel 17 Status clear flag                                     */
      __OM  uint32_t CH18CLR    : 1;            /*!< [18..18] Channel 18 Status clear flag                                     */
      __OM  uint32_t CH19CLR    : 1;            /*!< [19..19] Channel 19 Status clear flag                                     */
            uint32_t            : 12;
    } bit;
  } CHSTATCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) Channel Status Set Register                                */
    
    struct {
      __OM  uint32_t CH0SET     : 1;            /*!< [0..0] Channel 0 Status set flag                                          */
      __OM  uint32_t CH1SET     : 1;            /*!< [1..1] Channel 1 Status set flag                                          */
      __OM  uint32_t CH2SET     : 1;            /*!< [2..2] Channel 2 Status set flag                                          */
      __OM  uint32_t CH3SET     : 1;            /*!< [3..3] Channel 3 Status set flag                                          */
      __OM  uint32_t CH4SET     : 1;            /*!< [4..4] Channel 4 Status set flag                                          */
      __OM  uint32_t CH5SET     : 1;            /*!< [5..5] Channel 5 Status set flag                                          */
      __OM  uint32_t CH6SET     : 1;            /*!< [6..6] Channel 6 Status set flag                                          */
      __OM  uint32_t CH7SET     : 1;            /*!< [7..7] Channel 7 Status set flag                                          */
      __OM  uint32_t CH8SET     : 1;            /*!< [8..8] Channel 8 Status set flag                                          */
      __OM  uint32_t CH9SET     : 1;            /*!< [9..9] Channel 9 Status set flag                                          */
      __OM  uint32_t CH10SET    : 1;            /*!< [10..10] Channel 10 Status set flag                                       */
      __OM  uint32_t CH11SET    : 1;            /*!< [11..11] Channel 11 Status set flag                                       */
      __OM  uint32_t CH12SET    : 1;            /*!< [12..12] Channel 12 Status set flag                                       */
      __OM  uint32_t CH13SET    : 1;            /*!< [13..13] Channel 13 Status set flag                                       */
      __OM  uint32_t CH14SET    : 1;            /*!< [14..14] Channel 14 Status set flag                                       */
      __OM  uint32_t CH15SET    : 1;            /*!< [15..15] Channel 15 Status set flag                                       */
      __OM  uint32_t CH16SET    : 1;            /*!< [16..16] Channel 16 Status set flag                                       */
      __OM  uint32_t CH17SET    : 1;            /*!< [17..17] Channel 17 Status set flag                                       */
      __OM  uint32_t CH18SET    : 1;            /*!< [18..18] Channel 18 Status set flag                                       */
      __OM  uint32_t CH19SET    : 1;            /*!< [19..19] Channel 19 Status set flag                                       */
            uint32_t            : 12;
    } bit;
  } CHSTATSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t TCONF      : 2;            /*!< [1..0] Tracking Conversion config                                         */
      __IOM uint32_t OVERS      : 2;            /*!< [3..2] Oversampling config                                                */
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
      __IOM uint32_t SESP       : 1;            /*!< [8..8] Spreaded early sample point config                                 */
            uint32_t            : 1;
      __IOM uint32_t MSBD       : 1;            /*!< [10..10] MSB doubling enable                                              */
      __IOM uint32_t PCAL       : 1;            /*!< [11..11] Post Calibration enable                                          */
      __IOM uint32_t BWD        : 2;            /*!< [13..12] BWD timing config                                                */
      __IOM uint32_t BWD_HI_CUR : 1;            /*!< [14..14] BWD current configuration                                        */
            uint32_t            : 17;
    } bit;
  } CONVCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) Channel Configuration Register                             */
    
