popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t TCONF      : 2;            /*!< [1..0] Tracking Conversion config                                         */
      __IOM uint32_t OVERS      : 2;            /*!< [3..2] Oversampling config                                                */
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
      __IOM uint32_t SESP       : 1;            /*!< [8..8] Spreaded early sample point config                                 */
            uint32_t            : 1;
      __IOM uint32_t MSBD       : 1;            /*!< [10..10] MSB doubling enable                                              */
      __IOM uint32_t PCAL       : 1;            /*!< [11..11] Post Calibration enable                                          */
      __IOM uint32_t BWD        : 2;            /*!< [13..12] BWD timing config                                                */
      __IOM uint32_t BWD_HI_CUR : 1;            /*!< [14..14] BWD current configuration                                        */
            uint32_t            : 17;
    } bit;
  } CONVCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t TCONF      : 2;            /*!< [1..0] Tracking Conversion config                                         */
      __IOM uint32_t OVERS      : 2;            /*!< [3..2] Oversampling config                                                */
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
      __IOM uint32_t SESP       : 1;            /*!< [8..8] Spreaded early sample point config                                 */
            uint32_t            : 1;
      __IOM uint32_t MSBD       : 1;            /*!< [10..10] MSB doubling enable                                              */
      __IOM uint32_t PCAL       : 1;            /*!< [11..11] Post Calibration enable                                          */
      __IOM uint32_t BWD        : 2;            /*!< [13..12] BWD timing config                                                */
      __IOM uint32_t BWD_HI_CUR : 1;            /*!< [14..14] BWD current configuration                                        */
            uint32_t            : 17;
    } bit;
  } CONVCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Channel Configuration Register                             */
    
    struct {
      __IOM uint32_t TCONF      : 2;            /*!< [1..0] Tracking Conversion config                                         */
      __IOM uint32_t OVERS      : 2;            /*!< [3..2] Oversampling config                                                */
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
      __IOM uint32_t SESP       : 1;            /*!< [8..8] Spreaded early sample point config                                 */
            uint32_t            : 1;
      __IOM uint32_t MSBD       : 1;            /*!< [10..10] MSB doubling enable                                              */
      __IOM uint32_t PCAL       : 1;            /*!< [11..11] Post Calibration enable                                          */
      __IOM uint32_t BWD        : 2;            /*!< [13..12] BWD timing config                                                */
      __IOM uint32_t BWD_HI_CUR : 1;            /*!< [14..14] BWD current configuration                                        */
            uint32_t            : 17;
    } bit;
  } CONVCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Calibration Enable                                         */
    
    struct {
      __IOM uint32_t CALEN0     : 1;            /*!< [0..0] Channel 0 Calibration Enable                                       */
      __IOM uint32_t CALEN1     : 1;            /*!< [1..1] Channel 1 Calibration Enable                                       */
      __IOM uint32_t CALEN2     : 1;            /*!< [2..2] Channel 2 Calibration Enable                                       */
      __IOM uint32_t CALEN3     : 1;            /*!< [3..3] Channel 3 Calibration Enable                                       */
      __IOM uint32_t CALEN4     : 1;            /*!< [4..4] Channel 4 Calibration Enable                                       */
      __IOM uint32_t CALEN5     : 1;            /*!< [5..5] Channel 5 Calibration Enable                                       */
      __IOM uint32_t CALEN6     : 1;            /*!< [6..6] Channel 6 Calibration Enable                                       */
      __IOM uint32_t CALEN7     : 1;            /*!< [7..7] Channel 7 Calibration Enable                                       */
      __IOM uint32_t CALEN8     : 1;            /*!< [8..8] Channel 8 Calibration Enable                                       */
      __IOM uint32_t CALEN9     : 1;            /*!< [9..9] Channel 9 Calibration Enable                                       */
      __IOM uint32_t CALEN10    : 1;            /*!< [10..10] Channel 10 Calibration Enable                                    */
      __IOM uint32_t CALEN11    : 1;            /*!< [11..11] Channel 11 Calibration Enable                                    */
      __IOM uint32_t CALEN12    : 1;            /*!< [12..12] Channel 12 Calibration Enable                                    */
      __IOM uint32_t CALEN13    : 1;            /*!< [13..13] Channel 13 Calibration Enable                                    */
      __IOM uint32_t CALEN14    : 1;            /*!< [14..14] Channel 14 Calibration Enable                                    */
      __IOM uint32_t CALEN15    : 1;            /*!< [15..15] Channel 15 Calibration Enable                                    */
      __IOM uint32_t CALEN16    : 1;            /*!< [16..16] Channel 16 Calibration Enable                                    */
      __IOM uint32_t CALEN17    : 1;            /*!< [17..17] Channel 17 Calibration Enable                                    */
      __IOM uint32_t CALEN18    : 1;            /*!< [18..18] Channel 18 Calibration Enable                                    */
      __IOM uint32_t CALEN19    : 1;            /*!< [19..19] Channel 19 Calibration Enable                                    */
      __IOM uint32_t CALEN20    : 1;            /*!< [20..20] Channel 20 Calibration Enable                                    */
      __IOM uint32_t CALEN21    : 1;            /*!< [21..21] Channel 21 Calibration Enable                                    */
      __IOM uint32_t CALEN22    : 1;            /*!< [22..22] Channel 22 Calibration Enable                                    */
      __IOM uint32_t CALEN23    : 1;            /*!< [23..23] Channel 23 Calibration Enable                                    */
      __IOM uint32_t CALEN24    : 1;            /*!< [24..24] Channel 24 Calibration Enable                                    */
      __IOM uint32_t CALEN25    : 1;            /*!< [25..25] Channel 25 Calibration Enable                                    */
      __IOM uint32_t CALEN26    : 1;            /*!< [26..26] Channel 26 Calibration Enable                                    */
            uint32_t            : 5;
    } bit;
  } CALEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Calibration Protection Enable                              */
    
