popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CALPEN0    : 1;            /*!< [0..0] Channel 0 Calibration Protection                                   */
      __IOM uint32_t CALPEN1    : 1;            /*!< [1..1] Channel 1 Calibration Protection                                   */
      __IOM uint32_t CALPEN2    : 1;            /*!< [2..2] Channel 2 Calibration Protection                                   */
      __IOM uint32_t CALPEN3    : 1;            /*!< [3..3] Channel 3 Calibration Protection                                   */
      __IOM uint32_t CALPEN4    : 1;            /*!< [4..4] Channel 4 Calibration Protection                                   */
      __IOM uint32_t CALPEN5    : 1;            /*!< [5..5] Channel 5 Calibration Protection                                   */
      __IOM uint32_t CALPEN6    : 1;            /*!< [6..6] Channel 6 Calibration Protection                                   */
      __IOM uint32_t CALPEN7    : 1;            /*!< [7..7] Channel 7 Calibration Protection                                   */
      __IOM uint32_t CALPEN8    : 1;            /*!< [8..8] Channel 8 Calibration Protection                                   */
      __IOM uint32_t CALPEN9    : 1;            /*!< [9..9] Channel 9 Calibration Protection                                   */
      __IOM uint32_t CALPEN10   : 1;            /*!< [10..10] Channel 10 Calibration Protection                                */
      __IOM uint32_t CALPEN11   : 1;            /*!< [11..11] Channel 11 Calibration Protection                                */
      __IOM uint32_t CALPEN12   : 1;            /*!< [12..12] Channel 12 Calibration Protection                                */
      __IOM uint32_t CALPEN13   : 1;            /*!< [13..13] Channel 13 Calibration Protection                                */
      __IOM uint32_t CALPEN14   : 1;            /*!< [14..14] Channel 14 Calibration Protection                                */
      __IOM uint32_t CALPEN15   : 1;            /*!< [15..15] Channel 15 Calibration Protection                                */
      __IOM uint32_t CALPEN16   : 1;            /*!< [16..16] Channel 16 Calibration Protection                                */
      __IOM uint32_t CALPEN17   : 1;            /*!< [17..17] Channel 17 Calibration Protection                                */
      __IOM uint32_t CALPEN18   : 1;            /*!< [18..18] Channel 18 Calibration Protection                                */
      __IOM uint32_t CALPEN19   : 1;            /*!< [19..19] Channel 19 Calibration Protection                                */
      __IOM uint32_t CALPEN20   : 1;            /*!< [20..20] Channel 20 Calibration Protection                                */
      __IOM uint32_t CALPEN21   : 1;            /*!< [21..21] Channel 21 Calibration Protection                                */
      __IOM uint32_t CALPEN22   : 1;            /*!< [22..22] Channel 22 Calibration Protection                                */
      __IOM uint32_t CALPEN23   : 1;            /*!< [23..23] Channel 23 Calibration Protection                                */
      __IOM uint32_t CALPEN24   : 1;            /*!< [24..24] Channel 24 Calibration Protection                                */
      __IOM uint32_t CALPEN25   : 1;            /*!< [25..25] Channel 25 Calibration Protection                                */
      __IOM uint32_t CALPEN26   : 1;            /*!< [26..26] Channel 26 Calibration Protection                                */
            uint32_t            : 5;
    } bit;
  } CALPEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Filter Configuration                                       */
    
    struct {
      __IOM uint32_t COEF_A0    : 2;            /*!< [1..0] Filter Coefficient                                                 */
            uint32_t            : 2;
      __IOM uint32_t COEF_A1    : 2;            /*!< [5..4] Filter Coefficient                                                 */
            uint32_t            : 2;
      __IOM uint32_t COEF_A2    : 2;            /*!< [9..8] Filter Coefficient                                                 */
            uint32_t            : 2;
      __IOM uint32_t COEF_A3    : 2;            /*!< [13..12] Filter Coefficient                                               */
            uint32_t            : 18;
    } bit;
  } FILTCFG;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000B4) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 16;           /*!< [15..0] Filter Result Value                                               */
            uint32_t            : 16;
    } bit;
  } FIL0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000B8) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 16;           /*!< [15..0] Filter Result Value                                               */
            uint32_t            : 16;
    } bit;
  } FIL1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000BC) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 16;           /*!< [15..0] Filter Result Value                                               */
            uint32_t            : 16;
    } bit;
  } FIL2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000C0) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 16;           /*!< [15..0] Filter Result Value                                               */
            uint32_t            : 16;
    } bit;
  } FIL3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) Filter Status Register                                     */
    
    struct {
      __IOM uint32_t FIL0       : 1;            /*!< [0..0] Filter 0 Event flag                                                */
      __IOM uint32_t FIL1       : 1;            /*!< [1..1] Filter 1 Event flag                                                */
      __IOM uint32_t FIL2       : 1;            /*!< [2..2] Filter 2 Event flag                                                */
      __IOM uint32_t FIL3       : 1;            /*!< [3..3] Filter 3 Event flag                                                */
            uint32_t            : 28;
    } bit;
  } FILSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C8) Filter Status Clear Register                               */
    
