popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t FIL0CLR    : 1;            /*!< [0..0] Filter 0 Event flag clear                                          */
      __OM  uint32_t FIL1CLR    : 1;            /*!< [1..1] Filter 1 Event flag clear                                          */
      __OM  uint32_t FIL2CLR    : 1;            /*!< [2..2] Filter 2 Event flag clear                                          */
      __OM  uint32_t FIL3CLR    : 1;            /*!< [3..3] Filter 3 Event flag clear                                          */
            uint32_t            : 28;
    } bit;
  } FILSTATCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000CC) Filter Status Set Register                                 */
    
    struct {
      __OM  uint32_t FIL0SET    : 1;            /*!< [0..0] Filter 0 Event flag set                                            */
      __OM  uint32_t FIL1SET    : 1;            /*!< [1..1] Filter 1 Event flag set                                            */
      __OM  uint32_t FIL2SET    : 1;            /*!< [2..2] Filter 2 Event flag set                                            */
      __OM  uint32_t FIL3SET    : 1;            /*!< [3..3] Filter 3 Event flag set                                            */
            uint32_t            : 28;
    } bit;
  } FILSTATSET;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000D0) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000D4) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000D8) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000DC) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000E0) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES4;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000E4) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES5;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000E8) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES6;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000EC) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES7;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000F0) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES8;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000F4) Result Register                                            */
    
