popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES9;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000F8) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES10;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000FC) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES11;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000100) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES12;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000104) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES13;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000108) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES14;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000010C) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES15;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000110) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES16;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000114) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES17;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000118) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES18;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000011C) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 14;           /*!< [13..0] Result Value                                                      */
            uint32_t            : 1;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES19;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000120) Compare Channel 0 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis set for lower compare threshold                       */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000124) Compare Channel 1 Control Register                         */
    
