popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis set for lower compare threshold                       */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000128) Compare Channel 2 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis set for lower compare threshold                       */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000012C) Compare Channel 3 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis set for lower compare threshold                       */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000130) Compare Status Register                                    */
    
    struct {
      __IOM uint32_t CMP_LO0_STS : 1;           /*!< [0..0] Compare 0 low Status                                               */
      __IOM uint32_t CMP_LO1_STS : 1;           /*!< [1..1] Compare 1 low Status                                               */
      __IOM uint32_t CMP_LO2_STS : 1;           /*!< [2..2] Compare 2 low Status                                               */
      __IOM uint32_t CMP_LO3_STS : 1;           /*!< [3..3] Compare 3 low Status                                               */
      __IOM uint32_t CMP_LO0_IS : 1;            /*!< [4..4] Compare 0 low Interrupt Status                                     */
      __IOM uint32_t CMP_LO1_IS : 1;            /*!< [5..5] Compare 1 low Interrupt Status                                     */
      __IOM uint32_t CMP_LO2_IS : 1;            /*!< [6..6] Compare 2 low Interrupt Status                                     */
      __IOM uint32_t CMP_LO3_IS : 1;            /*!< [7..7] Compare 3 low Interrupt Status                                     */
            uint32_t            : 8;
      __IOM uint32_t CMP_UP0_STS : 1;           /*!< [16..16] Compare 0 up Status                                              */
      __IOM uint32_t CMP_UP1_STS : 1;           /*!< [17..17] Compare 1 up Status                                              */
      __IOM uint32_t CMP_UP2_STS : 1;           /*!< [18..18] Compare 2 up Status                                              */
      __IOM uint32_t CMP_UP3_STS : 1;           /*!< [19..19] Compare 3 up Status                                              */
      __IOM uint32_t CMP_UP0_IS : 1;            /*!< [20..20] Compare 0 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP1_IS : 1;            /*!< [21..21] Compare 1 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP2_IS : 1;            /*!< [22..22] Compare 2 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP3_IS : 1;            /*!< [23..23] Compare 3 up Interrupt Status                                    */
            uint32_t            : 8;
    } bit;
  } CMPSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000134) Compare Status Clear Register                              */
    
