popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t CMP_LO0_STSCLR : 1;        /*!< [0..0] Compare 0 low Status clear                                         */
      __OM  uint32_t CMP_LO1_STSCLR : 1;        /*!< [1..1] Compare 1 low Status clear                                         */
      __OM  uint32_t CMP_LO2_STSCLR : 1;        /*!< [2..2] Compare 2 low Status clear                                         */
      __OM  uint32_t CMP_LO3_STSCLR : 1;        /*!< [3..3] Compare 3 low Status clear                                         */
      __OM  uint32_t CMP_LO0_ISCLR : 1;         /*!< [4..4] Compare 0 low Interrupt clear                                      */
      __OM  uint32_t CMP_LO1_ISCLR : 1;         /*!< [5..5] Compare 1 low Interrupt clear                                      */
      __OM  uint32_t CMP_LO2_ISCLR : 1;         /*!< [6..6] Compare 2 low Interrupt clear                                      */
      __OM  uint32_t CMP_LO3_ISCLR : 1;         /*!< [7..7] Compare 3 low Interrupt clear                                      */
            uint32_t            : 8;
      __OM  uint32_t CMP_UP0_STSCLR : 1;        /*!< [16..16] Compare 0 up Status clear                                        */
      __OM  uint32_t CMP_UP1_STSCLR : 1;        /*!< [17..17] Compare 1 up Status clear                                        */
      __OM  uint32_t CMP_UP2_STSCLR : 1;        /*!< [18..18] Compare 2 up Status clear                                        */
      __OM  uint32_t CMP_UP3_STSCLR : 1;        /*!< [19..19] Compare 3 up Status clear                                        */
      __OM  uint32_t CMP_UP0_ISCLR : 1;         /*!< [20..20] Compare 0 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP1_ISCLR : 1;         /*!< [21..21] Compare 1 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP2_ISCLR : 1;         /*!< [22..22] Compare 2 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP3_ISCLR : 1;         /*!< [23..23] Compare 3 up Interrupt clear                                     */
            uint32_t            : 8;
    } bit;
  } CMPSTATCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000138) Compare Status Set Register                                */
    
    struct {
      __OM  uint32_t CMP_LO0_STSSET : 1;        /*!< [0..0] Compare 0 low Status set                                           */
      __OM  uint32_t CMP_LO1_STSSET : 1;        /*!< [1..1] Compare 1 low Status set                                           */
      __OM  uint32_t CMP_LO2_STSSET : 1;        /*!< [2..2] Compare 2 low Status set                                           */
      __OM  uint32_t CMP_LO3_STSSET : 1;        /*!< [3..3] Compare 3 low Status set                                           */
      __OM  uint32_t CMP_LO0_ISSET : 1;         /*!< [4..4] Compare 0 low Interupt set                                         */
      __OM  uint32_t CMP_LO1_ISSET : 1;         /*!< [5..5] Compare 1 low Interupt set                                         */
      __OM  uint32_t CMP_LO2_ISSET : 1;         /*!< [6..6] Compare 2 low Interupt set                                         */
      __OM  uint32_t CMP_LO3_ISSET : 1;         /*!< [7..7] Compare 3 low Interupt set                                         */
            uint32_t            : 8;
      __OM  uint32_t CMP_UP0_STSSET : 1;        /*!< [16..16] Compare 0 up Status set                                          */
      __OM  uint32_t CMP_UP1_STSSET : 1;        /*!< [17..17] Compare 1 up Status set                                          */
      __OM  uint32_t CMP_UP2_STSSET : 1;        /*!< [18..18] Compare 2 up Status set                                          */
      __OM  uint32_t CMP_UP3_STSSET : 1;        /*!< [19..19] Compare 3 up Status set                                          */
      __OM  uint32_t CMP_UP0_ISSET : 1;         /*!< [20..20] Compare 0 up Interrupt set                                       */
      __OM  uint32_t CMP_UP1_ISSET : 1;         /*!< [21..21] Compare 1 up Interrupt set                                       */
      __OM  uint32_t CMP_UP2_ISSET : 1;         /*!< [22..22] Compare 2 up Interrupt set                                       */
      __OM  uint32_t CMP_UP3_ISSET : 1;         /*!< [23..23] Compare 3 up Interrupt set                                       */
            uint32_t            : 8;
    } bit;
  } CMPSTATSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000013C) Interrupt Enable Register 0                                */
    
    struct {
      __IOM uint32_t IEN_CH0    : 1;            /*!< [0..0] Channel 0 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH1    : 1;            /*!< [1..1] Channel 1 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH2    : 1;            /*!< [2..2] Channel 2 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH3    : 1;            /*!< [3..3] Channel 3 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH4    : 1;            /*!< [4..4] Channel 4 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH5    : 1;            /*!< [5..5] Channel 5 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH6    : 1;            /*!< [6..6] Channel 6 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH7    : 1;            /*!< [7..7] Channel 7 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH8    : 1;            /*!< [8..8] Channel 8 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH9    : 1;            /*!< [9..9] Channel 9 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH10   : 1;            /*!< [10..10] Channel 10 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH11   : 1;            /*!< [11..11] Channel 11 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH12   : 1;            /*!< [12..12] Channel 12 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH13   : 1;            /*!< [13..13] Channel 13 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH14   : 1;            /*!< [14..14] Channel 14 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH15   : 1;            /*!< [15..15] Channel 15 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH16   : 1;            /*!< [16..16] Channel 16 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH17   : 1;            /*!< [17..17] Channel 17 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH18   : 1;            /*!< [18..18] Channel 18 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH19   : 1;            /*!< [19..19] Channel 19 Interrupt Enable                                      */
      __IOM uint32_t IEN_SQ0    : 1;            /*!< [20..20] Sequence 0 Interrupt Enable                                      */
      __IOM uint32_t IEN_SQ1    : 1;            /*!< [21..21] Sequence 1 Interrupt Enable                                      */
      __IOM uint32_t IEN_SQ2    : 1;            /*!< [22..22] Sequence 2 Interrupt Enable                                      */
      __IOM uint32_t IEN_SQ3    : 1;            /*!< [23..23] Sequence 3 Interrupt Enable                                      */
      __IOM uint32_t IEN_LO0    : 1;            /*!< [24..24] Compare 0 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO1    : 1;            /*!< [25..25] Compare 1 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO2    : 1;            /*!< [26..26] Compare 2 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO3    : 1;            /*!< [27..27] Compare 3 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_UP0    : 1;            /*!< [28..28] Compare 0 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP1    : 1;            /*!< [29..29] Compare 1 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP2    : 1;            /*!< [30..30] Compare 2 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP3    : 1;            /*!< [31..31] Compare 3 UP Interrupt Enable                                    */
    } bit;
  } IEN0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000140) Interrupt Enable Register 1                                */
    
