popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t IEN_COLL0  : 1;            /*!< [0..0] Collision 0 Interrupt Enable                                       */
      __IOM uint32_t IEN_COLL1  : 1;            /*!< [1..1] Collision 1 Interrupt Enable                                       */
      __IOM uint32_t IEN_COLL2  : 1;            /*!< [2..2] Collision 2 Interrupt Enable                                       */
      __IOM uint32_t IEN_COLL3  : 1;            /*!< [3..3] Collision 3 Interrupt Enable                                       */
      __IOM uint32_t IEN_WFR0   : 1;            /*!< [4..4] WFR 0 Interrupt Enable                                             */
      __IOM uint32_t IEN_WFR1   : 1;            /*!< [5..5] WFR 1 Interrupt Enable                                             */
      __IOM uint32_t IEN_WFR2   : 1;            /*!< [6..6] WFR 2 Interrupt Enable                                             */
      __IOM uint32_t IEN_WFR3   : 1;            /*!< [7..7] WFR 3 Interrupt Enable                                             */
            uint32_t            : 24;
    } bit;
  } IEN1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000144) Interrupt Node Pointer Register 0                          */
    
    struct {
      __IOM uint32_t INP_CH0    : 2;            /*!< [1..0] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH1    : 2;            /*!< [3..2] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH2    : 2;            /*!< [5..4] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH3    : 2;            /*!< [7..6] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH4    : 2;            /*!< [9..8] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH5    : 2;            /*!< [11..10] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH6    : 2;            /*!< [13..12] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH7    : 2;            /*!< [15..14] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH8    : 2;            /*!< [17..16] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH9    : 2;            /*!< [19..18] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH10   : 2;            /*!< [21..20] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH11   : 2;            /*!< [23..22] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH12   : 2;            /*!< [25..24] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH13   : 2;            /*!< [27..26] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH14   : 2;            /*!< [29..28] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH15   : 2;            /*!< [31..30] Channel Interrupt Node Pointer                                   */
    } bit;
  } INP0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000148) Interrupt Node Pointer Register 1                          */
    
    struct {
      __IOM uint32_t INP_CH16   : 2;            /*!< [1..0] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH17   : 2;            /*!< [3..2] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH18   : 2;            /*!< [5..4] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH19   : 2;            /*!< [7..6] Channel Interrupt Node Pointer                                     */
            uint32_t            : 24;
    } bit;
  } INP1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000014C) Interrupt Node Pointer Register 2                          */
    
    struct {
      __IOM uint32_t INP_CMP_LO0 : 2;           /*!< [1..0] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO1 : 2;           /*!< [3..2] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO2 : 2;           /*!< [5..4] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO3 : 2;           /*!< [7..6] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_UP0 : 2;           /*!< [9..8] Compare Up Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_UP1 : 2;           /*!< [11..10] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP2 : 2;           /*!< [13..12] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP3 : 2;           /*!< [15..14] Compare Up Interrupt Node Pointer                                */
            uint32_t            : 16;
    } bit;
  } INP2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000150) Interrupt Node Pointer Register 3                          */
    
    struct {
      __IOM uint32_t INP_SQ0    : 2;            /*!< [1..0] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_SQ1    : 2;            /*!< [3..2] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_SQ2    : 2;            /*!< [5..4] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_SQ3    : 2;            /*!< [7..6] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_COLL0  : 2;            /*!< [9..8] Collision Interrupt Node Pointer                                   */
      __IOM uint32_t INP_COLL1  : 2;            /*!< [11..10] Collision Interrupt Node Pointer                                 */
      __IOM uint32_t INP_COLL2  : 2;            /*!< [13..12] Collision Interrupt Node Pointer                                 */
      __IOM uint32_t INP_COLL3  : 2;            /*!< [15..14] Collision Interrupt Node Pointer                                 */
      __IOM uint32_t INP_WFR0   : 2;            /*!< [17..16] Wait for read Interrupt Node Pointer                             */
      __IOM uint32_t INP_WFR1   : 2;            /*!< [19..18] Wait for read Interrupt Node Pointer                             */
      __IOM uint32_t INP_WFR2   : 2;            /*!< [21..20] Wait for read Interrupt Node Pointer                             */
      __IOM uint32_t INP_WFR3   : 2;            /*!< [23..22] Wait for read Interrupt Node Pointer                             */
            uint32_t            : 8;
    } bit;
  } INP3;
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000164) Shadow Transfer Control Register                           */
    
