popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t ST_SQSEL   : 3;            /*!< [2..0] Sequence Shadow Transfer Selection                                 */
            uint32_t            : 1;
      __IOM uint32_t ST_TRGSEL  : 3;            /*!< [6..4] Trigger Shadow Transfer Selection                                  */
            uint32_t            : 1;
      __IOM uint32_t ST_GTGSEL  : 3;            /*!< [10..8] Gating Shadow Transfer Selection                                  */
            uint32_t            : 1;
      __IOM uint32_t STE_SQSEL  : 1;            /*!< [12..12] Sequence Shadow Transfer Enable Selection                        */
      __IOM uint32_t STE_TRGSEL : 1;            /*!< [13..13] Trigger Shadow Transfer Enable Selection                         */
      __IOM uint32_t STE_GTGSEL : 1;            /*!< [14..14] Gating Shadow Transfer Enable Selection                          */
            uint32_t            : 1;
      __OM  uint32_t ST_SQSW    : 1;            /*!< [16..16] Sequence Software Shadow Transfer                                */
      __OM  uint32_t ST_TRGSW   : 1;            /*!< [17..17] Trigger Software Shadow Transfer                                 */
      __OM  uint32_t ST_GTGSW   : 1;            /*!< [18..18] Gating Software Shadow Transfer                                  */
            uint32_t            : 1;
      __IOM uint32_t STE_SQ     : 1;            /*!< [20..20] Sequence Shadow Transfer Enable                                  */
      __IOM uint32_t STE_TRG    : 1;            /*!< [21..21] Trigger Shadow Transfer Enable                                   */
      __IOM uint32_t STE_GTG    : 1;            /*!< [22..22] Gating Shadow Transfer Enable                                    */
            uint32_t            : 9;
    } bit;
  } SHDCTR;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000178) Calibration Setting for Analog Input 1                     */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000017C) Calibration Setting for Analog Input 3                     */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) Calibration Setting for Analog Input 5                     */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000184) Calibration Setting for Analog Input 7                     */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000188) Calibration Setting for Analog Input 9                     */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000018C) Calibration Setting for Analog Input 11                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000190) Calibration Setting for Analog Input 13                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI13;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000194) Calibration Setting for Analog Input 15                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI15;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000198) Calibration Setting for Analog Input 16                    */
    
