popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI16;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000019C) Calibration Setting for Analog Input 17                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI17;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A0) Calibration Setting for Analog Input 18                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI18;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A4) Calibration Setting for Analog Input 19                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI19;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A8) Calibration Setting for Analog Input 20                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI20;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001AC) Calibration Setting for Analog Input 21                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI21;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001B0) Calibration Setting for Analog Input 22                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI22;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001B4) Calibration Setting for Analog Input 23                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI23;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001B8) Calibration Setting for Analog Input 24                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI24;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001BC) Calibration Setting for Analog Input 25                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001C0) Calibration Setting for Analog Input 26                    */
    
    struct {
      __IOM uint32_t CALOFFS    : 6;            /*!< [5..0] Calibration Offset                                                 */
            uint32_t            : 10;
      __IOM uint32_t CALGAIN    : 10;           /*!< [25..16] Calibration Gain                                                 */
            uint32_t            : 6;
    } bit;
  } CALAI26;
} ADC1_Type;                                    /*!< Size = 452 (0x1c4)                                                        */



/* =========================================================================================================================== */
/* ================                                           ADC2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC2 (ADC2)
  */

typedef struct {                                /*!< (@ 0x4804C000) ADC2 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Global Configuration Register                              */
    
