popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Module Enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t ISTE       : 1;            /*!< [2..2] Idle shadow transfer enable                                        */
            uint32_t            : 29;
    } bit;
  } GLOBCONF;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Clock Control Register                                     */
    
    struct {
      __IOM uint32_t CLKDIV     : 4;            /*!< [3..0] Clock Divider Settings                                             */
            uint32_t            : 28;
    } bit;
  } CLKCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Suspend Control Register                                   */
    
    struct {
      __IOM uint32_t SUSEN      : 1;            /*!< [0..0] ADC1 Suspend Enable                                                */
      __IOM uint32_t SUSMOD     : 1;            /*!< [1..1] Suspend Mode                                                       */
            uint32_t            : 30;
    } bit;
  } SUSCTR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Suspend Status Register                                    */
    
    struct {
      __IM  uint32_t STAT       : 1;            /*!< [0..0] Suspend Mode Status                                                */
            uint32_t            : 31;
    } bit;
  } SUSSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Sequence Status Register                                   */
    
    struct {
      __IOM uint32_t SQ0        : 1;            /*!< [0..0] SQ 0 Interrupt Status                                              */
      __IOM uint32_t SQ1        : 1;            /*!< [1..1] SQ 1 Interrupt Status                                              */
      __IOM uint32_t SQ2        : 1;            /*!< [2..2] SQ 2 Interrupt Status                                              */
      __IOM uint32_t SQ3        : 1;            /*!< [3..3] SQ 3 Interrupt Status                                              */
            uint32_t            : 4;
      __IOM uint32_t COLL0      : 1;            /*!< [8..8] Collision 0 Status                                                 */
      __IOM uint32_t COLL1      : 1;            /*!< [9..9] Collision 1 Status                                                 */
      __IOM uint32_t COLL2      : 1;            /*!< [10..10] Collision 2 Status                                               */
      __IOM uint32_t COLL3      : 1;            /*!< [11..11] Collision 3 Status                                               */
            uint32_t            : 4;
      __IOM uint32_t SQNUM      : 3;            /*!< [18..16] Actual Sequence processed                                        */
            uint32_t            : 13;
    } bit;
  } SQSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Sequence Status Clear Register                             */
    
    struct {
      __IOM uint32_t SQ0CLR     : 1;            /*!< [0..0] SQ 0 Interrupt Status Clear                                        */
      __IOM uint32_t SQ1CLR     : 1;            /*!< [1..1] SQ 1 Interrupt Status Clear                                        */
      __IOM uint32_t SQ2CLR     : 1;            /*!< [2..2] SQ 2 Interrupt Status Clear                                        */
      __IOM uint32_t SQ3CLR     : 1;            /*!< [3..3] SQ 3 Interrupt Status Clear                                        */
            uint32_t            : 4;
      __IOM uint32_t COLL0CLR   : 1;            /*!< [8..8] Collision 0 Status Clear                                           */
      __IOM uint32_t COLL1CLR   : 1;            /*!< [9..9] Collision 1 Status Clear                                           */
      __IOM uint32_t COLL2CLR   : 1;            /*!< [10..10] Collision 2 Status Clear                                         */
      __IOM uint32_t COLL3CLR   : 1;            /*!< [11..11] Collision 3 Status Clear                                         */
            uint32_t            : 20;
    } bit;
  } SQSTATCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Sequence Status Clear Register                             */
    
    struct {
      __IOM uint32_t SQ0SET     : 1;            /*!< [0..0] SQ 0 Interrupt Status Set                                          */
      __IOM uint32_t SQ1SET     : 1;            /*!< [1..1] SQ 1 Interrupt Status Set                                          */
      __IOM uint32_t SQ2SET     : 1;            /*!< [2..2] SQ 2 Interrupt Status Set                                          */
      __IOM uint32_t SQ3SET     : 1;            /*!< [3..3] SQ 3 Interrupt Status Set                                          */
            uint32_t            : 4;
      __IOM uint32_t COLL0SET   : 1;            /*!< [8..8] Collision 0 Status Set                                             */
      __IOM uint32_t COLL1SET   : 1;            /*!< [9..9] Collision 1 Status Set                                             */
      __IOM uint32_t COLL2SET   : 1;            /*!< [10..10] Collision 2 Status Set                                           */
      __IOM uint32_t COLL3SET   : 1;            /*!< [11..11] Collision 3 Status Set                                           */
            uint32_t            : 20;
    } bit;
  } SQSTATSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Channel Status Register                                    */
    
    struct {
      __IOM uint32_t CH0        : 1;            /*!< [0..0] Channel 0 Status                                                   */
      __IOM uint32_t CH1        : 1;            /*!< [1..1] Channel 1 Status                                                   */
      __IOM uint32_t CH2        : 1;            /*!< [2..2] Channel 2 Status                                                   */
      __IOM uint32_t CH3        : 1;            /*!< [3..3] Channel 3 Status                                                   */
      __IOM uint32_t CH4        : 1;            /*!< [4..4] Channel 4 Status                                                   */
      __IOM uint32_t CH5        : 1;            /*!< [5..5] Channel 5 Status                                                   */
      __IOM uint32_t CH6        : 1;            /*!< [6..6] Channel 6 Status                                                   */
      __IOM uint32_t CH7        : 1;            /*!< [7..7] Channel 7 Status                                                   */
      __IOM uint32_t CH8        : 1;            /*!< [8..8] Channel 8 Status                                                   */
      __IOM uint32_t CH9        : 1;            /*!< [9..9] Channel 9 Status                                                   */
      __IOM uint32_t CH10       : 1;            /*!< [10..10] Channel 10 Status                                                */
      __IOM uint32_t CH11       : 1;            /*!< [11..11] Channel 11 Status                                                */
      __IOM uint32_t CH12       : 1;            /*!< [12..12] Channel 12 Status                                                */
      __IOM uint32_t CH13       : 1;            /*!< [13..13] Channel 13 Status                                                */
      __IOM uint32_t CH14       : 1;            /*!< [14..14] Channel 14 Status                                                */
            uint32_t            : 9;
      __IOM uint32_t CHNUM      : 4;            /*!< [27..24] Current Channel under conversion                                 */
            uint32_t            : 4;
    } bit;
  } CHSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Channel Status Register                                    */
    
