popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t CH0CLR     : 1;            /*!< [0..0] Channel 0 Status clear flag                                        */
      __OM  uint32_t CH1CLR     : 1;            /*!< [1..1] Channel 1 Status clear flag                                        */
      __OM  uint32_t CH2CLR     : 1;            /*!< [2..2] Channel 2 Status clear flag                                        */
      __OM  uint32_t CH3CLR     : 1;            /*!< [3..3] Channel 3 Status clear flag                                        */
      __OM  uint32_t CH4CLR     : 1;            /*!< [4..4] Channel 4 Status clear flag                                        */
      __OM  uint32_t CH5CLR     : 1;            /*!< [5..5] Channel 5 Status clear flag                                        */
      __OM  uint32_t CH6CLR     : 1;            /*!< [6..6] Channel 6 Status clear flag                                        */
      __OM  uint32_t CH7CLR     : 1;            /*!< [7..7] Channel 7 Status clear flag                                        */
      __OM  uint32_t CH8CLR     : 1;            /*!< [8..8] Channel 8 Status clear flag                                        */
      __OM  uint32_t CH9CLR     : 1;            /*!< [9..9] Channel 9 Status clear flag                                        */
      __OM  uint32_t CH10CLR    : 1;            /*!< [10..10] Channel 10 Status clear flag                                     */
      __OM  uint32_t CH11CLR    : 1;            /*!< [11..11] Channel 11 Status clear flag                                     */
      __OM  uint32_t CH12CLR    : 1;            /*!< [12..12] Channel 12 Status clear flag                                     */
      __OM  uint32_t CH13CLR    : 1;            /*!< [13..13] Channel 13 Status clear flag                                     */
      __OM  uint32_t CH14CLR    : 1;            /*!< [14..14] Channel 14 Status clear flag                                     */
            uint32_t            : 17;
    } bit;
  } CHSTATCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Channel Status Register                                    */
    
    struct {
      __OM  uint32_t CH0SET     : 1;            /*!< [0..0] Channel 0 Status set flag                                          */
      __OM  uint32_t CH1SET     : 1;            /*!< [1..1] Channel 1 Status set flag                                          */
      __OM  uint32_t CH2SET     : 1;            /*!< [2..2] Channel 2 Status set flag                                          */
      __OM  uint32_t CH3SET     : 1;            /*!< [3..3] Channel 3 Status set flag                                          */
      __OM  uint32_t CH4SET     : 1;            /*!< [4..4] Channel 4 Status set flag                                          */
      __OM  uint32_t CH5SET     : 1;            /*!< [5..5] Channel 5 Status set flag                                          */
      __OM  uint32_t CH6SET     : 1;            /*!< [6..6] Channel 6 Status set flag                                          */
      __OM  uint32_t CH7SET     : 1;            /*!< [7..7] Channel 7 Status set flag                                          */
      __OM  uint32_t CH8SET     : 1;            /*!< [8..8] Channel 8 Status set flag                                          */
      __OM  uint32_t CH9SET     : 1;            /*!< [9..9] Channel 9 Status set flag                                          */
      __OM  uint32_t CH10SET    : 1;            /*!< [10..10] Channel 10 Status set flag                                       */
      __OM  uint32_t CH11SET    : 1;            /*!< [11..11] Channel 11 Status set flag                                       */
      __OM  uint32_t CH12SET    : 1;            /*!< [12..12] Channel 12 Status set flag                                       */
      __OM  uint32_t CH13SET    : 1;            /*!< [13..13] Channel 13 Status set flag                                       */
      __OM  uint32_t CH14SET    : 1;            /*!< [14..14] Channel 14 Status set flag                                       */
            uint32_t            : 17;
    } bit;
  } CHSTATSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Calibration Enable                                         */
    
    struct {
      __IOM uint32_t CALEN0     : 1;            /*!< [0..0] Channel 0 Calibration Enable                                       */
      __IOM uint32_t CALEN1     : 1;            /*!< [1..1] Channel 1 Calibration Enable                                       */
      __IOM uint32_t CALEN2     : 1;            /*!< [2..2] Channel 2 Calibration Enable                                       */
      __IOM uint32_t CALEN3     : 1;            /*!< [3..3] Channel 3 Calibration Enable                                       */
      __IOM uint32_t CALEN4     : 1;            /*!< [4..4] Channel 4 Calibration Enable                                       */
      __IOM uint32_t CALEN5     : 1;            /*!< [5..5] Channel 5 Calibration Enable                                       */
      __IOM uint32_t CALEN6     : 1;            /*!< [6..6] Channel 6 Calibration Enable                                       */
      __IOM uint32_t CALEN7     : 1;            /*!< [7..7] Channel 7 Calibration Enable                                       */
      __IOM uint32_t CALEN8     : 1;            /*!< [8..8] Channel 8 Calibration Enable                                       */
      __IOM uint32_t CALEN9     : 1;            /*!< [9..9] Channel 9 Calibration Enable                                       */
      __IOM uint32_t CALEN10    : 1;            /*!< [10..10] Channel 10 Calibration Enable                                    */
      __IOM uint32_t CALEN11    : 1;            /*!< [11..11] Channel 11 Calibration Enable                                    */
      __IOM uint32_t CALEN12    : 1;            /*!< [12..12] Channel 12 Calibration Enable                                    */
      __IOM uint32_t CALEN13    : 1;            /*!< [13..13] Channel 13 Calibration Enable                                    */
      __IOM uint32_t CALEN14    : 1;            /*!< [14..14] Channel 14 Calibration Enable                                    */
            uint32_t            : 17;
    } bit;
  } CALEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Calibration Protection Enable                              */
    
