popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CALPEN0    : 1;            /*!< [0..0] Channel 0 Calibration Protection                                   */
      __IOM uint32_t CALPEN1    : 1;            /*!< [1..1] Channel 1 Calibration Protection                                   */
      __IOM uint32_t CALPEN2    : 1;            /*!< [2..2] Channel 2 Calibration Protection                                   */
      __IOM uint32_t CALPEN3    : 1;            /*!< [3..3] Channel 3 Calibration Protection                                   */
      __IOM uint32_t CALPEN4    : 1;            /*!< [4..4] Channel 4 Calibration Protection                                   */
      __IOM uint32_t CALPEN5    : 1;            /*!< [5..5] Channel 5 Calibration Protection                                   */
      __IOM uint32_t CALPEN6    : 1;            /*!< [6..6] Channel 6 Calibration Protection                                   */
      __IOM uint32_t CALPEN7    : 1;            /*!< [7..7] Channel 7 Calibration Protection                                   */
      __IOM uint32_t CALPEN8    : 1;            /*!< [8..8] Channel 8 Calibration Protection                                   */
      __IOM uint32_t CALPEN9    : 1;            /*!< [9..9] Channel 9 Calibration Protection                                   */
      __IOM uint32_t CALPEN10   : 1;            /*!< [10..10] Channel 10 Calibration Protection                                */
      __IOM uint32_t CALPEN11   : 1;            /*!< [11..11] Channel 11 Calibration Protection                                */
      __IOM uint32_t CALPEN12   : 1;            /*!< [12..12] Channel 12 Calibration Protection                                */
      __IOM uint32_t CALPEN13   : 1;            /*!< [13..13] Channel 13 Calibration Protection                                */
      __IOM uint32_t CALPEN14   : 1;            /*!< [14..14] Channel 14 Calibration Protection                                */
            uint32_t            : 17;
    } bit;
  } CALPEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000034) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000038) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000003C) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000040) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL4;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000044) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL5;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL6;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000004C) Filter Result Register                                     */
    
    struct {
      __IM  uint32_t FILRESULT  : 14;           /*!< [13..0] Filter Result Value                                               */
            uint32_t            : 18;
    } bit;
  } FIL7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Filter Status Register                                     */
    
    struct {
      __IOM uint32_t FIL0       : 1;            /*!< [0..0] Filter 0 Event flag                                                */
      __IOM uint32_t FIL1       : 1;            /*!< [1..1] Filter 1 Event flag                                                */
      __IOM uint32_t FIL2       : 1;            /*!< [2..2] Filter 2 Event flag                                                */
      __IOM uint32_t FIL3       : 1;            /*!< [3..3] Filter 3 Event flag                                                */
      __IOM uint32_t FIL4       : 1;            /*!< [4..4] Filter 4 Event flag                                                */
      __IOM uint32_t FIL5       : 1;            /*!< [5..5] Filter 5 Event flag                                                */
      __IOM uint32_t FIL6       : 1;            /*!< [6..6] Filter 6 Event flag                                                */
      __IOM uint32_t FIL7       : 1;            /*!< [7..7] Filter 7 Event flag                                                */
            uint32_t            : 24;
    } bit;
  } FILSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Filter Status Clear Register                               */
    
