popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t FIL0CLR    : 1;            /*!< [0..0] Filter 0 Event flag clear                                          */
      __OM  uint32_t FIL1CLR    : 1;            /*!< [1..1] Filter 1 Event flag clear                                          */
      __OM  uint32_t FIL2CLR    : 1;            /*!< [2..2] Filter 2 Event flag clear                                          */
      __OM  uint32_t FIL3CLR    : 1;            /*!< [3..3] Filter 3 Event flag clear                                          */
      __OM  uint32_t FIL4CLR    : 1;            /*!< [4..4] Filter 4 Event flag clear                                          */
      __OM  uint32_t FIL5CLR    : 1;            /*!< [5..5] Filter 5 Event flag clear                                          */
      __OM  uint32_t FIL6CLR    : 1;            /*!< [6..6] Filter 6 Event flag clear                                          */
      __OM  uint32_t FIL7CLR    : 1;            /*!< [7..7] Filter 7 Event flag clear                                          */
            uint32_t            : 24;
    } bit;
  } FILSTATCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Filter Status Clear Register                               */
    
    struct {
      __OM  uint32_t FIL0SET    : 1;            /*!< [0..0] Filter 0 Event flag set                                            */
      __OM  uint32_t FIL1SET    : 1;            /*!< [1..1] Filter 1 Event flag set                                            */
      __OM  uint32_t FIL2SET    : 1;            /*!< [2..2] Filter 2 Event flag set                                            */
      __OM  uint32_t FIL3SET    : 1;            /*!< [3..3] Filter 3 Event flag set                                            */
      __OM  uint32_t FIL4SET    : 1;            /*!< [4..4] Filter 4 Event flag set                                            */
      __OM  uint32_t FIL5SET    : 1;            /*!< [5..5] Filter 5 Event flag set                                            */
      __OM  uint32_t FIL6SET    : 1;            /*!< [6..6] Filter 6 Event flag set                                            */
      __OM  uint32_t FIL7SET    : 1;            /*!< [7..7] Filter 7 Event flag set                                            */
            uint32_t            : 24;
    } bit;
  } FILSTATSET;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000005C) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000060) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000064) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000068) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000006C) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES4;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000070) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES5;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000074) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES6;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000078) Result Register                                            */
    
