popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES7;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000007C) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES8;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000080) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES9;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000084) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES10;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000088) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES11;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000008C) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES12;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000090) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES13;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000094) Result Register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [11..0] Result Value                                                      */
            uint32_t            : 3;
      __IM  uint32_t VALID      : 1;            /*!< [15..15] Valid flag                                                       */
            uint32_t            : 16;
    } bit;
  } RES14;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) Compare Status Register                                    */
    
    struct {
      __IOM uint32_t CMP_LO0_STS : 1;           /*!< [0..0] Compare 0 low Status                                               */
      __IOM uint32_t CMP_LO1_STS : 1;           /*!< [1..1] Compare 1 low Status                                               */
      __IOM uint32_t CMP_LO2_STS : 1;           /*!< [2..2] Compare 2 low Status                                               */
      __IOM uint32_t CMP_LO3_STS : 1;           /*!< [3..3] Compare 3 low Status                                               */
      __IOM uint32_t CMP_LO4_STS : 1;           /*!< [4..4] Compare 4 low Status                                               */
      __IOM uint32_t CMP_LO5_STS : 1;           /*!< [5..5] Compare 5 low Status                                               */
      __IOM uint32_t CMP_LO6_STS : 1;           /*!< [6..6] Compare 6 low Status                                               */
      __IOM uint32_t CMP_LO7_STS : 1;           /*!< [7..7] Compare 7 low Status                                               */
      __IOM uint32_t CMP_LO0_IS : 1;            /*!< [8..8] Compare 0 low Interrupt Status                                     */
      __IOM uint32_t CMP_LO1_IS : 1;            /*!< [9..9] Compare 1 low Interrupt Status                                     */
      __IOM uint32_t CMP_LO2_IS : 1;            /*!< [10..10] Compare 2 low Interrupt Status                                   */
      __IOM uint32_t CMP_LO3_IS : 1;            /*!< [11..11] Compare 3 low Interrupt Status                                   */
      __IOM uint32_t CMP_LO4_IS : 1;            /*!< [12..12] Compare 4 low Interrupt Status                                   */
      __IOM uint32_t CMP_LO5_IS : 1;            /*!< [13..13] Compare 5 low Interrupt Status                                   */
      __IOM uint32_t CMP_LO6_IS : 1;            /*!< [14..14] Compare 6 low Interrupt Status                                   */
      __IOM uint32_t CMP_LO7_IS : 1;            /*!< [15..15] Compare 7 low Interrupt Status                                   */
      __IOM uint32_t CMP_UP0_STS : 1;           /*!< [16..16] Compare 0 up Status                                              */
      __IOM uint32_t CMP_UP1_STS : 1;           /*!< [17..17] Compare 1 up Status                                              */
      __IOM uint32_t CMP_UP2_STS : 1;           /*!< [18..18] Compare 2 up Status                                              */
      __IOM uint32_t CMP_UP3_STS : 1;           /*!< [19..19] Compare 3 up Status                                              */
      __IOM uint32_t CMP_UP4_STS : 1;           /*!< [20..20] Compare 4 up Status                                              */
      __IOM uint32_t CMP_UP5_STS : 1;           /*!< [21..21] Compare 5 up Status                                              */
      __IOM uint32_t CMP_UP6_STS : 1;           /*!< [22..22] Compare 6 up Status                                              */
      __IOM uint32_t CMP_UP7_STS : 1;           /*!< [23..23] Compare 7 up Status                                              */
      __IOM uint32_t CMP_UP0_IS : 1;            /*!< [24..24] Compare 0 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP1_IS : 1;            /*!< [25..25] Compare 1 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP2_IS : 1;            /*!< [26..26] Compare 2 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP3_IS : 1;            /*!< [27..27] Compare 3 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP4_IS : 1;            /*!< [28..28] Compare 4 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP5_IS : 1;            /*!< [29..29] Compare 5 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP6_IS : 1;            /*!< [30..30] Compare 6 up Interrupt Status                                    */
      __IOM uint32_t CMP_UP7_IS : 1;            /*!< [31..31] Compare 7 up Interrupt Status                                    */
    } bit;
  } CMPSTAT;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000009C) Compare Status Clear Register                              */
    
