popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t CMP_LO0_STSCLR : 1;        /*!< [0..0] Compare 0 low Status clear                                         */
      __OM  uint32_t CMP_LO1_STSCLR : 1;        /*!< [1..1] Compare 1 low Status clear                                         */
      __OM  uint32_t CMP_LO2_STSCLR : 1;        /*!< [2..2] Compare 2 low Status clear                                         */
      __OM  uint32_t CMP_LO3_STSCLR : 1;        /*!< [3..3] Compare 3 low Status clear                                         */
      __OM  uint32_t CMP_LO4_STSCLR : 1;        /*!< [4..4] Compare 4 low Status clear                                         */
      __OM  uint32_t CMP_LO5_STSCLR : 1;        /*!< [5..5] Compare 5 low Status clear                                         */
      __OM  uint32_t CMP_LO6_STSCLR : 1;        /*!< [6..6] Compare 6 low Status clear                                         */
      __OM  uint32_t CMP_LO7_STSCLR : 1;        /*!< [7..7] Compare 7 low Status clear                                         */
      __OM  uint32_t CMP_LO0_ISCLR : 1;         /*!< [8..8] Compare 0 low Interrupt clear                                      */
      __OM  uint32_t CMP_LO1_ISCLR : 1;         /*!< [9..9] Compare 1 low Interrupt clear                                      */
      __OM  uint32_t CMP_LO2_ISCLR : 1;         /*!< [10..10] Compare 2 low Interrupt clear                                    */
      __OM  uint32_t CMP_LO3_ISCLR : 1;         /*!< [11..11] Compare 3 low Interrupt clear                                    */
      __OM  uint32_t CMP_LO4_ISCLR : 1;         /*!< [12..12] Compare 4 low Interrupt clear                                    */
      __OM  uint32_t CMP_LO5_ISCLR : 1;         /*!< [13..13] Compare 5 low Interrupt clear                                    */
      __OM  uint32_t CMP_LO6_ISCLR : 1;         /*!< [14..14] Compare 6 low Interrupt clear                                    */
      __OM  uint32_t CMP_LO7_ISCLR : 1;         /*!< [15..15] Compare 7 low Interrupt clear                                    */
      __OM  uint32_t CMP_UP0_STSCLR : 1;        /*!< [16..16] Compare 0 up Status clear                                        */
      __OM  uint32_t CMP_UP1_STSCLR : 1;        /*!< [17..17] Compare 1 up Status clear                                        */
      __OM  uint32_t CMP_UP2_STSCLR : 1;        /*!< [18..18] Compare 2 up Status clear                                        */
      __OM  uint32_t CMP_UP3_STSCLR : 1;        /*!< [19..19] Compare 3 up Status clear                                        */
      __OM  uint32_t CMP_UP4_STSCLR : 1;        /*!< [20..20] Compare 4 up Status clear                                        */
      __OM  uint32_t CMP_UP5_STSCLR : 1;        /*!< [21..21] Compare 5 up Status clear                                        */
      __OM  uint32_t CMP_UP6_STSCLR : 1;        /*!< [22..22] Compare 6 up Status clear                                        */
      __OM  uint32_t CMP_UP7_STSCLR : 1;        /*!< [23..23] Compare 7 up Status clear                                        */
      __OM  uint32_t CMP_UP0_ISCLR : 1;         /*!< [24..24] Compare 0 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP1_ISCLR : 1;         /*!< [25..25] Compare 1 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP2_ISCLR : 1;         /*!< [26..26] Compare 2 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP3_ISCLR : 1;         /*!< [27..27] Compare 3 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP4_ISCLR : 1;         /*!< [28..28] Compare 4 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP5_ISCLR : 1;         /*!< [29..29] Compare 5 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP6_ISCLR : 1;         /*!< [30..30] Compare 6 up Interrupt clear                                     */
      __OM  uint32_t CMP_UP7_ISCLR : 1;         /*!< [31..31] Compare 7 up Interrupt clear                                     */
    } bit;
  } CMPSTATCLR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x000000A0) Compare Status Clear Register                              */
    
    struct {
      __OM  uint32_t CMP_LO0_STSSET : 1;        /*!< [0..0] Compare 0 low Status set                                           */
      __OM  uint32_t CMP_LO1_STSSET : 1;        /*!< [1..1] Compare 1 low Status set                                           */
      __OM  uint32_t CMP_LO2_STSSET : 1;        /*!< [2..2] Compare 2 low Status set                                           */
      __OM  uint32_t CMP_LO3_STSSET : 1;        /*!< [3..3] Compare 3 low Status set                                           */
      __OM  uint32_t CMP_LO4_STSSET : 1;        /*!< [4..4] Compare 4 low Status set                                           */
      __OM  uint32_t CMP_LO5_STSSET : 1;        /*!< [5..5] Compare 5 low Status set                                           */
      __OM  uint32_t CMP_LO6_STSSET : 1;        /*!< [6..6] Compare 6 low Status set                                           */
      __OM  uint32_t CMP_LO7_STSSET : 1;        /*!< [7..7] Compare 7 low Status set                                           */
      __OM  uint32_t CMP_LO0_ISSET : 1;         /*!< [8..8] Compare 0 low Interupt set                                         */
      __OM  uint32_t CMP_LO1_ISSET : 1;         /*!< [9..9] Compare 1 low Interupt set                                         */
      __OM  uint32_t CMP_LO2_ISSET : 1;         /*!< [10..10] Compare 2 low Interupt set                                       */
      __OM  uint32_t CMP_LO3_ISSET : 1;         /*!< [11..11] Compare 3 low Interupt set                                       */
      __OM  uint32_t CMP_LO4_ISSET : 1;         /*!< [12..12] Compare 4 low Interupt set                                       */
      __OM  uint32_t CMP_LO5_ISSET : 1;         /*!< [13..13] Compare 5 low Interupt set                                       */
      __OM  uint32_t CMP_LO6_ISSET : 1;         /*!< [14..14] Compare 6 low Interupt set                                       */
      __OM  uint32_t CMP_LO7_ISSET : 1;         /*!< [15..15] Compare 7 low Interupt set                                       */
      __OM  uint32_t CMP_UP0_STSSET : 1;        /*!< [16..16] Compare 0 up Status set                                          */
      __OM  uint32_t CMP_UP1_STSSET : 1;        /*!< [17..17] Compare 1 up Status set                                          */
      __OM  uint32_t CMP_UP2_STSSET : 1;        /*!< [18..18] Compare 2 up Status set                                          */
      __OM  uint32_t CMP_UP3_STSSET : 1;        /*!< [19..19] Compare 3 up Status set                                          */
      __OM  uint32_t CMP_UP4_STSSET : 1;        /*!< [20..20] Compare 4 up Status set                                          */
      __OM  uint32_t CMP_UP5_STSSET : 1;        /*!< [21..21] Compare 5 up Status set                                          */
      __OM  uint32_t CMP_UP6_STSSET : 1;        /*!< [22..22] Compare 6 up Status set                                          */
      __OM  uint32_t CMP_UP7_STSSET : 1;        /*!< [23..23] Compare 7 up Status set                                          */
      __OM  uint32_t CMP_UP0_ISSET : 1;         /*!< [24..24] Compare 0 up Interrupt set                                       */
      __OM  uint32_t CMP_UP1_ISSET : 1;         /*!< [25..25] Compare 1 up Interrupt set                                       */
      __OM  uint32_t CMP_UP2_ISSET : 1;         /*!< [26..26] Compare 2 up Interrupt set                                       */
      __OM  uint32_t CMP_UP3_ISSET : 1;         /*!< [27..27] Compare 3 up Interrupt set                                       */
      __OM  uint32_t CMP_UP4_ISSET : 1;         /*!< [28..28] Compare 4 up Interrupt set                                       */
      __OM  uint32_t CMP_UP5_ISSET : 1;         /*!< [29..29] Compare 5 up Interrupt set                                       */
      __OM  uint32_t CMP_UP6_ISSET : 1;         /*!< [30..30] Compare 6 up Interrupt set                                       */
      __OM  uint32_t CMP_UP7_ISSET : 1;         /*!< [31..31] Compare 7 up Interrupt set                                       */
    } bit;
  } CMPSTATSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Interrupt Enable Register 0                                */
    
