popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t IEN_CH0    : 1;            /*!< [0..0] Channel 0 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH1    : 1;            /*!< [1..1] Channel 1 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH2    : 1;            /*!< [2..2] Channel 2 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH3    : 1;            /*!< [3..3] Channel 3 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH4    : 1;            /*!< [4..4] Channel 4 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH5    : 1;            /*!< [5..5] Channel 5 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH6    : 1;            /*!< [6..6] Channel 6 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH7    : 1;            /*!< [7..7] Channel 7 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH8    : 1;            /*!< [8..8] Channel 8 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH9    : 1;            /*!< [9..9] Channel 9 Interrupt Enable                                         */
      __IOM uint32_t IEN_CH10   : 1;            /*!< [10..10] Channel 10 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH11   : 1;            /*!< [11..11] Channel 11 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH12   : 1;            /*!< [12..12] Channel 12 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH13   : 1;            /*!< [13..13] Channel 13 Interrupt Enable                                      */
      __IOM uint32_t IEN_CH14   : 1;            /*!< [14..14] Channel 14 Interrupt Enable                                      */
            uint32_t            : 17;
    } bit;
  } IEN0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Interrupt Enable Register 1                                */
    
    struct {
      __IOM uint32_t IEN_SQ0    : 1;            /*!< [0..0] Sequence 0 Interrupt Enable                                        */
      __IOM uint32_t IEN_SQ1    : 1;            /*!< [1..1] Sequence 1 Interrupt Enable                                        */
      __IOM uint32_t IEN_SQ2    : 1;            /*!< [2..2] Sequence 2 Interrupt Enable                                        */
      __IOM uint32_t IEN_SQ3    : 1;            /*!< [3..3] Sequence 3 Interrupt Enable                                        */
      __IOM uint32_t IEN_COLL0  : 1;            /*!< [4..4] Collision 0 Interrupt Enable                                       */
      __IOM uint32_t IEN_COLL1  : 1;            /*!< [5..5] Collision 1 Interrupt Enable                                       */
      __IOM uint32_t IEN_COLL2  : 1;            /*!< [6..6] Collision 2 Interrupt Enable                                       */
      __IOM uint32_t IEN_COLL3  : 1;            /*!< [7..7] Collision 3 Interrupt Enable                                       */
            uint32_t            : 8;
      __IOM uint32_t IEN_LO0    : 1;            /*!< [16..16] Compare 0 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO1    : 1;            /*!< [17..17] Compare 1 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO2    : 1;            /*!< [18..18] Compare 2 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO3    : 1;            /*!< [19..19] Compare 3 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO4    : 1;            /*!< [20..20] Compare 4 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO5    : 1;            /*!< [21..21] Compare 5 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO6    : 1;            /*!< [22..22] Compare 6 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_LO7    : 1;            /*!< [23..23] Compare 7 LO Interrupt Enable                                    */
      __IOM uint32_t IEN_UP0    : 1;            /*!< [24..24] Compare 0 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP1    : 1;            /*!< [25..25] Compare 1 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP2    : 1;            /*!< [26..26] Compare 2 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP3    : 1;            /*!< [27..27] Compare 3 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP4    : 1;            /*!< [28..28] Compare 4 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP5    : 1;            /*!< [29..29] Compare 5 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP6    : 1;            /*!< [30..30] Compare 6 UP Interrupt Enable                                    */
      __IOM uint32_t IEN_UP7    : 1;            /*!< [31..31] Compare 7 UP Interrupt Enable                                    */
    } bit;
  } IEN1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Interrupt Node Pointer Register 0                          */
    
    struct {
      __IOM uint32_t INP_CH0    : 2;            /*!< [1..0] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH1    : 2;            /*!< [3..2] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH2    : 2;            /*!< [5..4] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH3    : 2;            /*!< [7..6] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH4    : 2;            /*!< [9..8] Channel Interrupt Node Pointer                                     */
      __IOM uint32_t INP_CH5    : 2;            /*!< [11..10] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH6    : 2;            /*!< [13..12] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH7    : 2;            /*!< [15..14] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH8    : 2;            /*!< [17..16] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH9    : 2;            /*!< [19..18] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH10   : 2;            /*!< [21..20] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH11   : 2;            /*!< [23..22] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH12   : 2;            /*!< [25..24] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH13   : 2;            /*!< [27..26] Channel Interrupt Node Pointer                                   */
      __IOM uint32_t INP_CH14   : 2;            /*!< [29..28] Channel Interrupt Node Pointer                                   */
            uint32_t            : 2;
    } bit;
  } INP0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Interrupt Node Pointer Register 2                          */
    
