popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t INP_CMP_LO0 : 2;           /*!< [1..0] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO1 : 2;           /*!< [3..2] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO2 : 2;           /*!< [5..4] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO3 : 2;           /*!< [7..6] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO4 : 2;           /*!< [9..8] Compare Lo Interrupt Node Pointer                                  */
      __IOM uint32_t INP_CMP_LO5 : 2;           /*!< [11..10] Compare Lo Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_LO6 : 2;           /*!< [13..12] Compare Lo Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_LO7 : 2;           /*!< [15..14] Compare Lo Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP0 : 2;           /*!< [17..16] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP1 : 2;           /*!< [19..18] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP2 : 2;           /*!< [21..20] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP3 : 2;           /*!< [23..22] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP4 : 2;           /*!< [25..24] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP5 : 2;           /*!< [27..26] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP6 : 2;           /*!< [29..28] Compare Up Interrupt Node Pointer                                */
      __IOM uint32_t INP_CMP_UP7 : 2;           /*!< [31..30] Compare Up Interrupt Node Pointer                                */
    } bit;
  } INP2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) Interrupt Node Pointer Register 3                          */
    
    struct {
      __IOM uint32_t INP_SQ0    : 2;            /*!< [1..0] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_SQ1    : 2;            /*!< [3..2] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_SQ2    : 2;            /*!< [5..4] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_SQ3    : 2;            /*!< [7..6] Sequence Interrupt Node Pointer                                    */
      __IOM uint32_t INP_COLL0  : 2;            /*!< [9..8] Collision Interrupt Node Pointer                                   */
      __IOM uint32_t INP_COLL1  : 2;            /*!< [11..10] Collision Interrupt Node Pointer                                 */
      __IOM uint32_t INP_COLL2  : 2;            /*!< [13..12] Collision Interrupt Node Pointer                                 */
      __IOM uint32_t INP_COLL3  : 2;            /*!< [15..14] Collision Interrupt Node Pointer                                 */
            uint32_t            : 16;
    } bit;
  } INP3;
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000C8) Internal Configuration Register                            */
    
    struct {
      __IM  uint32_t LOW_VOLT_STS : 1;          /*!< [0..0] ADC2 low voltage Status                                            */
            uint32_t            : 31;
    } bit;
  } INTSTAT;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) Sequence Configuration Register 0                          */
    
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
            uint32_t            : 2;
      __IOM uint32_t TRGSEL     : 2;            /*!< [9..8] Trigger Select                                                     */
            uint32_t            : 4;
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
            uint32_t            : 17;
    } bit;
  } SQCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000DC) Sequence Configuration Register 1                          */
    
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
            uint32_t            : 2;
      __IOM uint32_t TRGSEL     : 2;            /*!< [9..8] Trigger Select                                                     */
            uint32_t            : 4;
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
            uint32_t            : 17;
    } bit;
  } SQCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) Sequence Configuration Register 2                          */
    
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
            uint32_t            : 2;
      __IOM uint32_t TRGSEL     : 2;            /*!< [9..8] Trigger Select                                                     */
            uint32_t            : 4;
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
            uint32_t            : 17;
    } bit;
  } SQCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E4) Sequence Configuration Register 3                          */
    
