popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t SLOTS      : 3;            /*!< [2..0] Number of used Slots in Sequence                                   */
            uint32_t            : 1;
      __IOM uint32_t SQREP      : 2;            /*!< [5..4] Sequence repetition                                                */
            uint32_t            : 2;
      __IOM uint32_t TRGSEL     : 2;            /*!< [9..8] Trigger Select                                                     */
            uint32_t            : 4;
      __OM  uint32_t TRGSW      : 1;            /*!< [14..14] Software Trigger Bit                                             */
            uint32_t            : 17;
    } bit;
  } SQCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E8) Channel Configuration Register 0                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000EC) Channel Configuration Register 1                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) Channel Configuration Register 2                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F4) Channel Configuration Register 3                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F8) Channel Configuration Register 4                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000FC) Channel Configuration Register 5                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) Channel Configuration Register 6                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000104) Channel Configuration Register 7                           */
    
