popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000108) Channel Configuration Register 8                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000010C) Channel Configuration Register 9                           */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000110) Channel Configuration Register 10                          */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000114) Channel Configuration Register 11                          */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000118) Channel Configuration Register 12                          */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG12;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000011C) Channel Configuration Register 13                          */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG13;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000120) Channel Configuration Register 14                          */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CHREP      : 4;            /*!< [11..8] Channel Repetition                                                */
            uint32_t            : 4;
      __IOM uint32_t FILSEL     : 4;            /*!< [19..16] Filter Selection                                                 */
      __IOM uint32_t CMPSEL     : 4;            /*!< [23..20] Compare Selection                                                */
      __IOM uint32_t CLASSEL    : 2;            /*!< [25..24] Conversion Class Selection                                       */
            uint32_t            : 6;
    } bit;
  } CHCFG14;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000124) Calibration Setting for Analog Inputs                      */
    
