popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000128) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000012C) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000130) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000134) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000138) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000013C) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000140) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000144) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000148) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000014C) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000150) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000154) Calibration Setting for Analog Inputs                      */
    
