popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI12;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000158) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI13;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000015C) Calibration Setting for Analog Inputs                      */
    
    struct {
      __IOM uint32_t CALOFFS    : 5;            /*!< [4..0] Calibration Offset                                                 */
            uint32_t            : 11;
      __IOM uint32_t CALGAIN    : 8;            /*!< [23..16] Calibration Gain                                                 */
            uint32_t            : 8;
    } bit;
  } CALAI14;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000164) SQ Channel Slot Register 0                                 */
    
    struct {
      __IOM uint32_t CHSEL0     : 4;            /*!< [3..0] Channel Select                                                     */
            uint32_t            : 4;
      __IOM uint32_t CHSEL1     : 4;            /*!< [11..8] Channel Select                                                    */
            uint32_t            : 4;
      __IOM uint32_t CHSEL2     : 4;            /*!< [19..16] Channel Select                                                   */
            uint32_t            : 4;
      __IOM uint32_t CHSEL3     : 4;            /*!< [27..24] Channel Select                                                   */
            uint32_t            : 4;
    } bit;
  } SQSLOT0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000168) SQ Channel Slot Register 1                                 */
    
    struct {
      __IOM uint32_t CHSEL0     : 4;            /*!< [3..0] Channel Select                                                     */
            uint32_t            : 4;
      __IOM uint32_t CHSEL1     : 4;            /*!< [11..8] Channel Select                                                    */
            uint32_t            : 4;
      __IOM uint32_t CHSEL2     : 4;            /*!< [19..16] Channel Select                                                   */
            uint32_t            : 4;
      __IOM uint32_t CHSEL3     : 4;            /*!< [27..24] Channel Select                                                   */
            uint32_t            : 4;
    } bit;
  } SQSLOT1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000016C) SQ Channel Slot Register 2                                 */
    
    struct {
      __IOM uint32_t CHSEL0     : 4;            /*!< [3..0] Channel Select                                                     */
            uint32_t            : 4;
      __IOM uint32_t CHSEL1     : 4;            /*!< [11..8] Channel Select                                                    */
            uint32_t            : 4;
      __IOM uint32_t CHSEL2     : 4;            /*!< [19..16] Channel Select                                                   */
            uint32_t            : 4;
      __IOM uint32_t CHSEL3     : 4;            /*!< [27..24] Channel Select                                                   */
            uint32_t            : 4;
    } bit;
  } SQSLOT2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000170) SQ Channel Slot Register 3                                 */
    
    struct {
      __IOM uint32_t CHSEL0     : 4;            /*!< [3..0] Channel Select                                                     */
            uint32_t            : 4;
      __IOM uint32_t CHSEL1     : 4;            /*!< [11..8] Channel Select                                                    */
            uint32_t            : 4;
      __IOM uint32_t CHSEL2     : 4;            /*!< [19..16] Channel Select                                                   */
            uint32_t            : 4;
      __IOM uint32_t CHSEL3     : 4;            /*!< [27..24] Channel Select                                                   */
            uint32_t            : 4;
    } bit;
  } SQSLOT3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000174) Channel Configuration Register 0                           */
    
    struct {
            uint32_t            : 4;
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
            uint32_t            : 24;
    } bit;
  } CONVCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000178) Channel Configuration Register 1                           */
    
    struct {
            uint32_t            : 4;
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
            uint32_t            : 24;
    } bit;
  } CONVCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000017C) Channel Configuration Register 2                           */
    
    struct {
            uint32_t            : 4;
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
            uint32_t            : 24;
    } bit;
  } CONVCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) Channel Configuration Register 3                           */
    
