popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t STC        : 4;            /*!< [7..4] Sample Time config                                                 */
            uint32_t            : 24;
    } bit;
  } CONVCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000184) Compare Channel 0 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000188) Compare Channel 1 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000018C) Compare Channel 2 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000190) Compare Channel 3 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000194) Compare Channel 4 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000198) Compare Channel 5 Control Register                         */
    
