popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000019C) Compare Channel 6 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A0) Compare Channel 7 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 8;            /*!< [7..0] Lower Compare Value                                                */
      __IOM uint32_t INP_SEL    : 1;            /*!< [8..8] Input selection for the comparator unit                            */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold                   */
            uint32_t            : 2;
      __IOM uint32_t UPPER      : 8;            /*!< [23..16] Upper Compare Value                                              */
      __IOM uint32_t BLANK_TIME : 3;            /*!< [26..24] Blank Time configuration                                         */
      __IOM uint32_t RST_BLANK_TIME : 1;        /*!< [27..27] Restart Blank time                                               */
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold                   */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode                                                     */
    } bit;
  } CMPCFG7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A4) Filter Configuration                                       */
    
    struct {
      __IOM uint32_t COEF_A0    : 2;            /*!< [1..0] Filter Coefficient 0                                               */
            uint32_t            : 2;
      __IOM uint32_t COEF_A1    : 2;            /*!< [5..4] Filter Coefficient 0                                               */
            uint32_t            : 2;
      __IOM uint32_t COEF_A2    : 2;            /*!< [9..8] Filter Coefficient 0                                               */
            uint32_t            : 2;
      __IOM uint32_t COEF_A3    : 2;            /*!< [13..12] Filter Coefficient 0                                             */
            uint32_t            : 2;
      __IOM uint32_t COEF_A4    : 2;            /*!< [17..16] Filter Coefficient 0                                             */
            uint32_t            : 2;
      __IOM uint32_t COEF_A5    : 2;            /*!< [21..20] Filter Coefficient 0                                             */
            uint32_t            : 2;
      __IOM uint32_t COEF_A6    : 2;            /*!< [25..24] Filter Coefficient 0                                             */
            uint32_t            : 2;
      __IOM uint32_t COEF_A7    : 2;            /*!< [29..28] Filter Coefficient 0                                             */
            uint32_t            : 2;
    } bit;
  } FILTCFG;
} ADC2_Type;                                    /*!< Size = 424 (0x1a8)                                                        */



/* =========================================================================================================================== */
/* ================                                           ARVG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ARVG (ARVG)
  */

typedef struct {                                /*!< (@ 0x48038000) ARVG Structure                                             */
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000000) CFU status register                                        */
    
