popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t VREF1V2_UP : 1;            /*!< [0..0] Reference voltage status                                           */
            uint32_t            : 31;
    } bit;
  } CFU_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) VAREF Interrupt Status Register                            */
    
    struct {
      __IOM uint32_t OC_IS      : 1;            /*!< [0..0] VAREF overcurrent (undervoltage) interrupt.                        */
            uint32_t            : 15;
      __IOM uint32_t OC_STS     : 1;            /*!< [16..16] VAREF overcurrent (undervoltage) status flag. The detection
                                                     circuit monitors VAREF voltage.                                           */
            uint32_t            : 15;
    } bit;
  } VAREF_IRQ;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) VAREF Interrupt Set Register                               */
    
    struct {
      __OM  uint32_t OC_IS_SET  : 1;            /*!< [0..0] VAREF overcurrent (undervoltage) interrupt set                     */
            uint32_t            : 15;
      __OM  uint32_t OC_STS_SET : 1;            /*!< [16..16] VAREF overcurrent (undervoltage) status flag set. Setting
                                                     this bit will trigger a VAREF switch off.                                 */
            uint32_t            : 15;
    } bit;
  } VAREF_IRQ_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) VAREF Interrupt Clear Register                             */
    
    struct {
      __OM  uint32_t OC_IS_CLR  : 1;            /*!< [0..0] VAREF overcurrent (undervoltage) interrupt clear                   */
            uint32_t            : 15;
      __OM  uint32_t OC_STS_CLR : 1;            /*!< [16..16] VAREF overcurrent (undervoltage) status flag clear               */
            uint32_t            : 15;
    } bit;
  } VAREF_IRQ_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) VAREF Interrupt Enable Register                            */
    
    struct {
      __IOM uint32_t OC_IEN     : 1;            /*!< [0..0] VAREF Overcurrent (undervoltage) Interrupt Enable                  */
            uint32_t            : 31;
    } bit;
  } VAREF_IEN;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) VAREF control register                                     */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] VAREF enable bit                                                   */
            uint32_t            : 31;
    } bit;
  } VAREF_CTRL;
} ARVG_Type;                                    /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           BDRV                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief BDRV (BDRV)
  */

typedef struct {                                /*!< (@ 0x4000C000) BDRV Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Bridge driver control 1                                    */
    
    struct {
      __IOM uint32_t HB1_EN     : 1;            /*!< [0..0] Half bridge 1 enable                                               */
      __IOM uint32_t LS1_PWM    : 1;            /*!< [1..1] Low-side driver 1 PWM enable                                       */
      __IOM uint32_t LS1_ON     : 1;            /*!< [2..2] Low-side driver 1 on                                               */
      __IOM uint32_t LS1_OC_SEL : 1;            /*!< [3..3] Low-side driver 1 overcurrent shutdown select                      */
            uint32_t            : 1;
      __IOM uint32_t HS1_PWM    : 1;            /*!< [5..5] High-side driver 1 PWM enable                                      */
      __IOM uint32_t HS1_ON     : 1;            /*!< [6..6] High-side driver 1 on                                              */
      __IOM uint32_t HS1_OC_SEL : 1;            /*!< [7..7] High-side driver 1 overcurrent shutdown select                     */
      __IOM uint32_t HB2_EN     : 1;            /*!< [8..8] Half bridge 2 enable                                               */
      __IOM uint32_t LS2_PWM    : 1;            /*!< [9..9] Low-side driver 2 PWM enable                                       */
      __IOM uint32_t LS2_ON     : 1;            /*!< [10..10] Low-side driver 2 on                                             */
      __IOM uint32_t LS2_OC_SEL : 1;            /*!< [11..11] Low-side driver 2 overcurrent shutdown select                    */
            uint32_t            : 1;
      __IOM uint32_t HS2_PWM    : 1;            /*!< [13..13] High-side driver 2 PWM enable                                    */
      __IOM uint32_t HS2_ON     : 1;            /*!< [14..14] High-side driver 2 on                                            */
      __IOM uint32_t HS2_OC_SEL : 1;            /*!< [15..15] High-side driver 2 overcurrent shutdown select                   */
      __IOM uint32_t HB3_EN     : 1;            /*!< [16..16] Half bridge 3 enable                                             */
      __IOM uint32_t LS3_PWM    : 1;            /*!< [17..17] Low-side driver 3 PWM enable                                     */
      __IOM uint32_t LS3_ON     : 1;            /*!< [18..18] Low-side driver 3 on                                             */
      __IOM uint32_t LS3_OC_SEL : 1;            /*!< [19..19] Low-side driver 3 overcurrent shutdown select                    */
            uint32_t            : 1;
      __IOM uint32_t HS3_PWM    : 1;            /*!< [21..21] High-side driver 3 PWM enable                                    */
      __IOM uint32_t HS3_ON     : 1;            /*!< [22..22] High-side driver 3 on                                            */
      __IOM uint32_t HS3_OC_SEL : 1;            /*!< [23..23] High-side driver 3 overcurrent shutdown select                   */
      __IOM uint32_t HS1_DCS_EN : 1;            /*!< [24..24] High-side driver 1 diagnosis current source enable               */
      __IOM uint32_t HS2_DCS_EN : 1;            /*!< [25..25] High-side driver 2 diagnosis current source enable               */
      __IOM uint32_t HS3_DCS_EN : 1;            /*!< [26..26] High-side driver 3 diagnosis current source enable               */
            uint32_t            : 1;
      __IM  uint32_t SUPERR_STS : 1;            /*!< [28..28] Supply error status                                              */
            uint32_t            : 3;
    } bit;
  } CTRL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Bridge driver control 2                                    */
    
