popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t HB1ONSEQCNF : 1;           /*!< [0..0] Half bridge 1 sequencer switch-on configuration                    */
      __IOM uint32_t HB1OFFSEQCNF : 1;          /*!< [1..1] Half bridge 1 sequencer switch-off configuration                   */
            uint32_t            : 2;
      __IOM uint32_t HB2ONSEQCNF : 1;           /*!< [4..4] Half bridge 2 sequencer switch-on configuration                    */
      __IOM uint32_t HB2OFFSEQCNF : 1;          /*!< [5..5] Half bridge 2 sequencer switch-off configuration                   */
            uint32_t            : 2;
      __IOM uint32_t HB3ONSEQCNF : 1;           /*!< [8..8] Half bridge 3 sequencer switch-on configuration                    */
      __IOM uint32_t HB3OFFSEQCNF : 1;          /*!< [9..9] Half bridge 3 sequencer switch-off configuration                   */
            uint32_t            : 2;
      __IOM uint32_t ACTDRV_DET_EN : 1;         /*!< [12..12] Detection of active / free-wheeling MOSFET                       */
            uint32_t            : 3;
      __IOM uint32_t DSMONVTH   : 3;            /*!< [18..16] Voltage threshold for drain-source monitoring of external
                                                     MOSFETs                                                                   */
            uint32_t            : 1;
      __IOM uint32_t LSDRV_DS_TFILT_SEL : 2;    /*!< [21..20] Filter time for drain-source monitoring of low-side
                                                     drivers                                                                   */
      __IOM uint32_t HSDRV_DS_TFILT_SEL : 2;    /*!< [23..22] Filter time for drain-source monitoring of high-side
                                                     drivers                                                                   */
      __IOM uint32_t LS_HS_BT_TFILT_SEL : 2;    /*!< [25..24] Blanking time for drain-source monitoring of low-side/high-side
                                                     drivers                                                                   */
            uint32_t            : 2;
      __IOM uint32_t DRV_CCP_TIMSEL : 3;        /*!< [30..28] Minimum cross-conduction protection time setting                 */
      __IOM uint32_t DRV_CCP_DIS : 1;           /*!< [31..31] Dynamic cross-conduction protection disable                      */
    } bit;
  } CTRL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) PWM source selection                                       */
    
    struct {
      __IOM uint32_t LS1_SRC_SEL : 3;           /*!< [2..0] Low-side driver 1 PWM source selection                             */
            uint32_t            : 1;
      __IOM uint32_t HS1_SRC_SEL : 3;           /*!< [6..4] High-side driver 1 PWM source selection                            */
            uint32_t            : 1;
      __IOM uint32_t LS2_SRC_SEL : 3;           /*!< [10..8] Low-side driver 2 PWM source selection                            */
            uint32_t            : 1;
      __IOM uint32_t HS2_SRC_SEL : 3;           /*!< [14..12] High-side driver 2 PWM source selection                          */
            uint32_t            : 1;
      __IOM uint32_t LS3_SRC_SEL : 3;           /*!< [18..16] Low-side driver 3 PWM source selection                           */
            uint32_t            : 1;
      __IOM uint32_t HS3_SRC_SEL : 3;           /*!< [22..20] High-side driver 3 PWM source selection                          */
            uint32_t            : 9;
    } bit;
  } PWMSRCSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Sequencer mapping                                          */
    
    struct {
      __IOM uint32_t HB1_SEQMAP : 1;            /*!< [0..0] Half bridge 1 sequencer mapping                                    */
      __IM  uint32_t HB1_ACTDRV : 1;            /*!< [1..1] Half bridge 1 active driver detected at switch-on                  */
            uint32_t            : 6;
      __IOM uint32_t HB2_SEQMAP : 1;            /*!< [8..8] Half bridge 2 sequencer mapping                                    */
      __IM  uint32_t HB2_ACTDRV : 1;            /*!< [9..9] Half bridge 2 active driver detected at switch-on                  */
            uint32_t            : 6;
      __IOM uint32_t HB3_SEQMAP : 1;            /*!< [16..16] Half bridge 3 sequencer mapping                                  */
      __IM  uint32_t HB3_ACTDRV : 1;            /*!< [17..17] Half bridge 3 active driver detected at switch-on                */
            uint32_t            : 14;
    } bit;
  } SEQMAP;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Delay diagnosis timer                                      */
    
    struct {
      __IM  uint32_t DLY_DIAG_TIM : 10;         /*!< [9..0] External power MOSFET switch-on/-off timer result register         */
            uint32_t            : 6;
      __IOM uint32_t DLY_DIAG_CHSEL : 3;        /*!< [18..16] External power MOSFET switch-on/-off timer channel
                                                     select                                                                    */
      __IOM uint32_t DLY_DIAG_DIRSEL : 1;       /*!< [19..19] External power MOSFET timer on/off select                        */
            uint32_t            : 4;
      __IM  uint32_t DLY_DIAG_STS : 1;          /*!< [24..24] External power MOSFET switch-on/-off timer valid flag            */
      __OM  uint32_t DLY_DIAG_SCLR : 1;         /*!< [25..25] External power MOSFET switch-on/-off timer valid flag
                                                     clear                                                                     */
      __OM  uint32_t DLY_DIAG_SSET : 1;         /*!< [26..26] External power MOSFET switch-on/-off timer valid flag
                                                     set                                                                       */
            uint32_t            : 5;
    } bit;
  } DLY_DIAG;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Charge pump control                                        */
    
