popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CP_EN      : 1;            /*!< [0..0] Charge pump enable                                                 */
            uint32_t            : 1;
      __IOM uint32_t CP_RDY_EN  : 1;            /*!< [2..2] Bridge driver on charge pump ready enable                          */
            uint32_t            : 5;
      __IOM uint32_t VCP_LOWTH2 : 1;            /*!< [8..8] Charge pump output voltage comparator falling threshold            */
      __IOM uint32_t VCP_LOWSRC_SEL : 1;        /*!< [9..9] Charge pump low voltage detection source select                    */
      __IOM uint32_t CPLOW_TFILT_SEL : 2;       /*!< [11..10] Filter time for charge pump voltage low diagnosis                */
            uint32_t            : 4;
      __IOM uint32_t CP_1STAGE  : 1;            /*!< [16..16] Charge pump 1-stage mode select                                  */
      __IOM uint32_t CP_STG_AUTO : 1;           /*!< [17..17] Automatic switch to 1-stage mode and back to 2-stage
                                                     mode depending on VSD                                                     */
            uint32_t            : 14;
    } bit;
  } CP_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Charge pump clock control                                  */
    
    struct {
      __IOM uint32_t DITH_LOWER : 5;            /*!< [4..0] CP clock divider boundary for lower frequency during
                                                     dithering                                                                 */
            uint32_t            : 3;
      __IOM uint32_t DITH_UPPER : 5;            /*!< [12..8] CP clock divider boundary for upper frequency during
                                                     dithering                                                                 */
      __IOM uint32_t F_CP       : 2;            /*!< [14..13] MSB of CP clock divider                                          */
            uint32_t            : 1;
      __IOM uint32_t CPCLK_EN   : 1;            /*!< [16..16] Charge pump clock enable                                         */
      __IOM uint32_t CPCLKDIS_SET : 1;          /*!< [17..17] Charge pump clock value if disabled                              */
            uint32_t            : 14;
    } bit;
  } CP_CLK_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Protection function control                                */
    
    struct {
      __IOM uint32_t LS1DRV_HCDISCHG_DIS : 1;   /*!< [0..0] Low-side driver 1 high-current discharge disable                   */
      __IOM uint32_t LS1DRV_OCSDN_DIS : 1;      /*!< [1..1] Low-side driver 1 overcurrent shutdown disable                     */
            uint32_t            : 2;
      __IOM uint32_t HS1DRV_HCDISCHG_DIS : 1;   /*!< [4..4] High-side driver 1 high-current discharge disable                  */
      __IOM uint32_t HS1DRV_OCSDN_DIS : 1;      /*!< [5..5] High-side driver 1 overcurrent shutdown disable                    */
            uint32_t            : 2;
      __IOM uint32_t LS2DRV_HCDISCHG_DIS : 1;   /*!< [8..8] Low-side driver 2 high-current discharge disable                   */
      __IOM uint32_t LS2DRV_OCSDN_DIS : 1;      /*!< [9..9] Low-side driver 2 overcurrent shutdown disable                     */
            uint32_t            : 2;
      __IOM uint32_t HS2DRV_HCDISCHG_DIS : 1;   /*!< [12..12] High-side driver 2 high-current discharge disable                */
      __IOM uint32_t HS2DRV_OCSDN_DIS : 1;      /*!< [13..13] High-side driver 2 overcurrent shutdown disable                  */
            uint32_t            : 2;
      __IOM uint32_t LS3DRV_HCDISCHG_DIS : 1;   /*!< [16..16] Low-side driver 3 high-current discharge disable                 */
      __IOM uint32_t LS3DRV_OCSDN_DIS : 1;      /*!< [17..17] Low-side driver 3 overcurrent shutdown disable                   */
            uint32_t            : 2;
      __IOM uint32_t HS3DRV_HCDISCHG_DIS : 1;   /*!< [20..20] High-side driver 3 high-current discharge disable                */
      __IOM uint32_t HS3DRV_OCSDN_DIS : 1;      /*!< [21..21] High-side driver 3 overcurrent shutdown disable                  */
            uint32_t            : 2;
      __IOM uint32_t DRVx_VCPLO_SDEN : 1;       /*!< [24..24] Driver shutdown on charge pump low voltage                       */
      __IOM uint32_t DRVx_VCPLO_DIS : 1;        /*!< [25..25] Disable driver discharge on charge pump low voltage              */
      __IOM uint32_t DRVx_VCPUP_DIS : 1;        /*!< [26..26] Disable driver discharge on charge pump high voltage             */
      __IOM uint32_t DRVx_VSDLO_DIS : 1;        /*!< [27..27] Disable driver discharge on VSD low voltage                      */
      __IOM uint32_t DRVx_VSDUP_DIS : 1;        /*!< [28..28] Disable driver discharge on VSD high voltage                     */
            uint32_t            : 3;
    } bit;
  } PROT_CTRL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Bridge driver status                                       */
    
    struct {
      __IM  uint32_t LS1_OC_STS : 1;            /*!< [0..0] External low-side 1 MOSFET overcurrent status                      */
      __IM  uint32_t LS1_DS_STS : 1;            /*!< [1..1] Low-side driver 1 off-state drain source monitoring status         */
            uint32_t            : 2;
      __IM  uint32_t HS1_OC_STS : 1;            /*!< [4..4] External high-side 1 MOSFET overcurrent status                     */
      __IM  uint32_t HS1_DS_STS : 1;            /*!< [5..5] High-side driver 1 off-state drain source monitoring
                                                     status                                                                    */
      __IM  uint32_t SH1_LOW_STS : 1;           /*!< [6..6] SH1 voltage low comparator status                                  */
      __IM  uint32_t SH1_HIGH_STS : 1;          /*!< [7..7] SH1 voltage high comparator status                                 */
      __IM  uint32_t LS2_OC_STS : 1;            /*!< [8..8] External low-side 2 MOSFET overcurrent status                      */
      __IM  uint32_t LS2_DS_STS : 1;            /*!< [9..9] Low-side driver 2 off-state drain source monitoring status         */
            uint32_t            : 2;
      __IM  uint32_t HS2_OC_STS : 1;            /*!< [12..12] External high-side 2 MOSFET overcurrent status                   */
      __IM  uint32_t HS2_DS_STS : 1;            /*!< [13..13] High-side driver 2 off-state drain source monitoring
                                                     status                                                                    */
      __IM  uint32_t SH2_LOW_STS : 1;           /*!< [14..14] SH2 voltage low comparator status                                */
      __IM  uint32_t SH2_HIGH_STS : 1;          /*!< [15..15] SH2 voltage high comparator status                               */
      __IM  uint32_t LS3_OC_STS : 1;            /*!< [16..16] External low-side 3 MOSFET overcurrent status                    */
      __IM  uint32_t LS3_DS_STS : 1;            /*!< [17..17] Low-side driver 3 off-state drain source monitoring
                                                     status                                                                    */
            uint32_t            : 2;
      __IM  uint32_t HS3_OC_STS : 1;            /*!< [20..20] External high-side 3 MOSFET overcurrent status                   */
      __IM  uint32_t HS3_DS_STS : 1;            /*!< [21..21] High-side driver 3 off-state drain source monitoring
                                                     status                                                                    */
      __IM  uint32_t SH3_LOW_STS : 1;           /*!< [22..22] SH3 voltage low comparator status                                */
      __IM  uint32_t SH3_HIGH_STS : 1;          /*!< [23..23] SH3 voltage high comparator status                               */
      __IM  uint32_t CP_OTSD_STS : 1;           /*!< [24..24] Charge pump temperature measurement status                       */
      __IM  uint32_t VCP_LOTH1_STS : 1;         /*!< [25..25] VCP measurement low voltage status                               */
      __IM  uint32_t VCP_UPTH_STS : 1;          /*!< [26..26] VCP measurement high voltage status                              */
      __IM  uint32_t VSD_LOTH_STS : 1;          /*!< [27..27] VSD measurement low voltage status                               */
      __IM  uint32_t VSD_UPTH_STS : 1;          /*!< [28..28] VSD measurement high voltage status                              */
      __IM  uint32_t VSD_CP1ST_STS : 1;         /*!< [29..29] VSD measurement status for automatic CP stage selection          */
      __IM  uint32_t VSD_OV_STS : 1;            /*!< [30..30] VSD overvoltage comparator status                                */
      __IM  uint32_t VCP_LOTH2_STS : 1;         /*!< [31..31] Charge pump analog comparator low voltage status                 */
    } bit;
  } STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Bridge driver status clear                                 */
    
