popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t LS1_OC_SC  : 1;            /*!< [0..0] External low-side 1 MOSFET overcurrent status clear                */
      __OM  uint32_t LS1_DS_SC  : 1;            /*!< [1..1] Low-side driver 1 off-state drain source monitoring status
                                                     clear                                                                     */
            uint32_t            : 2;
      __OM  uint32_t HS1_OC_SC  : 1;            /*!< [4..4] External high-side 1 MOSFET overcurrent status clear               */
      __OM  uint32_t HS1_DS_SC  : 1;            /*!< [5..5] High-side driver 1 off-state drain source monitoring
                                                     status clear                                                              */
            uint32_t            : 2;
      __OM  uint32_t LS2_OC_SC  : 1;            /*!< [8..8] External low-side 2 MOSFET overcurrent status clear                */
      __OM  uint32_t LS2_DS_SC  : 1;            /*!< [9..9] Low-side driver 2 off-state drain source monitoring status
                                                     clear                                                                     */
            uint32_t            : 2;
      __OM  uint32_t HS2_OC_SC  : 1;            /*!< [12..12] External high-side 2 MOSFET overcurrent status clear             */
      __OM  uint32_t HS2_DS_SC  : 1;            /*!< [13..13] High-side driver 2 off-state drain source monitoring
                                                     status clear                                                              */
            uint32_t            : 2;
      __OM  uint32_t LS3_OC_SC  : 1;            /*!< [16..16] External low-side 3 MOSFET overcurrent status clear              */
      __OM  uint32_t LS3_DS_SC  : 1;            /*!< [17..17] Low-side driver 3 off-state drain source monitoring
                                                     status clear                                                              */
            uint32_t            : 2;
      __OM  uint32_t HS3_OC_SC  : 1;            /*!< [20..20] External high-side 3 MOSFET overcurrent status clear             */
      __OM  uint32_t HS3_DS_SC  : 1;            /*!< [21..21] High-side driver 3 off-state drain source monitoring
                                                     status clear                                                              */
            uint32_t            : 9;
      __OM  uint32_t VCP_LOTH2_SC : 1;          /*!< [31..31] Charge pump comparator low voltage status clear                  */
    } bit;
  } STSCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Bridge driver status set                                   */
    
    struct {
      __OM  uint32_t LS1_OC_SS  : 1;            /*!< [0..0] External low-side 1 MOSFET overcurrent status set                  */
      __OM  uint32_t LS1_DS_SS  : 1;            /*!< [1..1] Low-side driver 1 off-state drain source monitoring status
                                                     set                                                                       */
            uint32_t            : 2;
      __OM  uint32_t HS1_OC_SS  : 1;            /*!< [4..4] External high-side 1 MOSFET overcurrent status set                 */
      __OM  uint32_t HS1_DS_SS  : 1;            /*!< [5..5] High-side driver 1 off-state drain source monitoring
                                                     status set                                                                */
            uint32_t            : 2;
      __OM  uint32_t LS2_OC_SS  : 1;            /*!< [8..8] External low-side 2 MOSFET overcurrent status set                  */
      __OM  uint32_t LS2_DS_SS  : 1;            /*!< [9..9] Low-side driver 2 off-state drain source monitoring status
                                                     set                                                                       */
            uint32_t            : 2;
      __OM  uint32_t HS2_OC_SS  : 1;            /*!< [12..12] External high-side 2 MOSFET overcurrent status set               */
      __OM  uint32_t HS2_DS_SS  : 1;            /*!< [13..13] High-side driver 2 off-state drain source monitoring
                                                     status set                                                                */
            uint32_t            : 2;
      __OM  uint32_t LS3_OC_SS  : 1;            /*!< [16..16] External low-side 3 MOSFET overcurrent status set                */
      __OM  uint32_t LS3_DS_SS  : 1;            /*!< [17..17] Low-side driver 3 off-state drain source monitoring
                                                     status set                                                                */
            uint32_t            : 2;
      __OM  uint32_t HS3_OC_SS  : 1;            /*!< [20..20] External high-side 3 MOSFET overcurrent status set               */
      __OM  uint32_t HS3_DS_SS  : 1;            /*!< [21..21] High-side driver 3 off-state drain source monitoring
                                                     status set                                                                */
            uint32_t            : 9;
      __OM  uint32_t VCP_LOTH2_SS : 1;          /*!< [31..31] Charge pump comparator low voltage status set                    */
    } bit;
  } STSSET;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) Bridge driver interrupt status                             */
    
    struct {
      __IM  uint32_t LS1_OC_IS  : 1;            /*!< [0..0] External low-side 1 MOSFET overcurrent interrupt status            */
      __IM  uint32_t LS1_DS_IS  : 1;            /*!< [1..1] Low-side driver 1 off-state drain source monitoring interrupt
                                                     status                                                                    */
            uint32_t            : 2;
      __IM  uint32_t HS1_OC_IS  : 1;            /*!< [4..4] External high-side 1 MOSFET overcurrent interrupt status           */
      __IM  uint32_t HS1_DS_IS  : 1;            /*!< [5..5] High-side driver 1 off-state drain source monitoring
                                                     interrupt status                                                          */
            uint32_t            : 2;
      __IM  uint32_t LS2_OC_IS  : 1;            /*!< [8..8] External low-side 2 MOSFET overcurrent interrupt status            */
      __IM  uint32_t LS2_DS_IS  : 1;            /*!< [9..9] Low-side driver 2 off-state drain source monitoring interrupt
                                                     status                                                                    */
            uint32_t            : 2;
      __IM  uint32_t HS2_OC_IS  : 1;            /*!< [12..12] External high-side 2 MOSFET overcurrent interrupt status         */
      __IM  uint32_t HS2_DS_IS  : 1;            /*!< [13..13] High-side driver 2 off-state drain source monitoring
                                                     interrupt status                                                          */
            uint32_t            : 2;
      __IM  uint32_t LS3_OC_IS  : 1;            /*!< [16..16] External low-side 3 MOSFET overcurrent interrupt status          */
      __IM  uint32_t LS3_DS_IS  : 1;            /*!< [17..17] Low-side driver 3 off-state drain source monitoring
                                                     interrupt status                                                          */
            uint32_t            : 2;
      __IM  uint32_t HS3_OC_IS  : 1;            /*!< [20..20] External high-side 3 MOSFET overcurrent interrupt status         */
      __IM  uint32_t HS3_DS_IS  : 1;            /*!< [21..21] High-side driver 3 off-state drain source monitoring
                                                     interrupt status                                                          */
            uint32_t            : 2;
      __IM  uint32_t HB1_ASEQ_IS : 1;           /*!< [24..24] Half bridge 1 adaptive sequencer interrupt status                */
      __IM  uint32_t HB2_ASEQ_IS : 1;           /*!< [25..25] Half bridge 2 adaptive sequencer interrupt status                */
      __IM  uint32_t HB3_ASEQ_IS : 1;           /*!< [26..26] Half bridge 3 adaptive sequencer interrupt status                */
      __IM  uint32_t SEQ_ERR_IS : 1;            /*!< [27..27] Driver sequence error interrupt status                           */
      __IM  uint32_t HB1_ACTDRV_IS : 1;         /*!< [28..28] Half bridge 1 active driver detection interrupt status           */
      __IM  uint32_t HB2_ACTDRV_IS : 1;         /*!< [29..29] Half bridge 2 active driver detection interrupt status           */
      __IM  uint32_t HB3_ACTDRV_IS : 1;         /*!< [30..30] Half bridge 3 active driver detection interrupt status           */
      __IM  uint32_t VCP_LOTH2_IS : 1;          /*!< [31..31] Charge pump comparator low voltage interrupt status              */
    } bit;
  } IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Bridge driver interrupt status clear                       */
    
