popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t LS1_OC_ISC : 1;            /*!< [0..0] External low-side 1 MOSFET overcurrent interrupt status
                                                     clear                                                                     */
      __OM  uint32_t LS1_DS_ISC : 1;            /*!< [1..1] Low-side driver 1 off-state drain source monitoring interrupt
                                                     status clear                                                              */
            uint32_t            : 2;
      __OM  uint32_t HS1_OC_ISC : 1;            /*!< [4..4] External high-side 1 MOSFET overcurrent interrupt status
                                                     clear                                                                     */
      __OM  uint32_t HS1_DS_ISC : 1;            /*!< [5..5] High-side driver 1 off-state drain source monitoring
                                                     interrupt status clear                                                    */
            uint32_t            : 2;
      __OM  uint32_t LS2_OC_ISC : 1;            /*!< [8..8] External low-side 2 MOSFET overcurrent interrupt status
                                                     clear                                                                     */
      __OM  uint32_t LS2_DS_ISC : 1;            /*!< [9..9] Low-side driver 2 off-state drain source monitoring interrupt
                                                     status clear                                                              */
            uint32_t            : 2;
      __OM  uint32_t HS2_OC_ISC : 1;            /*!< [12..12] External high-side 2 MOSFET overcurrent interrupt status
                                                     clear                                                                     */
      __OM  uint32_t HS2_DS_ISC : 1;            /*!< [13..13] High-side driver 2 off-state drain source monitoring
                                                     interrupt status clear                                                    */
            uint32_t            : 2;
      __OM  uint32_t LS3_OC_ISC : 1;            /*!< [16..16] External low-side 3 MOSFET overcurrent interrupt status
                                                     clear                                                                     */
      __OM  uint32_t LS3_DS_ISC : 1;            /*!< [17..17] Low-side driver 3 off-state drain source monitoring
                                                     interrupt status clear                                                    */
            uint32_t            : 2;
      __OM  uint32_t HS3_OC_ISC : 1;            /*!< [20..20] External high-side 3 MOSFET overcurrent interrupt status
                                                     clear                                                                     */
      __OM  uint32_t HS3_DS_ISC : 1;            /*!< [21..21] High-side driver 3 off-state drain source monitoring
                                                     interrupt status clear                                                    */
            uint32_t            : 2;
      __OM  uint32_t HB1_ASEQ_ISC : 1;          /*!< [24..24] Half bridge 1 adaptive sequencer interrupt status clear          */
      __OM  uint32_t HB2_ASEQ_ISC : 1;          /*!< [25..25] Half bridge 2 adaptive sequencer interrupt status clear          */
      __OM  uint32_t HB3_ASEQ_ISC : 1;          /*!< [26..26] Half bridge 3 adaptive sequencer interrupt status clear          */
      __OM  uint32_t SEQ_ERR_ISC : 1;           /*!< [27..27] Driver sequence error interrupt status clear                     */
      __OM  uint32_t HB1_ACTDRV_ISC : 1;        /*!< [28..28] Half bridge 1 active driver detection interrupt status
                                                     clear                                                                     */
      __OM  uint32_t HB2_ACTDRV_ISC : 1;        /*!< [29..29] Half bridge 2 active driver detection interrupt status
                                                     clear                                                                     */
      __OM  uint32_t HB3_ACTDRV_ISC : 1;        /*!< [30..30] Half bridge 3 active driver detection interrupt status
                                                     clear                                                                     */
      __OM  uint32_t VCP_LOTH2_ISC : 1;         /*!< [31..31] Charge pump comparator low voltage interrupt status
                                                     clear                                                                     */
    } bit;
  } IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Bridge driver interrupt status set                         */
    
    struct {
      __OM  uint32_t LS1_OC_ISS : 1;            /*!< [0..0] External low-side 1 MOSFET overcurrent interrupt status
                                                     set                                                                       */
      __OM  uint32_t LS1_DS_ISS : 1;            /*!< [1..1] Low-side driver 1 off-state drain source monitoring interrupt
                                                     status set                                                                */
            uint32_t            : 2;
      __OM  uint32_t HS1_OC_ISS : 1;            /*!< [4..4] External high-side 1 MOSFET overcurrent interrupt status
                                                     set                                                                       */
      __OM  uint32_t HS1_DS_ISS : 1;            /*!< [5..5] High-side driver 1 off-state drain source monitoring
                                                     interrupt status set                                                      */
            uint32_t            : 2;
      __OM  uint32_t LS2_OC_ISS : 1;            /*!< [8..8] External low-side 2 MOSFET overcurrent interrupt status
                                                     set                                                                       */
      __OM  uint32_t LS2_DS_ISS : 1;            /*!< [9..9] Low-side driver 2 off-state drain source monitoring interrupt
                                                     status set                                                                */
            uint32_t            : 2;
      __OM  uint32_t HS2_OC_ISS : 1;            /*!< [12..12] External high-side 2 MOSFET overcurrent interrupt status
                                                     set                                                                       */
      __OM  uint32_t HS2_DS_ISS : 1;            /*!< [13..13] High-side driver 2 off-state drain source monitoring
                                                     interrupt status set                                                      */
            uint32_t            : 2;
      __OM  uint32_t LS3_OC_ISS : 1;            /*!< [16..16] External low-side 3 MOSFET overcurrent interrupt status
                                                     set                                                                       */
      __OM  uint32_t LS3_DS_ISS : 1;            /*!< [17..17] Low-side driver 3 off-state drain source monitoring
                                                     interrupt status set                                                      */
            uint32_t            : 2;
      __OM  uint32_t HS3_OC_ISS : 1;            /*!< [20..20] External high-side 3 MOSFET overcurrent interrupt status
                                                     set                                                                       */
      __OM  uint32_t HS3_DS_ISS : 1;            /*!< [21..21] High-side driver 3 off-state drain source monitoring
                                                     interrupt status set                                                      */
            uint32_t            : 2;
      __OM  uint32_t HB1_ASEQ_ISS : 1;          /*!< [24..24] Half bridge 1 adaptive sequencer interrupt status set            */
      __OM  uint32_t HB2_ASEQ_ISS : 1;          /*!< [25..25] Half bridge 2 adaptive sequencer interrupt status set            */
      __OM  uint32_t HB3_ASEQ_ISS : 1;          /*!< [26..26] Half bridge 3 adaptive sequencer interrupt status set            */
      __OM  uint32_t SEQ_ERR_ISS : 1;           /*!< [27..27] Driver sequence error interrupt status set                       */
      __OM  uint32_t HB1_ACTDRV_ISS : 1;        /*!< [28..28] Half bridge 1 active driver detection interrupt status
                                                     set                                                                       */
      __OM  uint32_t HB2_ACTDRV_ISS : 1;        /*!< [29..29] Half bridge 2 active driver detection interrupt status
                                                     set                                                                       */
      __OM  uint32_t HB3_ACTDRV_ISS : 1;        /*!< [30..30] Half bridge 3 active driver detection interrupt status
                                                     set                                                                       */
      __OM  uint32_t VCP_LOTH2_ISS : 1;         /*!< [31..31] Charge pump comparator low voltage interrupt status
                                                     set                                                                       */
    } bit;
  } IRQSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Bridge driver interrupt enable                             */
    
