popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t LS1_OC_IEN : 1;            /*!< [0..0] External low-side 1 MOSFET overcurrent interrupt enable            */
      __IOM uint32_t LS1_DS_IEN : 1;            /*!< [1..1] Low-side driver 1 off-state drain source monitoring interrupt
                                                     enable                                                                    */
            uint32_t            : 2;
      __IOM uint32_t HS1_OC_IEN : 1;            /*!< [4..4] External high-side 1 MOSFET overcurrent interrupt enable           */
      __IOM uint32_t HS1_DS_IEN : 1;            /*!< [5..5] High-side driver 1 off-state drain source monitoring
                                                     interrupt enable                                                          */
            uint32_t            : 2;
      __IOM uint32_t LS2_OC_IEN : 1;            /*!< [8..8] External low-side 2 MOSFET overcurrent interrupt enable            */
      __IOM uint32_t LS2_DS_IEN : 1;            /*!< [9..9] Low-side driver 2 off-state drain source monitoring interrupt
                                                     enable                                                                    */
            uint32_t            : 2;
      __IOM uint32_t HS2_OC_IEN : 1;            /*!< [12..12] External high-side 2 MOSFET overcurrent interrupt enable         */
      __IOM uint32_t HS2_DS_IEN : 1;            /*!< [13..13] High-side driver 2 off-state drain source monitoring
                                                     interrupt enable                                                          */
            uint32_t            : 2;
      __IOM uint32_t LS3_OC_IEN : 1;            /*!< [16..16] External low-side 3 MOSFET overcurrent interrupt enable          */
      __IOM uint32_t LS3_DS_IEN : 1;            /*!< [17..17] Low-side driver 3 off-state drain source monitoring
                                                     interrupt enable                                                          */
            uint32_t            : 2;
      __IOM uint32_t HS3_OC_IEN : 1;            /*!< [20..20] External high-side 3 MOSFET overcurrent interrupt enable         */
      __IOM uint32_t HS3_DS_IEN : 1;            /*!< [21..21] High-side driver 3 off-state drain source monitoring
                                                     interrupt enable                                                          */
            uint32_t            : 2;
      __IOM uint32_t HB1_ASEQ_IEN : 1;          /*!< [24..24] Half bridge 1 adaptive sequencer interrupt enable                */
      __IOM uint32_t HB2_ASEQ_IEN : 1;          /*!< [25..25] Half bridge 2 adaptive sequencer interrupt enable                */
      __IOM uint32_t HB3_ASEQ_IEN : 1;          /*!< [26..26] Half bridge 3 adaptive sequencer interrupt enable                */
      __IOM uint32_t SEQ_ERR_IEN : 1;           /*!< [27..27] Driver sequence error interrupt enable                           */
      __IOM uint32_t HB1_ACTDRV_IEN : 1;        /*!< [28..28] Half bridge 1 active driver detection interrupt enable           */
      __IOM uint32_t HB2_ACTDRV_IEN : 1;        /*!< [29..29] Half bridge 2 active driver detection interrupt enable           */
      __IOM uint32_t HB3_ACTDRV_IEN : 1;        /*!< [30..30] Half bridge 3 active driver detection interrupt enable           */
      __IOM uint32_t VCP_LOTH2_IEN : 1;         /*!< [31..31] Charge pump comparator low voltage interrupt enable              */
    } bit;
  } IRQEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Half bridge 1 gate current clamping value                  */
    
    struct {
      __IOM uint32_t HB1_ICLMPON : 6;           /*!< [5..0] Half bridge 1 current clamping value for on state                  */
            uint32_t            : 2;
      __IOM uint32_t HB1_ICLMPOFF : 6;          /*!< [13..8] Half bridge 1 current clamping value for off state                */
            uint32_t            : 18;
    } bit;
  } HB1IGATECLMPC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Half bridge 2 gate current clamping value                  */
    
    struct {
      __IOM uint32_t HB2_ICLMPON : 6;           /*!< [5..0] Half bridge 2 current clamping value for on state                  */
            uint32_t            : 2;
      __IOM uint32_t HB2_ICLMPOFF : 6;          /*!< [13..8] Half bridge 2 current clamping value for off state                */
            uint32_t            : 18;
    } bit;
  } HB2IGATECLMPC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Half bridge 3 gate current clamping value                  */
    
    struct {
      __IOM uint32_t HB3_ICLMPON : 6;           /*!< [5..0] Half bridge 3 current clamping value for on state                  */
            uint32_t            : 2;
      __IOM uint32_t HB3_ICLMPOFF : 6;          /*!< [13..8] Half bridge 3 current clamping value for off state                */
            uint32_t            : 18;
    } bit;
  } HB3IGATECLMPC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Low-side driver 1 constant time control                    */
    
    struct {
      __IOM uint32_t LS1_TCOFF  : 8;            /*!< [7..0] Low-side driver 1 constant switch-off time setting                 */
      __IOM uint32_t LS1_TCON   : 8;            /*!< [15..8] Low-side driver 1 constant switch-on time setting                 */
            uint32_t            : 16;
    } bit;
  } LS1CONSTTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Low-side driver 1 constant current control                 */
    
    struct {
      __IOM uint32_t LS1_ICOFF  : 6;            /*!< [5..0] Low-side driver 1 constant switch-off current setting              */
            uint32_t            : 2;
      __IOM uint32_t LS1_ICON   : 6;            /*!< [13..8] Low-side driver 1 constant switch-on current setting              */
            uint32_t            : 18;
    } bit;
  } LS1CONSTIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) High-side driver 1 constant time control                   */
    
