popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t HS1_I1OFF  : 6;            /*!< [5..0] High-side driver 1 sequencer switch-off phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS1_I2OFF  : 6;            /*!< [13..8] High-side driver 1 sequencer switch-off phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS1_I3OFF  : 6;            /*!< [21..16] High-side driver 1 sequencer switch-off phase 3 current
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } HS1SEQOFFIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) High-side driver 1 switch-on time control                  */
    
    struct {
      __IOM uint32_t HS1_T1ON   : 6;            /*!< [5..0] High-side driver 1 sequencer switch-on phase 1 time setting        */
            uint32_t            : 2;
      __IOM uint32_t HS1_T2ON   : 6;            /*!< [13..8] High-side driver 1 sequencer switch-on phase 2 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS1_T3ON   : 6;            /*!< [21..16] High-side driver 1 sequencer switch-on phase 3 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS1_T4ON   : 6;            /*!< [29..24] High-side driver 1 sequencer switch-on phase 4 time
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } HS1SEQONTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) High-side driver 1 switch-on current control               */
    
    struct {
      __IOM uint32_t HS1_I1ON   : 6;            /*!< [5..0] High-side driver 1 sequencer switch-on phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS1_I2ON   : 6;            /*!< [13..8] High-side driver 1 sequencer switch-on phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS1_I3ON   : 6;            /*!< [21..16] High-side driver 1 sequencer switch-on phase 3 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS1_I4ON   : 6;            /*!< [29..24] High-side driver 1 sequencer switch-on phase 4 current
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } HS1SEQONIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Low-side driver 2 constant time control                    */
    
    struct {
      __IOM uint32_t LS2_TCOFF  : 8;            /*!< [7..0] Low-side driver 2 constant switch-off time setting                 */
      __IOM uint32_t LS2_TCON   : 8;            /*!< [15..8] Low-side driver 2 constant switch-on time setting                 */
            uint32_t            : 16;
    } bit;
  } LS2CONSTTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) Low-side driver 2 constant current control                 */
    
    struct {
      __IOM uint32_t LS2_ICOFF  : 6;            /*!< [5..0] Low-side driver 2 constant switch-off current setting              */
            uint32_t            : 2;
      __IOM uint32_t LS2_ICON   : 6;            /*!< [13..8] Low-side driver 2 constant switch-on current setting              */
            uint32_t            : 18;
    } bit;
  } LS2CONSTIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) High-side driver 2 constant time control                   */
    
    struct {
      __IOM uint32_t HS2_TCOFF  : 8;            /*!< [7..0] High-side driver 2 constant switch-off time setting                */
      __IOM uint32_t HS2_TCON   : 8;            /*!< [15..8] High-side driver 2 constant switch-on time setting                */
            uint32_t            : 16;
    } bit;
  } HS2CONSTTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) High-side driver 2 constant current control                */
    
    struct {
      __IOM uint32_t HS2_ICOFF  : 6;            /*!< [5..0] High-side driver 2 constant switch-off current setting             */
            uint32_t            : 2;
      __IOM uint32_t HS2_ICON   : 6;            /*!< [13..8] High-side driver 2 constant switch-on current setting             */
            uint32_t            : 18;
    } bit;
  } HS2CONSTIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Low-side driver 2 switch-off time control                  */
    
    struct {
      __IOM uint32_t LS2_T1OFF  : 6;            /*!< [5..0] Low-side driver 2 sequencer switch-off phase 1 time setting        */
            uint32_t            : 2;
      __IOM uint32_t LS2_T2OFF  : 6;            /*!< [13..8] Low-side driver 2 sequencer switch-off phase 2 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS2_T3OFF  : 6;            /*!< [21..16] Low-side driver 2 sequencer switch-off phase 3 time
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } LS2SEQOFFTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Low-side driver 2 switch-off current control               */
    
