popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t LS2_I1OFF  : 6;            /*!< [5..0] Low-side driver 2 sequencer switch-off phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS2_I2OFF  : 6;            /*!< [13..8] Low-side driver 2 sequencer switch-off phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS2_I3OFF  : 6;            /*!< [21..16] Low-side driver 2 sequencer switch-off phase 3 current
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } LS2SEQOFFIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Low-side driver 2 switch-on time control                   */
    
    struct {
      __IOM uint32_t LS2_T1ON   : 6;            /*!< [5..0] Low-side driver 2 sequencer switch-on phase 1 time setting         */
            uint32_t            : 2;
      __IOM uint32_t LS2_T2ON   : 6;            /*!< [13..8] Low-side driver 2 sequencer switch-on phase 2 time setting        */
            uint32_t            : 2;
      __IOM uint32_t LS2_T3ON   : 6;            /*!< [21..16] Low-side driver 2 sequencer switch-on phase 3 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS2_T4ON   : 6;            /*!< [29..24] Low-side driver 2 sequencer switch-on phase 4 time
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } LS2SEQONTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) Low-side driver 2 switch-on current control                */
    
    struct {
      __IOM uint32_t LS2_I1ON   : 6;            /*!< [5..0] Low-side driver 2 sequencer switch-on phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS2_I2ON   : 6;            /*!< [13..8] Low-side driver 2 sequencer switch-on phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS2_I3ON   : 6;            /*!< [21..16] Low-side driver 2 sequencer switch-on phase 3 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS2_I4ON   : 6;            /*!< [29..24] Low-side driver 2 sequencer switch-on phase 4 current
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } LS2SEQONIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) High-side driver 2 switch-off time control                 */
    
    struct {
      __IOM uint32_t HS2_T1OFF  : 6;            /*!< [5..0] High-side driver 2 sequencer switch-off phase 1 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_T2OFF  : 6;            /*!< [13..8] High-side driver 2 sequencer switch-off phase 2 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_T3OFF  : 6;            /*!< [21..16] High-side driver 2 sequencer switch-off phase 3 time
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } HS2SEQOFFTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) High-side driver 2 switch-off current control              */
    
    struct {
      __IOM uint32_t HS2_I1OFF  : 6;            /*!< [5..0] High-side driver 2 sequencer switch-off phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_I2OFF  : 6;            /*!< [13..8] High-side driver 2 sequencer switch-off phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_I3OFF  : 6;            /*!< [21..16] High-side driver 2 sequencer switch-off phase 3 current
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } HS2SEQOFFIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) High-side driver 2 switch-on time control                  */
    
    struct {
      __IOM uint32_t HS2_T1ON   : 6;            /*!< [5..0] High-side driver 2 sequencer switch-on phase 1 time setting        */
            uint32_t            : 2;
      __IOM uint32_t HS2_T2ON   : 6;            /*!< [13..8] High-side driver 2 sequencer switch-on phase 2 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_T3ON   : 6;            /*!< [21..16] High-side driver 2 sequencer switch-on phase 3 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_T4ON   : 6;            /*!< [29..24] High-side driver 2 sequencer switch-on phase 4 time
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } HS2SEQONTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) High-side driver 2 switch-on current control               */
    
