popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t HS2_I1ON   : 6;            /*!< [5..0] High-side driver 2 sequencer switch-on phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_I2ON   : 6;            /*!< [13..8] High-side driver 2 sequencer switch-on phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_I3ON   : 6;            /*!< [21..16] High-side driver 2 sequencer switch-on phase 3 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS2_I4ON   : 6;            /*!< [29..24] High-side driver 2 sequencer switch-on phase 4 current
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } HS2SEQONIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Low-side driver 3 constant time control                    */
    
    struct {
      __IOM uint32_t LS3_TCOFF  : 8;            /*!< [7..0] Low-side driver 3 constant switch-off time setting                 */
      __IOM uint32_t LS3_TCON   : 8;            /*!< [15..8] Low-side driver 3 constant switch-on time setting                 */
            uint32_t            : 16;
    } bit;
  } LS3CONSTTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Low-side driver 3 constant current control                 */
    
    struct {
      __IOM uint32_t LS3_ICOFF  : 6;            /*!< [5..0] Low-side driver 3 constant switch-off current setting              */
            uint32_t            : 2;
      __IOM uint32_t LS3_ICON   : 6;            /*!< [13..8] Low-side driver 3 constant switch-on current setting              */
            uint32_t            : 18;
    } bit;
  } LS3CONSTIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) High-side driver 3 constant time control                   */
    
    struct {
      __IOM uint32_t HS3_TCOFF  : 8;            /*!< [7..0] High-side driver 3 constant switch-off time setting                */
      __IOM uint32_t HS3_TCON   : 8;            /*!< [15..8] High-side driver 3 constant switch-on time setting                */
            uint32_t            : 16;
    } bit;
  } HS3CONSTTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) High-side driver 3 constant current control                */
    
    struct {
      __IOM uint32_t HS3_ICOFF  : 6;            /*!< [5..0] High-side driver 3 constant switch-off current setting             */
            uint32_t            : 2;
      __IOM uint32_t HS3_ICON   : 6;            /*!< [13..8] High-side driver 3 constant switch-on current setting             */
            uint32_t            : 18;
    } bit;
  } HS3CONSTIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) Low-side driver 3 switch-off time control                  */
    
    struct {
      __IOM uint32_t LS3_T1OFF  : 6;            /*!< [5..0] Low-side driver 3 sequencer switch-off phase 1 time setting        */
            uint32_t            : 2;
      __IOM uint32_t LS3_T2OFF  : 6;            /*!< [13..8] Low-side driver 3 sequencer switch-off phase 2 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS3_T3OFF  : 6;            /*!< [21..16] Low-side driver 3 sequencer switch-off phase 3 time
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } LS3SEQOFFTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) Low-side driver 3 switch-off current control               */
    
    struct {
      __IOM uint32_t LS3_I1OFF  : 6;            /*!< [5..0] Low-side driver 3 sequencer switch-off phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS3_I2OFF  : 6;            /*!< [13..8] Low-side driver 3 sequencer switch-off phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS3_I3OFF  : 6;            /*!< [21..16] Low-side driver 3 sequencer switch-off phase 3 current
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } LS3SEQOFFIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) Low-side driver 3 switch-on time control                   */
    
    struct {
      __IOM uint32_t LS3_T1ON   : 6;            /*!< [5..0] Low-side driver 3 sequencer switch-on phase 1 time setting         */
            uint32_t            : 2;
      __IOM uint32_t LS3_T2ON   : 6;            /*!< [13..8] Low-side driver 3 sequencer switch-on phase 2 time setting        */
            uint32_t            : 2;
      __IOM uint32_t LS3_T3ON   : 6;            /*!< [21..16] Low-side driver 3 sequencer switch-on phase 3 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS3_T4ON   : 6;            /*!< [29..24] Low-side driver 3 sequencer switch-on phase 4 time
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } LS3SEQONTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) Low-side driver 3 switch-on current control                */
    
