popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t LS3_I1ON   : 6;            /*!< [5..0] Low-side driver 3 sequencer switch-on phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS3_I2ON   : 6;            /*!< [13..8] Low-side driver 3 sequencer switch-on phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS3_I3ON   : 6;            /*!< [21..16] Low-side driver 3 sequencer switch-on phase 3 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t LS3_I4ON   : 6;            /*!< [29..24] Low-side driver 3 sequencer switch-on phase 4 current
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } LS3SEQONIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C8) High-side driver 3 switch-off time control                 */
    
    struct {
      __IOM uint32_t HS3_T1OFF  : 6;            /*!< [5..0] High-side driver 3 sequencer switch-off phase 1 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_T2OFF  : 6;            /*!< [13..8] High-side driver 3 sequencer switch-off phase 2 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_T3OFF  : 6;            /*!< [21..16] High-side driver 3 sequencer switch-off phase 3 time
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } HS3SEQOFFTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000CC) High-side driver 3 switch-off current control              */
    
    struct {
      __IOM uint32_t HS3_I1OFF  : 6;            /*!< [5..0] High-side driver 3 sequencer switch-off phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_I2OFF  : 6;            /*!< [13..8] High-side driver 3 sequencer switch-off phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_I3OFF  : 6;            /*!< [21..16] High-side driver 3 sequencer switch-off phase 3 current
                                                     setting                                                                   */
            uint32_t            : 10;
    } bit;
  } HS3SEQOFFIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) High-side driver 3 switch-on time control                  */
    
    struct {
      __IOM uint32_t HS3_T1ON   : 6;            /*!< [5..0] High-side driver 3 sequencer switch-on phase 1 time setting        */
            uint32_t            : 2;
      __IOM uint32_t HS3_T2ON   : 6;            /*!< [13..8] High-side driver 3 sequencer switch-on phase 2 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_T3ON   : 6;            /*!< [21..16] High-side driver 3 sequencer switch-on phase 3 time
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_T4ON   : 6;            /*!< [29..24] High-side driver 3 sequencer switch-on phase 4 time
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } HS3SEQONTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D4) High-side driver 3 switch-on current control               */
    
    struct {
      __IOM uint32_t HS3_I1ON   : 6;            /*!< [5..0] High-side driver 3 sequencer switch-on phase 1 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_I2ON   : 6;            /*!< [13..8] High-side driver 3 sequencer switch-on phase 2 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_I3ON   : 6;            /*!< [21..16] High-side driver 3 sequencer switch-on phase 3 current
                                                     setting                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HS3_I4ON   : 6;            /*!< [29..24] High-side driver 3 sequencer switch-on phase 4 current
                                                     setting                                                                   */
            uint32_t            : 2;
    } bit;
  } HS3SEQONIC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) Sequencer switch-off phase 4 time and current
                                                                    control                                                    */
    
