popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t T4OFF      : 6;            /*!< [5..0] Sequencer switch-off phase 4 time setting for all drivers          */
            uint32_t            : 10;
      __IOM uint32_t I4OFF      : 6;            /*!< [21..16] Sequencer switch-off phase 4 current setting for all
                                                     drivers                                                                   */
            uint32_t            : 10;
    } bit;
  } SEQOFFT4I4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000DC) High-current discharge mode control                        */
    
    struct {
      __IOM uint32_t IHCDIS     : 6;            /*!< [5..0] High-current discharge mode current setting for all drivers        */
            uint32_t            : 10;
      __IOM uint32_t HCDIS_SSO  : 1;            /*!< [16..16] High-current discharge mode with safe switch-off                 */
            uint32_t            : 15;
    } bit;
  } HCDIS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) Half bridge 1 switch-on measurement values                 */
    
    struct {
      __IM  uint32_t HB1_TONDLY : 8;            /*!< [7..0] Half bridge 1 switch-on delay time value measured until
                                                     VSH voltage starts to change                                              */
      __IM  uint32_t HB1_I1ONVAL : 6;           /*!< [13..8] Half bridge 1 switch-on phase 1 current setting from
                                                     adaptive sequencer                                                        */
            uint32_t            : 2;
      __IM  uint32_t HB1_TONDUR : 6;            /*!< [21..16] Half bridge 1 switch-on voltage slope duration time
                                                     value                                                                     */
      __IM  uint32_t HB1_TONDURMERR : 1;        /*!< [22..22] Half bridge 1 switch-on voltage slope time measurement
                                                     error                                                                     */
            uint32_t            : 5;
      __IM  uint32_t HB1_ACTDRV_ON : 1;         /*!< [28..28] Half bridge 1 switch-on active driver                            */
      __IOM uint32_t HB1_ONVALVF : 1;           /*!< [29..29] Half bridge 1 switch-on measurement values valid flag            */
      __OM  uint32_t HB1_ONVALVF_CLR : 1;       /*!< [30..30] Half bridge 1 switch-on measurement values valid flag
                                                     clear                                                                     */
      __OM  uint32_t HB1_ONVALVF_SET : 1;       /*!< [31..31] Half bridge 1 switch-on measurement values valid flag
                                                     set                                                                       */
    } bit;
  } HB1ONVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E4) Half bridge 1 switch-off measurement values                */
    
    struct {
      __IM  uint32_t HB1_TOFFDLY : 8;           /*!< [7..0] Half bridge 1 switch-off delay time value measured until
                                                     VSH voltage starts to change                                              */
      __IM  uint32_t HB1_I1OFFVAL : 6;          /*!< [13..8] Half bridge 1 switch-off phase 1 current setting from
                                                     adaptive sequencer                                                        */
            uint32_t            : 2;
      __IM  uint32_t HB1_TOFFDUR : 6;           /*!< [21..16] Half bridge 1 switch-off voltage slope duration time
                                                     value                                                                     */
      __IM  uint32_t HB1_TOFFDURMERR : 1;       /*!< [22..22] Half bridge 1 switch-off voltage slope time measurement
                                                     error                                                                     */
            uint32_t            : 5;
      __IM  uint32_t HB1_ACTDRV_OFF : 1;        /*!< [28..28] Half bridge 1 switch-off active driver                           */
      __IOM uint32_t HB1_OFFVALVF : 1;          /*!< [29..29] Half bridge 1 switch-off measurement values valid flag           */
      __OM  uint32_t HB1_OFFVALVF_CLR : 1;      /*!< [30..30] Half bridge 1 switch-off measurement values valid flag
                                                     clear                                                                     */
      __OM  uint32_t HB1_OFFVALVF_SET : 1;      /*!< [31..31] Half bridge 1 switch-off measurement values valid flag
                                                     set                                                                       */
    } bit;
  } HB1OFFVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E8) Half bridge 2 switch-on measurement values                 */
    
    struct {
      __IM  uint32_t HB2_TONDLY : 8;            /*!< [7..0] Half bridge 2 switch-on delay time value measured until
                                                     VSH voltage starts to change                                              */
      __IM  uint32_t HB2_I1ONVAL : 6;           /*!< [13..8] Half bridge 2 switch-on phase 1 current setting from
                                                     adaptive sequencer                                                        */
            uint32_t            : 2;
      __IM  uint32_t HB2_TONDUR : 6;            /*!< [21..16] Half bridge 2 switch-on voltage slope duration time
                                                     value                                                                     */
      __IM  uint32_t HB2_TONDURMERR : 1;        /*!< [22..22] Half bridge 2 switch-on voltage slope time measurement
                                                     error                                                                     */
            uint32_t            : 5;
      __IM  uint32_t HB2_ACTDRV_ON : 1;         /*!< [28..28] Half bridge 2 switch-on active driver                            */
      __IOM uint32_t HB2_ONVALVF : 1;           /*!< [29..29] Half bridge 2 switch-on measurement values valid flag            */
      __OM  uint32_t HB2_ONVALVF_CLR : 1;       /*!< [30..30] Half bridge 2 switch-on measurement values valid flag
                                                     clear                                                                     */
      __OM  uint32_t HB2_ONVALVF_SET : 1;       /*!< [31..31] Half bridge 2 switch-on measurement values valid flag
                                                     set                                                                       */
    } bit;
  } HB2ONVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000EC) Half bridge 2 switch-off measurement values                */
    
