popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t HB2_TOFFDLY : 8;           /*!< [7..0] Half bridge 2 switch-off delay time value measured until
                                                     VSH voltage starts to change                                              */
      __IM  uint32_t HB2_I1OFFVAL : 6;          /*!< [13..8] Half bridge 2 switch-off phase 1 current setting from
                                                     adaptive sequencer                                                        */
            uint32_t            : 2;
      __IM  uint32_t HB2_TOFFDUR : 6;           /*!< [21..16] Half bridge 2 switch-off voltage slope duration time
                                                     value                                                                     */
      __IM  uint32_t HB2_TOFFDURMERR : 1;       /*!< [22..22] Half bridge 2 switch-off voltage slope time measurement
                                                     error                                                                     */
            uint32_t            : 5;
      __IM  uint32_t HB2_ACTDRV_OFF : 1;        /*!< [28..28] Half bridge 2 switch-off active driver                           */
      __IOM uint32_t HB2_OFFVALVF : 1;          /*!< [29..29] Half bridge 2 switch-off measurement values valid flag           */
      __OM  uint32_t HB2_OFFVALVF_CLR : 1;      /*!< [30..30] Half bridge 2 switch-off measurement values valid flag
                                                     clear                                                                     */
      __OM  uint32_t HB2_OFFVALVF_SET : 1;      /*!< [31..31] Half bridge 2 switch-off measurement values valid flag
                                                     set                                                                       */
    } bit;
  } HB2OFFVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) Half bridge 3 switch-on measurement values                 */
    
    struct {
      __IM  uint32_t HB3_TONDLY : 8;            /*!< [7..0] Half bridge 3 switch-on delay time value measured until
                                                     VSH voltage starts to change                                              */
      __IM  uint32_t HB3_I1ONVAL : 6;           /*!< [13..8] Half bridge 3 switch-on phase 1 current setting from
                                                     adaptive sequencer                                                        */
            uint32_t            : 2;
      __IM  uint32_t HB3_TONDUR : 6;            /*!< [21..16] Half bridge 3 switch-on voltage slope duration time
                                                     value                                                                     */
      __IM  uint32_t HB3_TONDURMERR : 1;        /*!< [22..22] Half bridge 3 switch-on voltage slope time measurement
                                                     error                                                                     */
            uint32_t            : 5;
      __IM  uint32_t HB3_ACTDRV_ON : 1;         /*!< [28..28] Half bridge 3 switch-on active driver                            */
      __IOM uint32_t HB3_ONVALVF : 1;           /*!< [29..29] Half bridge 3 switch-on measurement values valid flag            */
      __OM  uint32_t HB3_ONVALVF_CLR : 1;       /*!< [30..30] Half bridge 3 switch-on measurement values valid flag
                                                     clear                                                                     */
      __OM  uint32_t HB3_ONVALVF_SET : 1;       /*!< [31..31] Half bridge 3 switch-on measurement values valid flag
                                                     set                                                                       */
    } bit;
  } HB3ONVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F4) Half bridge 3 switch-off measurement values                */
    
    struct {
      __IM  uint32_t HB3_TOFFDLY : 8;           /*!< [7..0] Half bridge 3 switch-off delay time value measured until
                                                     VSH voltage starts to change                                              */
      __IM  uint32_t HB3_I1OFFVAL : 6;          /*!< [13..8] Half bridge 3 switch-off phase 1 current setting from
                                                     adaptive sequencer                                                        */
            uint32_t            : 2;
      __IM  uint32_t HB3_TOFFDUR : 6;           /*!< [21..16] Half bridge 3 switch-off voltage slope duration time
                                                     value                                                                     */
      __IM  uint32_t HB3_TOFFDURMERR : 1;       /*!< [22..22] Half bridge 3 switch-off voltage slope time measurement
                                                     error                                                                     */
            uint32_t            : 5;
      __IM  uint32_t HB3_ACTDRV_OFF : 1;        /*!< [28..28] Half bridge 3 switch-off active driver                           */
      __IOM uint32_t HB3_OFFVALVF : 1;          /*!< [29..29] Half bridge 3 switch-off measurement values valid flag           */
      __OM  uint32_t HB3_OFFVALVF_CLR : 1;      /*!< [30..30] Half bridge 3 switch-off measurement values valid flag
                                                     clear                                                                     */
      __OM  uint32_t HB3_OFFVALVF_SET : 1;      /*!< [31..31] Half bridge 3 switch-off measurement values valid flag
                                                     set                                                                       */
    } bit;
  } HB3OFFVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F8) Adaptive sequencer control                                 */
    
    struct {
      __IOM uint32_t HB1ASMONEN : 1;            /*!< [0..0] Half bridge 1 adaptive sequencer for switch-on                     */
      __IOM uint32_t HB1ASMOFFEN : 1;           /*!< [1..1] Half bridge 1 adaptive sequencer for switch-off                    */
            uint32_t            : 4;
      __IOM uint32_t HB1ONHYSTEN : 1;           /*!< [6..6] Half bridge 1 optimizer hysteresis for switch-on                   */
      __IOM uint32_t HB1OFFHYSTEN : 1;          /*!< [7..7] Half bridge 1 optimizer hysteresis for switch-off                  */
      __IOM uint32_t HB2ASMONEN : 1;            /*!< [8..8] Half bridge 2 adaptive sequencer for switch-on                     */
      __IOM uint32_t HB2ASMOFFEN : 1;           /*!< [9..9] Half bridge 2 adaptive sequencer for switch-off                    */
            uint32_t            : 4;
      __IOM uint32_t HB2ONHYSTEN : 1;           /*!< [14..14] Half bridge 2 optimizer hysteresis for switch-on                 */
      __IOM uint32_t HB2OFFHYSTEN : 1;          /*!< [15..15] Half bridge 2 optimizer hysteresis for switch-off                */
      __IOM uint32_t HB3ASMONEN : 1;            /*!< [16..16] Half bridge 3 adaptive sequencer for switch-on                   */
      __IOM uint32_t HB3ASMOFFEN : 1;           /*!< [17..17] Half bridge 3 adaptive sequencer for switch-off                  */
            uint32_t            : 4;
      __IOM uint32_t HB3ONHYSTEN : 1;           /*!< [22..22] Half bridge 3 optimizer hysteresis for switch-on                 */
      __IOM uint32_t HB3OFFHYSTEN : 1;          /*!< [23..23] Half bridge 3 optimizer hysteresis for switch-off                */
            uint32_t            : 8;
    } bit;
  } ASEQC;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000FC) Adaptive sequencer switch-on status                        */
    
