popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t HB1T12ONMAX : 1;           /*!< [0..0] Half bridge 1 max T12ON value reached                              */
      __IM  uint32_t HB1I1ONMAX : 1;            /*!< [1..1] Half bridge 1 max I1ON value reached                               */
      __IM  uint32_t HB1T12ONMIN : 1;           /*!< [2..2] Half bridge 1 min T12ON value reached                              */
      __IM  uint32_t HB1I1ONMIN : 1;            /*!< [3..3] Half bridge 1 min I1ON value reached                               */
      __IM  uint32_t HB1ONMF    : 1;            /*!< [4..4] Half bridge 1 adaptive sequencer switch-on measurement
                                                     failure                                                                   */
            uint32_t            : 2;
      __IM  uint32_t HB1ONFAILDRV : 1;          /*!< [7..7] Half bridge 1 switch-on failed gate driver                         */
      __IM  uint32_t HB2T12ONMAX : 1;           /*!< [8..8] Half bridge 2 max T12ON value reached                              */
      __IM  uint32_t HB2I1ONMAX : 1;            /*!< [9..9] Half bridge 2 max I1ON value reached                               */
      __IM  uint32_t HB2T12ONMIN : 1;           /*!< [10..10] Half bridge 2 min T12ON value reached                            */
      __IM  uint32_t HB2I1ONMIN : 1;            /*!< [11..11] Half bridge 2 min I1ON value reached                             */
      __IM  uint32_t HB2ONMF    : 1;            /*!< [12..12] Half bridge 2 adaptive sequencer switch-on measurement
                                                     failure                                                                   */
            uint32_t            : 2;
      __IM  uint32_t HB2ONFAILDRV : 1;          /*!< [15..15] Half bridge 2 switch-on failed gate driver                       */
      __IM  uint32_t HB3T12ONMAX : 1;           /*!< [16..16] Half bridge 3 max T12ON value reached                            */
      __IM  uint32_t HB3I1ONMAX : 1;            /*!< [17..17] Half bridge 3 max I1ON value reached                             */
      __IM  uint32_t HB3T12ONMIN : 1;           /*!< [18..18] Half bridge 3 min T12ON value reached                            */
      __IM  uint32_t HB3I1ONMIN : 1;            /*!< [19..19] Half bridge 3 min I1ON value reached                             */
      __IM  uint32_t HB3ONMF    : 1;            /*!< [20..20] Half bridge 3 adaptive sequencer switch-on measurement
                                                     failure                                                                   */
            uint32_t            : 2;
      __IM  uint32_t HB3ONFAILDRV : 1;          /*!< [23..23] Half bridge 3 switch-on failed gate driver                       */
            uint32_t            : 8;
    } bit;
  } ASEQONSTS;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000100) Adaptive sequencer switch-off status                       */
    
    struct {
      __IM  uint32_t HB1T1OFFMAX : 1;           /*!< [0..0] Half bridge 1 max T1OFF value reached                              */
      __IM  uint32_t HB1I1OFFMAX : 1;           /*!< [1..1] Half bridge 1 max I1OFF value reached                              */
      __IM  uint32_t HB1T1OFFMIN : 1;           /*!< [2..2] Half bridge 1 min T1OFF value reached                              */
      __IM  uint32_t HB1I1OFFMIN : 1;           /*!< [3..3] Half bridge 1 min I1OFF value reached                              */
      __IM  uint32_t HB1OFFMF   : 1;            /*!< [4..4] Half bridge 1 adaptive sequencer switch-off measurement
                                                     failure                                                                   */
            uint32_t            : 2;
      __IM  uint32_t HB1OFFFAILDRV : 1;         /*!< [7..7] Half bridge 1 switch-off failed gate driver                        */
      __IM  uint32_t HB2T1OFFMAX : 1;           /*!< [8..8] Half bridge 2 max T1OFF value reached                              */
      __IM  uint32_t HB2I1OFFMAX : 1;           /*!< [9..9] Half bridge 2 max I1OFF value reached                              */
      __IM  uint32_t HB2T1OFFMIN : 1;           /*!< [10..10] Half bridge 2 min T1OFF value reached                            */
      __IM  uint32_t HB2I1OFFMIN : 1;           /*!< [11..11] Half bridge 2 min I1OFF value reached                            */
      __IM  uint32_t HB2OFFMF   : 1;            /*!< [12..12] Half bridge 2 adaptive sequencer switch-off measurement
                                                     failure                                                                   */
            uint32_t            : 2;
      __IM  uint32_t HB2OFFFAILDRV : 1;         /*!< [15..15] Half bridge 2 switch-off failed gate driver                      */
      __IM  uint32_t HB3T1OFFMAX : 1;           /*!< [16..16] Half bridge 3 max T1OFF value reached                            */
      __IM  uint32_t HB3I1OFFMAX : 1;           /*!< [17..17] Half bridge 3 max I1OFF value reached                            */
      __IM  uint32_t HB3T1OFFMIN : 1;           /*!< [18..18] Half bridge 3 min T1OFF value reached                            */
      __IM  uint32_t HB3I1OFFMIN : 1;           /*!< [19..19] Half bridge 3 min I1OFF value reached                            */
      __IM  uint32_t HB3OFFMF   : 1;            /*!< [20..20] Half bridge 3 adaptive sequencer switch-off measurement
                                                     failure                                                                   */
            uint32_t            : 2;
      __IM  uint32_t HB3OFFFAILDRV : 1;         /*!< [23..23] Half bridge 3 switch-off failed gate driver                      */
            uint32_t            : 8;
    } bit;
  } ASEQOFFSTS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000104) Adaptive sequencer error counter control                   */
    
