popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t HB1T1OFFERRCNT : 2;        /*!< [1..0] Half bridge 1 T1OFF error counter setting                          */
      __IOM uint32_t HB1T12ONERRCNT : 2;        /*!< [3..2] Half bridge 1 T12ON error counter setting                          */
      __IOM uint32_t HB1MFERRCNT : 2;           /*!< [5..4] Half bridge 1 measurement failure error counter setting            */
            uint32_t            : 2;
      __IOM uint32_t HB2T1OFFERRCNT : 2;        /*!< [9..8] Half bridge 2 T1OFF error counter setting                          */
      __IOM uint32_t HB2T12ONERRCNT : 2;        /*!< [11..10] Half bridge 2 T12ON error counter setting                        */
      __IOM uint32_t HB2MFERRCNT : 2;           /*!< [13..12] Half bridge 2 measurement failure error counter setting          */
            uint32_t            : 2;
      __IOM uint32_t HB3T1OFFERRCNT : 2;        /*!< [17..16] Half bridge 3 T1OFF error counter setting                        */
      __IOM uint32_t HB3T12ONERRCNT : 2;        /*!< [19..18] Half bridge 3 T12ON error counter setting                        */
      __IOM uint32_t HB3MFERRCNT : 2;           /*!< [21..20] Half bridge 3 measurement failure error counter setting          */
            uint32_t            : 10;
    } bit;
  } ASEQERRCNT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000108) Adaptive sequencer minimum switch-on time setting          */
    
    struct {
      __IOM uint32_t T12ONMIN   : 8;            /*!< [7..0] Switch-on phases 1 and 2 minimum time setting                      */
            uint32_t            : 24;
    } bit;
  } ASEQONTMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000010C) Adaptive sequencer minimum switch-off time setting         */
    
    struct {
      __IOM uint32_t T1OFFMIN   : 8;            /*!< [7..0] Switch-off phase 1 minimum time setting                            */
            uint32_t            : 24;
    } bit;
  } ASEQOFFTMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000110) Adaptive sequencer minimum switch-on current
                                                                    setting                                                    */
    
    struct {
      __IOM uint32_t I1ONMIN    : 6;            /*!< [5..0] Switch-on phase 1 minimum current setting                          */
            uint32_t            : 26;
    } bit;
  } ASEQONIMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000114) Adaptive sequencer minimum switch-off current
                                                                    setting                                                    */
    
    struct {
      __IOM uint32_t I1OFFMIN   : 6;            /*!< [5..0] Switch-off phase 1 minimum current setting                         */
            uint32_t            : 26;
    } bit;
  } ASEQOFFIMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000118) Adaptive sequencer maximum switch-on time setting          */
    
    struct {
      __IOM uint32_t T12ONMAX   : 8;            /*!< [7..0] Switch-on phases 1 and 2 maximum time setting                      */
            uint32_t            : 24;
    } bit;
  } ASEQONTMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000011C) Adaptive sequencer maximum switch-off time setting         */
    
    struct {
      __IOM uint32_t T1OFFMAX   : 8;            /*!< [7..0] Switch-off phase 1 maximum time setting                            */
            uint32_t            : 24;
    } bit;
  } ASEQOFFTMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000120) Adaptive sequencer maximum switch-on current
                                                                    setting                                                    */
    
    struct {
      __IOM uint32_t I1ONMAX    : 6;            /*!< [5..0] Switch-on phase 1 maximum current setting                          */
            uint32_t            : 26;
    } bit;
  } ASEQONIMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000124) Adaptive sequencer maximum switch-off current
                                                                    setting                                                    */
    
    struct {
      __IOM uint32_t I1OFFMAX   : 6;            /*!< [5..0] Switch-off phase 1 maximum current setting                         */
            uint32_t            : 26;
    } bit;
  } ASEQOFFIMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000128) Adaptive sequencer additional switch-off delay
                                                                    setting                                                    */
    
    struct {
      __IOM uint32_t LS1T1OFFADDDLY : 4;        /*!< [3..0] Low-side driver 1 adaptive sequencer T1OFF additional
                                                     delay setting                                                             */
      __IOM uint32_t HS1T1OFFADDDLY : 4;        /*!< [7..4] High-side driver 1 adaptive sequencer T1OFF additional
                                                     delay setting                                                             */
      __IOM uint32_t LS2T1OFFADDDLY : 4;        /*!< [11..8] Low-side driver 2 adaptive sequencer T1OFF additional
                                                     delay setting                                                             */
      __IOM uint32_t HS2T1OFFADDDLY : 4;        /*!< [15..12] High-side driver 2 adaptive sequencer T1OFF additional
                                                     delay setting                                                             */
      __IOM uint32_t LS3T1OFFADDDLY : 4;        /*!< [19..16] Low-side driver 3 adaptive sequencer T1OFF additional
                                                     delay setting                                                             */
      __IOM uint32_t HS3T1OFFADDDLY : 4;        /*!< [23..20] High-side driver 3 adaptive sequencer T1OFF additional
                                                     delay setting                                                             */
            uint32_t            : 8;
    } bit;
  } ASEQOFFADDDLY;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000012C) BEMF comparator control and status                         */
    
