popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t PH1_COMP_EN : 1;           /*!< [0..0] Phase 1 comparator enable                                          */
      __IOM uint32_t PH2_COMP_EN : 1;           /*!< [1..1] Phase 2 comparator enable                                          */
      __IOM uint32_t PH3_COMP_EN : 1;           /*!< [2..2] Phase 3 comparator enable                                          */
            uint32_t            : 1;
      __IOM uint32_t PH1_COMP_DIS_SET : 1;      /*!< [4..4] Phase 1 comparator output status value if disabled                 */
      __IOM uint32_t PH2_COMP_DIS_SET : 1;      /*!< [5..5] Phase 2 comparator output status value if disabled                 */
      __IOM uint32_t PH3_COMP_DIS_SET : 1;      /*!< [6..6] Phase 3 comparator output status value if disabled                 */
            uint32_t            : 1;
      __IOM uint32_t CMP_TFILT_SEL : 2;         /*!< [9..8] Symmetrical spike filter time for BEMF comparators                 */
      __IOM uint32_t TBLNK_SEL  : 3;            /*!< [12..10] Blanking time for BEMF comparators                               */
      __IOM uint32_t DEMAG_FILT_BYP : 1;        /*!< [13..13] Demagnetisation filter bypass                                    */
      __IOM uint32_t BLNK_FILT_BYP : 1;         /*!< [14..14] Blanking time and demagnetisation filter bypass                  */
            uint32_t            : 1;
      __IOM uint32_t TRIG_SEL   : 2;            /*!< [17..16] Trigger output selector                                          */
            uint32_t            : 6;
      __IOM uint32_t SW_TRIG    : 1;            /*!< [24..24] Software trigger for output to timer                             */
      __IM  uint32_t PH1_ZC_STS : 1;            /*!< [25..25] Phase 1 zero crossing comparator status                          */
      __IM  uint32_t PH2_ZC_STS : 1;            /*!< [26..26] Phase 2 zero crossing comparator status                          */
      __IM  uint32_t PH3_ZC_STS : 1;            /*!< [27..27] Phase 3 zero crossing comparator status                          */
            uint32_t            : 4;
    } bit;
  } BEMFC_CTRL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000130) BEMF comparator interrupt status                           */
    
    struct {
      __IM  uint32_t PH1_ZCFALL_IS : 1;         /*!< [0..0] Phase 1 zero crossing falling interrupt status                     */
      __IM  uint32_t PH1_ZCRISE_IS : 1;         /*!< [1..1] Phase 1 zero crossing rising interrupt status                      */
      __IM  uint32_t PH2_ZCFALL_IS : 1;         /*!< [2..2] Phase 2 zero crossing falling interrupt status                     */
      __IM  uint32_t PH2_ZCRISE_IS : 1;         /*!< [3..3] Phase 2 zero crossing rising interrupt status                      */
      __IM  uint32_t PH3_ZCFALL_IS : 1;         /*!< [4..4] Phase 3 zero crossing falling interrupt status                     */
      __IM  uint32_t PH3_ZCRISE_IS : 1;         /*!< [5..5] Phase 3 zero crossing rising interrupt status                      */
            uint32_t            : 26;
    } bit;
  } BEMFC_IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000134) BEMF comparator interrupt status clear                     */
    
    struct {
      __OM  uint32_t PH1_ZCFALL_ISC : 1;        /*!< [0..0] Phase 1 zero crossing falling interrupt status clear               */
      __OM  uint32_t PH1_ZCRISE_ISC : 1;        /*!< [1..1] Phase 1 zero crossing rising interrupt status clear                */
      __OM  uint32_t PH2_ZCFALL_ISC : 1;        /*!< [2..2] Phase 2 zero crossing falling interrupt status clear               */
      __OM  uint32_t PH2_ZCRISE_ISC : 1;        /*!< [3..3] Phase 2 zero crossing rising interrupt status clear                */
      __OM  uint32_t PH3_ZCFALL_ISC : 1;        /*!< [4..4] Phase 3 zero crossing falling interrupt status clear               */
      __OM  uint32_t PH3_ZCRISE_ISC : 1;        /*!< [5..5] Phase 3 zero crossing rising interrupt status clear                */
            uint32_t            : 26;
    } bit;
  } BEMFC_IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000138) BEMF comparator interrupt status set                       */
    
    struct {
      __OM  uint32_t PH1_ZCFALL_ISS : 1;        /*!< [0..0] Phase 1 zero crossing falling interrupt status set                 */
      __OM  uint32_t PH1_ZCRISE_ISS : 1;        /*!< [1..1] Phase 1 zero crossing rising interrupt status set                  */
      __OM  uint32_t PH2_ZCFALL_ISS : 1;        /*!< [2..2] Phase 2 zero crossing falling interrupt status set                 */
      __OM  uint32_t PH2_ZCRISE_ISS : 1;        /*!< [3..3] Phase 2 zero crossing rising interrupt status set                  */
      __OM  uint32_t PH3_ZCFALL_ISS : 1;        /*!< [4..4] Phase 3 zero crossing falling interrupt status set                 */
      __OM  uint32_t PH3_ZCRISE_ISS : 1;        /*!< [5..5] Phase 3 zero crossing rising interrupt status set                  */
            uint32_t            : 26;
    } bit;
  } BEMFC_IRQSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000013C) BEMF comparator interrupt enable                           */
    
    struct {
      __IOM uint32_t PH1_ZCFALL_IEN : 1;        /*!< [0..0] Phase 1 zero crossing falling interrupt enable                     */
      __IOM uint32_t PH1_ZCRISE_IEN : 1;        /*!< [1..1] Phase 1 zero crossing rising interrupt enable                      */
      __IOM uint32_t PH2_ZCFALL_IEN : 1;        /*!< [2..2] Phase 2 zero crossing falling interrupt enable                     */
      __IOM uint32_t PH2_ZCRISE_IEN : 1;        /*!< [3..3] Phase 2 zero crossing rising interrupt enable                      */
      __IOM uint32_t PH3_ZCFALL_IEN : 1;        /*!< [4..4] Phase 3 zero crossing falling interrupt enable                     */
      __IOM uint32_t PH3_ZCRISE_IEN : 1;        /*!< [5..5] Phase 3 zero crossing rising interrupt enable                      */
            uint32_t            : 26;
    } bit;
  } BEMFC_IRQEN;
} BDRV_Type;                                    /*!< Size = 320 (0x140)                                                        */



/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CACHE (CACHE)
  */

typedef struct {                                /*!< (@ 0x48048000) CACHE Structure                                            */
  __IM  uint32_t  RESERVED[64];
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000100) Cache All Clean Register                                   */
    
