popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t Clean      : 32;           /*!< [31..0] Clean all valid blocks from the cache                             */
    } bit;
  } CACHE_AC;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000104) Cache Set Clean Register                                   */
    
    struct {
      __OM  uint32_t ADDR       : 32;           /*!< [31..0] Clean all valid blocks of one set at a specified address          */
    } bit;
  } CACHE_SC;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000114) Cache Block Touch Register                                 */
    
    struct {
      __OM  uint32_t ADDR       : 32;           /*!< [31..0] Load a memory block from a specified address into the
                                                     cache                                                                     */
    } bit;
  } CACHE_BT;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000118) Cache Block Lock Register                                  */
    
    struct {
      __OM  uint32_t ADDR       : 32;           /*!< [31..0] Lock a memory block from a specified address in the
                                                     cache                                                                     */
    } bit;
  } CACHE_BL;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000011C) Cache Block Unlock Register                                */
    
    struct {
      __OM  uint32_t ADDR       : 32;           /*!< [31..0] Unlock a memory block from a specified address                    */
    } bit;
  } CACHE_BU;
} CACHE_Type;                                   /*!< Size = 288 (0x120)                                                        */



/* =========================================================================================================================== */
/* ================                                          CANNODE                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN Node (CANNODE)
  */

typedef struct {                                /*!< (@ 0x48010000) CANNODE Structure                                          */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) CAN Clock Control Register                                 */
    
    struct {
      __IOM uint32_t DISR       : 1;            /*!< [0..0] Module Disable Request Bit                                         */
      __IM  uint32_t DISS       : 1;            /*!< [1..1] Module Disable Status Bit                                          */
            uint32_t            : 1;
      __IOM uint32_t EDIS       : 1;            /*!< [3..3] Sleep Mode Enable Control                                          */
            uint32_t            : 28;
    } bit;
  } CLC;
  __IM  uint32_t  RESERVED;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Module Identification Register                             */
    
    struct {
      __IM  uint32_t MOD_REV    : 8;            /*!< [7..0] Module Revision Number                                             */
      __IM  uint32_t MOD_TYPE   : 8;            /*!< [15..8] Module Type                                                       */
      __IM  uint32_t MOD_NUMBER : 16;           /*!< [31..16] Module Number Value                                              */
    } bit;
  } ID;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) CAN Fractional Divider Register                            */
    
    struct {
      __IOM uint32_t STEP       : 10;           /*!< [9..0] Step Value                                                         */
            uint32_t            : 4;
      __IOM uint32_t DM         : 2;            /*!< [15..14] Divider Mode                                                     */
            uint32_t            : 16;
    } bit;
  } FDR;
  __IM  uint32_t  RESERVED1[60];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000100) List Register 0                                            */
    
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000104) List Register 1                                            */
    
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000108) List Register 2                                            */
    
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000010C) List Register 3                                            */
    
