popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000110) List Register 4                                            */
    
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST4;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000114) List Register 5                                            */
    
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST5;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000118) List Register 6                                            */
    
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST6;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000011C) List Register 7                                            */
    
    struct {
      __IM  uint32_t BEGIN      : 8;            /*!< [7..0] List Begin                                                         */
      __IM  uint32_t END        : 8;            /*!< [15..8] List End                                                          */
      __IM  uint32_t SIZE       : 8;            /*!< [23..16] List Size                                                        */
      __IM  uint32_t EMPTY      : 1;            /*!< [24..24] List Empty Indication                                            */
            uint32_t            : 7;
    } bit;
  } LIST7;
  __IM  uint32_t  RESERVED2[8];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000140) Message Pending Register 0                                 */
    
    struct {
      __IOM uint32_t PND        : 32;           /*!< [31..0] Message Pending                                                   */
    } bit;
  } MSPND0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000144) Message Pending Register 1                                 */
    
    struct {
      __IOM uint32_t PND        : 32;           /*!< [31..0] Message Pending                                                   */
    } bit;
  } MSPND1;
  __IM  uint32_t  RESERVED3[14];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000180) Message Index Register 0                                   */
    
    struct {
      __IM  uint32_t INDEX      : 6;            /*!< [5..0] Message Pending Index                                              */
            uint32_t            : 26;
    } bit;
  } MSID0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000184) Message Index Register 1                                   */
    
    struct {
      __IM  uint32_t INDEX      : 6;            /*!< [5..0] Message Pending Index                                              */
            uint32_t            : 26;
    } bit;
  } MSID1;
  __IM  uint32_t  RESERVED4[14];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001C0) Message Index Mask Register                                */
    
    struct {
      __IOM uint32_t IM         : 32;           /*!< [31..0] Message Index Mask                                                */
    } bit;
  } MSIMASK;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001C4) Panel Control Register                                     */
    
    struct {
      __IOM uint32_t PANCMD     : 8;            /*!< [7..0] Panel Command                                                      */
      __IM  uint32_t BUSY       : 1;            /*!< [8..8] Panel Busy Flag                                                    */
      __IM  uint32_t RBUSY      : 1;            /*!< [9..9] Result Busy Flag                                                   */
            uint32_t            : 6;
      __IOM uint32_t PANAR1     : 8;            /*!< [23..16] Panel Argument 1                                                 */
      __IOM uint32_t PANAR2     : 8;            /*!< [31..24] Panel Argument 2                                                 */
    } bit;
  } PANCTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001C8) Module Control Register                                    */
    
