popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CLKSEL     : 4;            /*!< [3..0] Baud Rate Logic Clock Select                                       */
            uint32_t            : 8;
      __IOM uint32_t MPSEL      : 4;            /*!< [15..12] Message Pending Selector                                         */
            uint32_t            : 16;
    } bit;
  } MCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001CC) Module Interrupt Trigger Register                          */
    
    struct {
      __OM  uint32_t IT         : 8;            /*!< [7..0] Interrupt Trigger                                                  */
            uint32_t            : 24;
    } bit;
  } MITR;
  __IM  uint32_t  RESERVED5[12];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000200) Node 0 Control Register                                    */
    
    struct {
      __IOM uint32_t INIT       : 1;            /*!< [0..0] Node Initialization                                                */
      __IOM uint32_t TRIE       : 1;            /*!< [1..1] Transfer Interrupt Enable                                          */
      __IOM uint32_t LECIE      : 1;            /*!< [2..2] LEC Indicated Error Interrupt Enable                               */
      __IOM uint32_t ALIE       : 1;            /*!< [3..3] Alert Interrupt Enable                                             */
      __IOM uint32_t CANDIS     : 1;            /*!< [4..4] CAN Disable                                                        */
      __IOM uint32_t TXDIS      : 1;            /*!< [5..5] Transmit Disable                                                   */
      __IOM uint32_t CCE        : 1;            /*!< [6..6] Configuration Change Enable                                        */
      __IOM uint32_t CALM       : 1;            /*!< [7..7] CAN Analyzer Mode                                                  */
            uint32_t            : 1;
      __IOM uint32_t FDEN       : 1;            /*!< [9..9] CAN Flexible Data-Rate Enable                                      */
      __IOM uint32_t PED        : 1;            /*!< [10..10] Protocol Exeption Disable                                        */
            uint32_t            : 4;
      __IOM uint32_t NISO       : 1;            /*!< [15..15] Non ISO Operation                                                */
            uint32_t            : 16;
    } bit;
  } CAN_NCR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000204) Node 0 Status Register                                     */
    
    struct {
      __IOM uint32_t LEC        : 3;            /*!< [2..0] Last Error Code                                                    */
      __IOM uint32_t TXOK       : 1;            /*!< [3..3] Message Transmitted Successfully                                   */
      __IOM uint32_t RXOK       : 1;            /*!< [4..4] Message Received Successfully                                      */
      __IOM uint32_t ALERT      : 1;            /*!< [5..5] Alert Warning                                                      */
      __IM  uint32_t EWRN       : 1;            /*!< [6..6] Error Warning Status                                               */
      __IM  uint32_t BOFF       : 1;            /*!< [7..7] Bus-off Status                                                     */
      __IOM uint32_t LLE        : 1;            /*!< [8..8] List Length Error                                                  */
      __IOM uint32_t LOE        : 1;            /*!< [9..9] List Object Error                                                  */
            uint32_t            : 1;
      __IOM uint32_t RESI       : 1;            /*!< [11..11] Received Error State Indicator Flag                              */
      __IOM uint32_t FLEC       : 3;            /*!< [14..12] Fast Last Error Code                                             */
            uint32_t            : 17;
    } bit;
  } CAN_NSR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000208) Node 0 Interrupt Pointer Register                          */
    
    struct {
      __IOM uint32_t ALINP      : 4;            /*!< [3..0] Alert Interrupt Node Pointer                                       */
      __IOM uint32_t LECINP     : 4;            /*!< [7..4] Last Error Code Interrupt Node Pointer                             */
      __IOM uint32_t TRINP      : 4;            /*!< [11..8] Transfer OK Interrupt Node Pointer                                */
      __IOM uint32_t CFCINP     : 4;            /*!< [15..12] Frame Counter Interrupt Node Pointer                             */
            uint32_t            : 16;
    } bit;
  } CAN_NIPR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000020C) Node 0 Port Control Register                               */
    
    struct {
      __IOM uint32_t RXSEL      : 3;            /*!< [2..0] Receive Select                                                     */
            uint32_t            : 5;
      __IOM uint32_t LBM        : 1;            /*!< [8..8] Loop-Back Mode                                                     */
            uint32_t            : 23;
    } bit;
  } CAN_NPCR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000210) Node 0 Bit Timing Register                                 */
    
    struct {
      __IOM uint32_t BRP        : 6;            /*!< [5..0] Baud Rate Prescaler                                                */
      __IOM uint32_t SJW        : 2;            /*!< [7..6] (Re) Synchronization Jump Width                                    */
      __IOM uint32_t TSEG1      : 4;            /*!< [11..8] Time Segment Before Sample Point                                  */
      __IOM uint32_t TSEG2      : 3;            /*!< [14..12] Time Segment After Sample Point                                  */
      __IOM uint32_t DIV8       : 1;            /*!< [15..15] Divide Prescaler Clock by 8                                      */
            uint32_t            : 16;
    } bit;
  } CAN_NBTR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000214) Node 0 Error Counter Register                              */
    
