popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t REC        : 8;            /*!< [7..0] Receive Error Counter                                              */
      __IOM uint32_t TEC        : 8;            /*!< [15..8] Transmit Error Counter                                            */
      __IOM uint32_t EWRNLVL    : 8;            /*!< [23..16] Error Warning Level                                              */
      __IM  uint32_t LETD       : 1;            /*!< [24..24] Last Error Transfer Direction                                    */
      __IM  uint32_t LEINC      : 1;            /*!< [25..25] Last Error Increment                                             */
            uint32_t            : 6;
    } bit;
  } CAN_NECNT0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000218) Node 0 Frame Counter Register                              */
    
    struct {
      __IOM uint32_t CFC        : 16;           /*!< [15..0] CAN Frame Counter - CFC                                           */
      __IOM uint32_t CFSEL      : 3;            /*!< [18..16] CAN Frame Count Selection - CFSEL                                */
      __IOM uint32_t CFMOD      : 2;            /*!< [20..19] CAN Frame Counter Mode - CFMOD                                   */
            uint32_t            : 1;
      __IOM uint32_t CFCIE      : 1;            /*!< [22..22] CAN Frame Count Interrupt Enable - CFCIE                         */
      __IOM uint32_t CFCOV      : 1;            /*!< [23..23] CAN Frame Counter Overflow Flag - CFCOV                          */
            uint32_t            : 8;
    } bit;
  } CAN_NFCR0;
} CANNODE_Type;                                 /*!< Size = 540 (0x21c)                                                        */



/* =========================================================================================================================== */
/* ================                                         CANNODEFD                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN Node FD (CANNODEFD)
  */

typedef struct {                                /*!< (@ 0x48010010) CANNODEFD Structure                                        */
  __IM  uint32_t  RESERVED[128];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000200) Node 0 Bit Timing Extended View Register                   */
    
    struct {
      __IOM uint32_t BRP        : 6;            /*!< [5..0] Baud Rate Prescaler                                                */
            uint32_t            : 2;
      __IOM uint32_t SJW        : 4;            /*!< [11..8] (Re) Synchronization Jump Width                                   */
            uint32_t            : 3;
      __IOM uint32_t DIV8       : 1;            /*!< [15..15] Divide Prescaler Clock by 8                                      */
      __IOM uint32_t TSEG2      : 5;            /*!< [20..16] Time Segment After Sample Point                                  */
            uint32_t            : 1;
      __IOM uint32_t TSEG1      : 6;            /*!< [27..22] Time Segment Before Sample Point                                 */
            uint32_t            : 4;
    } bit;
  } CAN_NBTEVR0;
  __IM  uint32_t  RESERVED1[9];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000228) Fast Node 0 Bit Timing Register                            */
    
    struct {
      __IOM uint32_t FBRP       : 6;            /*!< [5..0] Fast Baud Rate Prescaler                                           */
      __IOM uint32_t FSJW       : 2;            /*!< [7..6] Fast (Re) Synchronization Jump Width                               */
      __IOM uint32_t FTSEG1     : 4;            /*!< [11..8] Fast Time Segment Before Sample Point                             */
      __IOM uint32_t FTSEG2     : 3;            /*!< [14..12] Fast Time Segment After Sample Point                             */
            uint32_t            : 17;
    } bit;
  } CAN_FNBTR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000022C) Node 0 Transmitter Delay Compensation Register             */
    
    struct {
      __IM  uint32_t TDCV       : 6;            /*!< [5..0] Transmitter Delay Compensation Value                               */
            uint32_t            : 2;
      __IOM uint32_t TDCO       : 4;            /*!< [11..8] Transmitter Delay Compensation Offset                             */
            uint32_t            : 3;
      __IOM uint32_t TDC        : 1;            /*!< [15..15] Transmitter Delay Compensation Enable                            */
            uint32_t            : 16;
    } bit;
  } CAN_NTDCR0;
} CANNODEFD_Type;                               /*!< Size = 560 (0x230)                                                        */



/* =========================================================================================================================== */
/* ================                                        CANMSGOBJ0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN Message Object 0 (CANMSGOBJ0)
  */

typedef struct {                                /*!< (@ 0x48010100) CANMSGOBJ0 Structure                                       */
  __IM  uint32_t  RESERVED[960];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F00) Message Object 0 Function Control Register                 */
    
    struct {
      __IOM uint32_t MMC        : 4;            /*!< [3..0] Message Mode Control                                               */
            uint32_t            : 1;
      __IOM uint32_t BRS        : 1;            /*!< [5..5] Bit Rate Switch                                                    */
      __IOM uint32_t FDF        : 1;            /*!< [6..6] CAN FD Frame Format                                                */
            uint32_t            : 1;
      __IOM uint32_t GDFS       : 1;            /*!< [8..8] Gateway Data Frame Send                                            */
      __IOM uint32_t IDC        : 1;            /*!< [9..9] Identifier Copy                                                    */
      __IOM uint32_t DLCC       : 1;            /*!< [10..10] Data Length Code Copy                                            */
      __IOM uint32_t DATC       : 1;            /*!< [11..11] Data Copy                                                        */
            uint32_t            : 4;
      __IOM uint32_t RXIE       : 1;            /*!< [16..16] Receive Interrupt Enable                                         */
      __IOM uint32_t TXIE       : 1;            /*!< [17..17] Transmit Interrupt Enable                                        */
      __IOM uint32_t OVIE       : 1;            /*!< [18..18] Overflow Interrupt Enable                                        */
            uint32_t            : 1;
      __IOM uint32_t FRREN      : 1;            /*!< [20..20] Foreign Remote Request Enable                                    */
      __IOM uint32_t RMM        : 1;            /*!< [21..21] Transmit Object Remote Monitoring                                */
      __IOM uint32_t SDT        : 1;            /*!< [22..22] Single Data Transfer                                             */
      __IOM uint32_t STT        : 1;            /*!< [23..23] Single Transmit Trial                                            */
      __IOM uint32_t DLC        : 4;            /*!< [27..24] Data Length Code                                                 */
            uint32_t            : 4;
    } bit;
  } CAN_MOFCR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F04) Message Object 0 FIFO/Gateway Pointer Register             */
    
