popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t BOT        : 8;            /*!< [7..0] Bottom Pointer                                                     */
      __IOM uint32_t TOP        : 8;            /*!< [15..8] Top Pointer                                                       */
      __IOM uint32_t CUR        : 8;            /*!< [23..16] Current Object Pointer                                           */
      __IOM uint32_t SEL        : 8;            /*!< [31..24] Object Select Pointer                                            */
    } bit;
  } CAN_MOFGPR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F08) Message Object 0 Interrupt Pointer Register                */
    
    struct {
      __IOM uint32_t RXINP      : 4;            /*!< [3..0] Receive Interrupt Node Pointer                                     */
      __IOM uint32_t TXINP      : 4;            /*!< [7..4] Transmit Interrupt Node Pointer                                    */
      __IOM uint32_t MPN        : 8;            /*!< [15..8] Message Pending Number                                            */
      __IOM uint32_t CFCVAL     : 16;           /*!< [31..16] CAN Frame Counter Value                                          */
    } bit;
  } CAN_MOIPR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F0C) Message Object 0 Acceptance Mask Register                  */
    
    struct {
      __IOM uint32_t AM         : 29;           /*!< [28..0] Acceptance Mask for Message Identifier                            */
      __IOM uint32_t MIDE       : 1;            /*!< [29..29] Acceptance Mask Bit for Message IDE Bit                          */
            uint32_t            : 2;
    } bit;
  } CAN_MOAMR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F10) Message Object 0 Data Register Low                         */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_MODATAL0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F14) Message Object 0 Data Register High                        */
    
    struct {
      __IOM uint32_t DB4        : 8;            /*!< [7..0] Data Byte 4 of Message Object n                                    */
      __IOM uint32_t DB5        : 8;            /*!< [15..8] Data Byte 5 of Message Object n                                   */
      __IOM uint32_t DB6        : 8;            /*!< [23..16] Data Byte 6 of Message Object n                                  */
      __IOM uint32_t DB7        : 8;            /*!< [31..24] Data Byte 7 of Message Object n                                  */
    } bit;
  } CAN_MODATAH0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F18) Message Object 0 Arbitration Register                      */
    
    struct {
      __IOM uint32_t ID         : 29;           /*!< [28..0] CAN Identifier of Message Object n                                */
      __IOM uint32_t IDE        : 1;            /*!< [29..29] Identifier Extension Bit of Message Object n                     */
      __IOM uint32_t PRI        : 2;            /*!< [31..30] Priority Class                                                   */
    } bit;
  } CAN_MOAR0;
  
  union {
    union {
      __OM  uint32_t reg;                       /*!< (@ 0x00000F1C) Message Object 0 Control Register                          */
      
      struct {
        __OM  uint32_t RESRXPND : 1;            /*!< [0..0] Reset Receive Pending                                              */
        __OM  uint32_t RESTXPND : 1;            /*!< [1..1] Reset Transmit Pending                                             */
        __OM  uint32_t RESRXUPD : 1;            /*!< [2..2] Reset Receive Updating                                             */
        __OM  uint32_t RESNEWDAT : 1;           /*!< [3..3] Reset New Data                                                     */
        __OM  uint32_t RESMSGLST : 1;           /*!< [4..4] Reset Message Lost                                                 */
        __OM  uint32_t RESMSGVAL : 1;           /*!< [5..5] Reset Message Valid                                                */
        __OM  uint32_t RESRTSEL : 1;            /*!< [6..6] Reset Receive/Transmit Selected                                    */
        __OM  uint32_t RESRXEN  : 1;            /*!< [7..7] Reset Receive Enable                                               */
        __OM  uint32_t RESTXRQ  : 1;            /*!< [8..8] Reset Transmit Request                                             */
        __OM  uint32_t RESTXEN0 : 1;            /*!< [9..9] Reset Transmit Enable 0                                            */
        __OM  uint32_t RESTXEN1 : 1;            /*!< [10..10] Reset Transmit Enable 1                                          */
        __OM  uint32_t RESDIR_SETDIR : 1;       /*!< [11..11] Reset Message Direction                                          */
              uint32_t          : 4;
        __OM  uint32_t SETRXPND : 1;            /*!< [16..16] Set Receive Pending                                              */
        __OM  uint32_t SETTXPND : 1;            /*!< [17..17] Set Transmit Pending                                             */
        __OM  uint32_t SETRXUPD : 1;            /*!< [18..18] Set Receive Updating                                             */
        __OM  uint32_t SETNEWDAT : 1;           /*!< [19..19] Set New Data                                                     */
        __OM  uint32_t SETMSGLST : 1;           /*!< [20..20] Set Message Lost                                                 */
        __OM  uint32_t SETMSGVAL : 1;           /*!< [21..21] Set Message Valid                                                */
        __OM  uint32_t SETRTSEL : 1;            /*!< [22..22] Set Receive/Transmit Selected                                    */
        __OM  uint32_t SETRXEN  : 1;            /*!< [23..23] Set Receive Enable                                               */
        __OM  uint32_t SETTXRQ  : 1;            /*!< [24..24] Set Transmit Request                                             */
        __OM  uint32_t SETTXEN0 : 1;            /*!< [25..25] Set Transmit Enable 0                                            */
        __OM  uint32_t SETTXEN1 : 1;            /*!< [26..26] Set Transmit Enable 1                                            */
        __OM  uint32_t SETDIR   : 1;            /*!< [27..27] Set Message Direction                                            */
              uint32_t          : 4;
      } bit;
    } CAN_MOCTR0;
    
    union {
      __IM  uint32_t reg;                       /*!< (@ 0x00000F1C) Message Object 0 Status Register                           */
      
