popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_MODATAL4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F94) Message Object 4 Data Register High                        */
    
    struct {
      __IOM uint32_t DB4        : 8;            /*!< [7..0] Data Byte 4 of Message Object n                                    */
      __IOM uint32_t DB5        : 8;            /*!< [15..8] Data Byte 5 of Message Object n                                   */
      __IOM uint32_t DB6        : 8;            /*!< [23..16] Data Byte 6 of Message Object n                                  */
      __IOM uint32_t DB7        : 8;            /*!< [31..24] Data Byte 7 of Message Object n                                  */
    } bit;
  } CAN_MODATAH4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F98) Message Object 4 Arbitration Register                      */
    
    struct {
      __IOM uint32_t ID         : 29;           /*!< [28..0] CAN Identifier of Message Object n                                */
      __IOM uint32_t IDE        : 1;            /*!< [29..29] Identifier Extension Bit of Message Object n                     */
      __IOM uint32_t PRI        : 2;            /*!< [31..30] Priority Class                                                   */
    } bit;
  } CAN_MOAR4;
  
  union {
    union {
      __OM  uint32_t reg;                       /*!< (@ 0x00000F9C) Message Object 4 Control Register                          */
      
      struct {
        __OM  uint32_t RESRXPND : 1;            /*!< [0..0] Reset Receive Pending                                              */
        __OM  uint32_t RESTXPND : 1;            /*!< [1..1] Reset Transmit Pending                                             */
        __OM  uint32_t RESRXUPD : 1;            /*!< [2..2] Reset Receive Updating                                             */
        __OM  uint32_t RESNEWDAT : 1;           /*!< [3..3] Reset New Data                                                     */
        __OM  uint32_t RESMSGLST : 1;           /*!< [4..4] Reset Message Lost                                                 */
        __OM  uint32_t RESMSGVAL : 1;           /*!< [5..5] Reset Message Valid                                                */
        __OM  uint32_t RESRTSEL : 1;            /*!< [6..6] Reset Receive/Transmit Selected                                    */
        __OM  uint32_t RESRXEN  : 1;            /*!< [7..7] Reset Receive Enable                                               */
        __OM  uint32_t RESTXRQ  : 1;            /*!< [8..8] Reset Transmit Request                                             */
        __OM  uint32_t RESTXEN0 : 1;            /*!< [9..9] Reset Transmit Enable 0                                            */
        __OM  uint32_t RESTXEN1 : 1;            /*!< [10..10] Reset Transmit Enable 1                                          */
        __OM  uint32_t RESDIR_SETDIR : 1;       /*!< [11..11] Reset Message Direction                                          */
              uint32_t          : 4;
        __OM  uint32_t SETRXPND : 1;            /*!< [16..16] Set Receive Pending                                              */
        __OM  uint32_t SETTXPND : 1;            /*!< [17..17] Set Transmit Pending                                             */
        __OM  uint32_t SETRXUPD : 1;            /*!< [18..18] Set Receive Updating                                             */
        __OM  uint32_t SETNEWDAT : 1;           /*!< [19..19] Set New Data                                                     */
        __OM  uint32_t SETMSGLST : 1;           /*!< [20..20] Set Message Lost                                                 */
        __OM  uint32_t SETMSGVAL : 1;           /*!< [21..21] Set Message Valid                                                */
        __OM  uint32_t SETRTSEL : 1;            /*!< [22..22] Set Receive/Transmit Selected                                    */
        __OM  uint32_t SETRXEN  : 1;            /*!< [23..23] Set Receive Enable                                               */
        __OM  uint32_t SETTXRQ  : 1;            /*!< [24..24] Set Transmit Request                                             */
        __OM  uint32_t SETTXEN0 : 1;            /*!< [25..25] Set Transmit Enable 0                                            */
        __OM  uint32_t SETTXEN1 : 1;            /*!< [26..26] Set Transmit Enable 1                                            */
        __OM  uint32_t SETDIR   : 1;            /*!< [27..27] Set Message Direction                                            */
              uint32_t          : 4;
      } bit;
    } CAN_MOCTR4;
    
    union {
      __IM  uint32_t reg;                       /*!< (@ 0x00000F9C) Message Object 4 Status Register                           */
      
      struct {
        __IM  uint32_t RXPND    : 1;            /*!< [0..0] Receive Pending                                                    */
        __IM  uint32_t TXPND    : 1;            /*!< [1..1] Transmit Pending                                                   */
        __IM  uint32_t RXUPD    : 1;            /*!< [2..2] Receive Updating                                                   */
        __IM  uint32_t NEWDAT   : 1;            /*!< [3..3] New Data                                                           */
        __IM  uint32_t MSGLST   : 1;            /*!< [4..4] Message Lost                                                       */
        __IM  uint32_t MSGVAL   : 1;            /*!< [5..5] Message Valid                                                      */
        __IM  uint32_t RTSEL    : 1;            /*!< [6..6] Receive/Transmit Selected                                          */
        __IM  uint32_t RXEN     : 1;            /*!< [7..7] Receive Enable                                                     */
        __IM  uint32_t TXRQ     : 1;            /*!< [8..8] Transmit Request                                                   */
        __IM  uint32_t TXEN0    : 1;            /*!< [9..9] Transmit Enable 0                                                  */
        __IM  uint32_t TXEN1    : 1;            /*!< [10..10] Transmit Enable 1                                                */
        __IM  uint32_t DIR      : 1;            /*!< [11..11] Message Direction                                                */
        __IM  uint32_t LIST     : 4;            /*!< [15..12] List Allocation                                                  */
        __IM  uint32_t PPREV    : 8;            /*!< [23..16] Pointer to Previous Message Object                               */
        __IM  uint32_t PNEXT    : 8;            /*!< [31..24] Pointer to Next Message Object                                   */
      } bit;
    } CAN_MOSTAT4;
  } OBJ4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000FA0) Message Object 5 Function Control Register                 */
    
