popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
      struct {
        __IM  uint32_t RXPND    : 1;            /*!< [0..0] Receive Pending                                                    */
        __IM  uint32_t TXPND    : 1;            /*!< [1..1] Transmit Pending                                                   */
        __IM  uint32_t RXUPD    : 1;            /*!< [2..2] Receive Updating                                                   */
        __IM  uint32_t NEWDAT   : 1;            /*!< [3..3] New Data                                                           */
        __IM  uint32_t MSGLST   : 1;            /*!< [4..4] Message Lost                                                       */
        __IM  uint32_t MSGVAL   : 1;            /*!< [5..5] Message Valid                                                      */
        __IM  uint32_t RTSEL    : 1;            /*!< [6..6] Receive/Transmit Selected                                          */
        __IM  uint32_t RXEN     : 1;            /*!< [7..7] Receive Enable                                                     */
        __IM  uint32_t TXRQ     : 1;            /*!< [8..8] Transmit Request                                                   */
        __IM  uint32_t TXEN0    : 1;            /*!< [9..9] Transmit Enable 0                                                  */
        __IM  uint32_t TXEN1    : 1;            /*!< [10..10] Transmit Enable 1                                                */
        __IM  uint32_t DIR      : 1;            /*!< [11..11] Message Direction                                                */
        __IM  uint32_t LIST     : 4;            /*!< [15..12] List Allocation                                                  */
        __IM  uint32_t PPREV    : 8;            /*!< [23..16] Pointer to Previous Message Object                               */
        __IM  uint32_t PNEXT    : 8;            /*!< [31..24] Pointer to Next Message Object                                   */
      } bit;
    } CAN_MOSTAT24;
  } OBJ24;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001220) Message Object 25 Function Control Register                */
    
    struct {
      __IOM uint32_t MMC        : 4;            /*!< [3..0] Message Mode Control                                               */
            uint32_t            : 1;
      __IOM uint32_t BRS        : 1;            /*!< [5..5] Bit Rate Switch                                                    */
      __IOM uint32_t FDF        : 1;            /*!< [6..6] CAN FD Frame Format                                                */
            uint32_t            : 1;
      __IOM uint32_t GDFS       : 1;            /*!< [8..8] Gateway Data Frame Send                                            */
      __IOM uint32_t IDC        : 1;            /*!< [9..9] Identifier Copy                                                    */
      __IOM uint32_t DLCC       : 1;            /*!< [10..10] Data Length Code Copy                                            */
      __IOM uint32_t DATC       : 1;            /*!< [11..11] Data Copy                                                        */
            uint32_t            : 4;
      __IOM uint32_t RXIE       : 1;            /*!< [16..16] Receive Interrupt Enable                                         */
      __IOM uint32_t TXIE       : 1;            /*!< [17..17] Transmit Interrupt Enable                                        */
      __IOM uint32_t OVIE       : 1;            /*!< [18..18] Overflow Interrupt Enable                                        */
            uint32_t            : 1;
      __IOM uint32_t FRREN      : 1;            /*!< [20..20] Foreign Remote Request Enable                                    */
      __IOM uint32_t RMM        : 1;            /*!< [21..21] Transmit Object Remote Monitoring                                */
      __IOM uint32_t SDT        : 1;            /*!< [22..22] Single Data Transfer                                             */
      __IOM uint32_t STT        : 1;            /*!< [23..23] Single Transmit Trial                                            */
      __IOM uint32_t DLC        : 4;            /*!< [27..24] Data Length Code                                                 */
            uint32_t            : 4;
    } bit;
  } CAN_MOFCR25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001224) Message Object 25 FIFO/Gateway Pointer Register            */
    
    struct {
      __IOM uint32_t BOT        : 8;            /*!< [7..0] Bottom Pointer                                                     */
      __IOM uint32_t TOP        : 8;            /*!< [15..8] Top Pointer                                                       */
      __IOM uint32_t CUR        : 8;            /*!< [23..16] Current Object Pointer                                           */
      __IOM uint32_t SEL        : 8;            /*!< [31..24] Object Select Pointer                                            */
    } bit;
  } CAN_MOFGPR25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001228) Message Object 25 Interrupt Pointer Register               */
    
    struct {
      __IOM uint32_t RXINP      : 4;            /*!< [3..0] Receive Interrupt Node Pointer                                     */
      __IOM uint32_t TXINP      : 4;            /*!< [7..4] Transmit Interrupt Node Pointer                                    */
      __IOM uint32_t MPN        : 8;            /*!< [15..8] Message Pending Number                                            */
      __IOM uint32_t CFCVAL     : 16;           /*!< [31..16] CAN Frame Counter Value                                          */
    } bit;
  } CAN_MOIPR25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000122C) Message Object 25 Acceptance Mask Register                 */
    
    struct {
      __IOM uint32_t AM         : 29;           /*!< [28..0] Acceptance Mask for Message Identifier                            */
      __IOM uint32_t MIDE       : 1;            /*!< [29..29] Acceptance Mask Bit for Message IDE Bit                          */
            uint32_t            : 2;
    } bit;
  } CAN_MOAMR25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001230) Message Object 25 Data Register Low                        */
    
