popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
      struct {
        __OM  uint32_t RESRXPND : 1;            /*!< [0..0] Reset Receive Pending                                              */
        __OM  uint32_t RESTXPND : 1;            /*!< [1..1] Reset Transmit Pending                                             */
        __OM  uint32_t RESRXUPD : 1;            /*!< [2..2] Reset Receive Updating                                             */
        __OM  uint32_t RESNEWDAT : 1;           /*!< [3..3] Reset New Data                                                     */
        __OM  uint32_t RESMSGLST : 1;           /*!< [4..4] Reset Message Lost                                                 */
        __OM  uint32_t RESMSGVAL : 1;           /*!< [5..5] Reset Message Valid                                                */
        __OM  uint32_t RESRTSEL : 1;            /*!< [6..6] Reset Receive/Transmit Selected                                    */
        __OM  uint32_t RESRXEN  : 1;            /*!< [7..7] Reset Receive Enable                                               */
        __OM  uint32_t RESTXRQ  : 1;            /*!< [8..8] Reset Transmit Request                                             */
        __OM  uint32_t RESTXEN0 : 1;            /*!< [9..9] Reset Transmit Enable 0                                            */
        __OM  uint32_t RESTXEN1 : 1;            /*!< [10..10] Reset Transmit Enable 1                                          */
        __OM  uint32_t RESDIR_SETDIR : 1;       /*!< [11..11] Reset Message Direction                                          */
              uint32_t          : 4;
        __OM  uint32_t SETRXPND : 1;            /*!< [16..16] Set Receive Pending                                              */
        __OM  uint32_t SETTXPND : 1;            /*!< [17..17] Set Transmit Pending                                             */
        __OM  uint32_t SETRXUPD : 1;            /*!< [18..18] Set Receive Updating                                             */
        __OM  uint32_t SETNEWDAT : 1;           /*!< [19..19] Set New Data                                                     */
        __OM  uint32_t SETMSGLST : 1;           /*!< [20..20] Set Message Lost                                                 */
        __OM  uint32_t SETMSGVAL : 1;           /*!< [21..21] Set Message Valid                                                */
        __OM  uint32_t SETRTSEL : 1;            /*!< [22..22] Set Receive/Transmit Selected                                    */
        __OM  uint32_t SETRXEN  : 1;            /*!< [23..23] Set Receive Enable                                               */
        __OM  uint32_t SETTXRQ  : 1;            /*!< [24..24] Set Transmit Request                                             */
        __OM  uint32_t SETTXEN0 : 1;            /*!< [25..25] Set Transmit Enable 0                                            */
        __OM  uint32_t SETTXEN1 : 1;            /*!< [26..26] Set Transmit Enable 1                                            */
        __OM  uint32_t SETDIR   : 1;            /*!< [27..27] Set Message Direction                                            */
              uint32_t          : 4;
      } bit;
    } CAN_MOCTR26;
    
    union {
      __IM  uint32_t reg;                       /*!< (@ 0x0000125C) Message Object 26 Status Register                          */
      
      struct {
        __IM  uint32_t RXPND    : 1;            /*!< [0..0] Receive Pending                                                    */
        __IM  uint32_t TXPND    : 1;            /*!< [1..1] Transmit Pending                                                   */
        __IM  uint32_t RXUPD    : 1;            /*!< [2..2] Receive Updating                                                   */
        __IM  uint32_t NEWDAT   : 1;            /*!< [3..3] New Data                                                           */
        __IM  uint32_t MSGLST   : 1;            /*!< [4..4] Message Lost                                                       */
        __IM  uint32_t MSGVAL   : 1;            /*!< [5..5] Message Valid                                                      */
        __IM  uint32_t RTSEL    : 1;            /*!< [6..6] Receive/Transmit Selected                                          */
        __IM  uint32_t RXEN     : 1;            /*!< [7..7] Receive Enable                                                     */
        __IM  uint32_t TXRQ     : 1;            /*!< [8..8] Transmit Request                                                   */
        __IM  uint32_t TXEN0    : 1;            /*!< [9..9] Transmit Enable 0                                                  */
        __IM  uint32_t TXEN1    : 1;            /*!< [10..10] Transmit Enable 1                                                */
        __IM  uint32_t DIR      : 1;            /*!< [11..11] Message Direction                                                */
        __IM  uint32_t LIST     : 4;            /*!< [15..12] List Allocation                                                  */
        __IM  uint32_t PPREV    : 8;            /*!< [23..16] Pointer to Previous Message Object                               */
        __IM  uint32_t PNEXT    : 8;            /*!< [31..24] Pointer to Next Message Object                                   */
      } bit;
    } CAN_MOSTAT26;
  } OBJ26;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001260) Message Object 27 Function Control Register                */
    
    struct {
      __IOM uint32_t MMC        : 4;            /*!< [3..0] Message Mode Control                                               */
            uint32_t            : 1;
      __IOM uint32_t BRS        : 1;            /*!< [5..5] Bit Rate Switch                                                    */
      __IOM uint32_t FDF        : 1;            /*!< [6..6] CAN FD Frame Format                                                */
            uint32_t            : 1;
      __IOM uint32_t GDFS       : 1;            /*!< [8..8] Gateway Data Frame Send                                            */
      __IOM uint32_t IDC        : 1;            /*!< [9..9] Identifier Copy                                                    */
      __IOM uint32_t DLCC       : 1;            /*!< [10..10] Data Length Code Copy                                            */
      __IOM uint32_t DATC       : 1;            /*!< [11..11] Data Copy                                                        */
            uint32_t            : 4;
      __IOM uint32_t RXIE       : 1;            /*!< [16..16] Receive Interrupt Enable                                         */
      __IOM uint32_t TXIE       : 1;            /*!< [17..17] Transmit Interrupt Enable                                        */
      __IOM uint32_t OVIE       : 1;            /*!< [18..18] Overflow Interrupt Enable                                        */
            uint32_t            : 1;
      __IOM uint32_t FRREN      : 1;            /*!< [20..20] Foreign Remote Request Enable                                    */
      __IOM uint32_t RMM        : 1;            /*!< [21..21] Transmit Object Remote Monitoring                                */
      __IOM uint32_t SDT        : 1;            /*!< [22..22] Single Data Transfer                                             */
      __IOM uint32_t STT        : 1;            /*!< [23..23] Single Transmit Trial                                            */
      __IOM uint32_t DLC        : 4;            /*!< [27..24] Data Length Code                                                 */
            uint32_t            : 4;
    } bit;
  } CAN_MOFCR27;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001264) Message Object 27 FIFO/Gateway Pointer Register            */
    
