popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO3DATA6;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000880) Extended Message Object 4 Data 0 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO4DATA0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000884) Extended Message Object 4 Data 1 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO4DATA1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000888) Extended Message Object 4 Data 2 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO4DATA2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000088C) Extended Message Object 4 Data 3 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO4DATA3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000890) Extended Message Object 4 Data 4 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO4DATA4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000894) Extended Message Object 4 Data 5 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO4DATA5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000898) Extended Message Object 4 Data 6 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO4DATA6;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000008A0) Extended Message Object 5 Data 0 Register                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO5DATA0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000008A4) Extended Message Object 5 Data 1 Register                  */
    
