popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO29DATA4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BB4) Extended Message Object 29 Data 5 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO29DATA5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BB8) Extended Message Object 29 Data 6 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO29DATA6;
  __IM  uint32_t  RESERVED30;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BC0) Extended Message Object 30 Data 0 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO30DATA0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BC4) Extended Message Object 30 Data 1 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO30DATA1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BC8) Extended Message Object 30 Data 2 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO30DATA2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BCC) Extended Message Object 30 Data 3 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO30DATA3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BD0) Extended Message Object 30 Data 4 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO30DATA4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BD4) Extended Message Object 30 Data 5 Register                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Data Byte 0 of Message Object n                                    */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Data Byte 1 of Message Object n                                   */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Data Byte 2 of Message Object n                                  */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Data Byte 3 of Message Object n                                  */
    } bit;
  } CAN_EMO30DATA5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000BD8) Extended Message Object 30 Data 6 Register                 */
    
