popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] CAN transceiver enable                                             */
      __IOM uint32_t MODE       : 2;            /*!< [2..1] CAN mode control                                                   */
            uint32_t            : 5;
      __IOM uint32_t EN_TXD_TO  : 1;            /*!< [8..8] Enable transmitter deactivation due to TXD dominant timeout        */
      __IOM uint32_t TSIL_EN    : 1;            /*!< [9..9] Enable tsilence counter                                            */
            uint32_t            : 6;
      __IOM uint32_t TXD_IN_SEL : 2;            /*!< [17..16] TXD input selector                                               */
            uint32_t            : 14;
    } bit;
  } CTRL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000004) CAN transceiver interrupt status                           */
    
    struct {
      __IM  uint32_t BUS_TO_IS  : 1;            /*!< [0..0] Bus dominant timeout interrupt status                              */
      __IM  uint32_t TXD_TO_IS  : 1;            /*!< [1..1] TXD dominant timeout interrupt status                              */
      __IM  uint32_t OT_IS      : 1;            /*!< [2..2] CAN overtemperature interrupt status                               */
      __IM  uint32_t BUS_ACT_IS : 1;            /*!< [3..3] Bus active during CAN sleep interrupt status                       */
            uint32_t            : 12;
      __IM  uint32_t BUS_TO_STS : 1;            /*!< [16..16] Bus dominant timeout status                                      */
      __IM  uint32_t TXD_TO_STS : 1;            /*!< [17..17] TXD dominant timeout status                                      */
      __IM  uint32_t OT_STS     : 1;            /*!< [18..18] CAN overtemperature status                                       */
            uint32_t            : 1;
      __IM  uint32_t UV_STS     : 1;            /*!< [20..20] CAN supply undervoltage status                                   */
            uint32_t            : 11;
    } bit;
  } IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) CAN transceiver interrupt status register clear            */
    
    struct {
      __OM  uint32_t BUS_TO_ISC : 1;            /*!< [0..0] Bus dominant timeout interrupt status clear                        */
      __OM  uint32_t TXD_TO_ISC : 1;            /*!< [1..1] TXD dominant timeout interrupt status clear                        */
      __OM  uint32_t OT_ISC     : 1;            /*!< [2..2] CAN overtemperature interrupt status clear                         */
      __OM  uint32_t BUS_ACT_ISC : 1;           /*!< [3..3] Bus active during CAN sleep interrupt status clear                 */
            uint32_t            : 12;
      __OM  uint32_t BUS_TO_SC  : 1;            /*!< [16..16] Bus dominant timeout status clear                                */
      __OM  uint32_t TXD_TO_SC  : 1;            /*!< [17..17] TXD dominant timeout status clear                                */
      __OM  uint32_t OT_SC      : 1;            /*!< [18..18] CAN overtemperature status clear                                 */
            uint32_t            : 13;
    } bit;
  } IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) CAN transceiver interrupt status register set              */
    
    struct {
      __OM  uint32_t BUS_TO_ISS : 1;            /*!< [0..0] Bus dominant timeout interrupt status set                          */
      __OM  uint32_t TXD_TO_ISS : 1;            /*!< [1..1] TXD dominant timeout interrupt status set                          */
      __OM  uint32_t OT_ISS     : 1;            /*!< [2..2] CAN overtemperature interrupt status set                           */
      __OM  uint32_t BUS_ACT_ISS : 1;           /*!< [3..3] Bus active during CAN sleep interrupt status set                   */
            uint32_t            : 12;
      __OM  uint32_t BUS_TO_SS  : 1;            /*!< [16..16] Bus dominant timeout status set                                  */
      __OM  uint32_t TXD_TO_SS  : 1;            /*!< [17..17] TXD dominant timeout status set                                  */
      __OM  uint32_t OT_SS      : 1;            /*!< [18..18] CAN overtemperature status set                                   */
            uint32_t            : 13;
    } bit;
  } IRQSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) CAN transceiver interrupt enable                           */
    
    struct {
      __IOM uint32_t BUS_TO_IEN : 1;            /*!< [0..0] Bus dominant timeout interrupt enable                              */
      __IOM uint32_t TXD_TO_IEN : 1;            /*!< [1..1] TXD dominant timeout interrupt enable                              */
      __IOM uint32_t OT_IEN     : 1;            /*!< [2..2] CAN overtemperature interrupt enable                               */
      __IOM uint32_t BUS_ACT_IEN : 1;           /*!< [3..3] Bus active during CAN sleep interrupt enable                       */
            uint32_t            : 28;
    } bit;
  } IRQEN;
} CANTRX_Type;                                  /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           CCU7                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CCU7 (CCU7)
  */

typedef struct {                                /*!< (@ 0x40008000) CCU7 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Clock Control Register                                     */
    
