popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t DISR       : 1;            /*!< [0..0] Module Disable Request Bit - DISR                                  */
      __IM  uint32_t DISS       : 1;            /*!< [1..1] Module Disable Status Bit - DISS                                   */
            uint32_t            : 30;
    } bit;
  } CLC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Module Configuration Register                              */
    
    struct {
      __IOM uint32_t T12        : 1;            /*!< [0..0] T12 Available - T12                                                */
      __IOM uint32_t T13        : 1;            /*!< [1..1] T13 Available - T13                                                */
      __IOM uint32_t MCM        : 1;            /*!< [2..2] Multi-Channel Mode Available - MCM                                 */
            uint32_t            : 1;
      __IOM uint32_t T14        : 1;            /*!< [4..4] T14 Available -T14                                                 */
      __IOM uint32_t T15        : 1;            /*!< [5..5] T15 Available - T15                                                */
      __IOM uint32_t T16        : 1;            /*!< [6..6] T16 Available - T16                                                */
            uint32_t            : 8;
      __IOM uint32_t WREN       : 1;            /*!< [15..15] Write Enable - WREN                                              */
            uint32_t            : 16;
    } bit;
  } MCFG;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Module Identification Register                             */
    
    struct {
      __IM  uint32_t MODREV     : 8;            /*!< [7..0] Module Revision Number - MODREV                                    */
      __IM  uint32_t MODNUM     : 8;            /*!< [15..8] Module Number Value - MODNUM                                      */
            uint32_t            : 16;
    } bit;
  } ID;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Port Input Select Register 0                               */
    
    struct {
      __IOM uint32_t ISCC70     : 2;            /*!< [1..0] Input Select for CC70                                              */
      __IOM uint32_t ISCC71     : 2;            /*!< [3..2] Input Select for CC71                                              */
      __IOM uint32_t ISCC72     : 2;            /*!< [5..4] Input Select for CC72                                              */
      __IOM uint32_t ISTRP      : 2;            /*!< [7..6] Input Select for CTRAP                                             */
      __IOM uint32_t ISPOS0     : 2;            /*!< [9..8] Input Select for CCPOS0                                            */
      __IOM uint32_t ISPOS1     : 2;            /*!< [11..10] Input Select for CCPOS1                                          */
      __IOM uint32_t ISPOS2     : 2;            /*!< [13..12] Input Select for CCPOS2                                          */
      __IOM uint32_t IST12HR    : 2;            /*!< [15..14] Input Select for T12HR                                           */
            uint32_t            : 16;
    } bit;
  } PISEL0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Port Input Select Register 2                               */
    
    struct {
      __IOM uint32_t IST13HR    : 2;            /*!< [1..0] Input Select for T13HR                                             */
      __IOM uint32_t ISCNT12    : 2;            /*!< [3..2] Input Select for T12 Counting Input                                */
      __IOM uint32_t ISCNT13    : 2;            /*!< [5..4] Input Select for T13 Counting Input                                */
      __IOM uint32_t T12EXT     : 1;            /*!< [6..6] Extension for T12HR Inputs                                         */
      __IOM uint32_t T13EXT     : 1;            /*!< [7..7] Extension for T13HR Inputs                                         */
            uint32_t            : 24;
    } bit;
  } PISEL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Port Input Select Register 24                              */
    
    struct {
      __IOM uint32_t IST1xHR    : 2;            /*!< [1..0] Input Select for T1xHR                                             */
      __IOM uint32_t ISCNT1x    : 2;            /*!< [3..2] Input Select for T1x Counting Input                                */
      __IOM uint32_t T1xEXT     : 1;            /*!< [4..4] Extension for T1xHR Inputs                                         */
            uint32_t            : 27;
    } bit;
  } PISEL24;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Port Input Select Register 25                              */
    
    struct {
      __IOM uint32_t IST1xHR    : 2;            /*!< [1..0] Input Select for T1xHR                                             */
      __IOM uint32_t ISCNT1x    : 2;            /*!< [3..2] Input Select for T1x Counting Input                                */
      __IOM uint32_t T1xEXT     : 1;            /*!< [4..4] Extension for T1xHR Inputs                                         */
            uint32_t            : 27;
    } bit;
  } PISEL25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Port Input Select Register 26                              */
    
    struct {
      __IOM uint32_t IST1xHR    : 2;            /*!< [1..0] Input Select for T1xHR                                             */
      __IOM uint32_t ISCNT1x    : 2;            /*!< [3..2] Input Select for T1x Counting Input                                */
      __IOM uint32_t T1xEXT     : 1;            /*!< [4..4] Extension for T1xHR Inputs                                         */
            uint32_t            : 27;
    } bit;
  } PISEL26;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Kernel State Control Sensitivity Register                  */
    
