popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t SB0        : 1;            /*!< [0..0] Sensitivity Block x SBx (x=0,1,2,...)                              */
      __IOM uint32_t SB1        : 1;            /*!< [1..1] Sensitivity Block x SBx (x=0,1,2,...)                              */
      __IOM uint32_t SB2        : 1;            /*!< [2..2] Sensitivity Block x SBx (x=0,1,2,...)                              */
      __IOM uint32_t SB3        : 1;            /*!< [3..3] Sensitivity Block x SBx (x=0,1,2,...)                              */
      __IOM uint32_t SB4        : 1;            /*!< [4..4] Sensitivity Block x SBx (x=0,1,2,...)                              */
      __IOM uint32_t SB5        : 1;            /*!< [5..5] Sensitivity Block x SBx (x=0,1,2,...)                              */
      __IOM uint32_t SB6        : 1;            /*!< [6..6] Sensitivity Block x SBx (x=0,1,2,...)                              */
            uint32_t            : 25;
    } bit;
  } KSCSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Timer T12 Counter Register                                 */
    
    struct {
      __IOM uint32_t T12CV      : 16;           /*!< [15..0] Timer T12 Counter Value                                           */
            uint32_t            : 16;
    } bit;
  } T12;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Timer T12 Period Register                                  */
    
    struct {
      __IOM uint32_t T12PV      : 16;           /*!< [15..0] T12 Period Value                                                  */
            uint32_t            : 16;
    } bit;
  } T12PR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Dead-Time Control Register for Timer T12 Low               */
    
    struct {
      __IOM uint32_t DTE0       : 1;            /*!< [0..0] Dead-Time Enable Bit 0                                             */
      __IOM uint32_t DTE1       : 1;            /*!< [1..1] Dead-Time Enable Bit 1                                             */
      __IOM uint32_t DTE2       : 1;            /*!< [2..2] Dead-Time Enable Bit 2                                             */
            uint32_t            : 5;
      __IM  uint32_t DTR0       : 1;            /*!< [8..8] Dead-Time Run Indication Bit 0                                     */
      __IM  uint32_t DTR1       : 1;            /*!< [9..9] Dead-Time Run Indication Bit 1                                     */
      __IM  uint32_t DTR2       : 1;            /*!< [10..10] Dead-Time Run Indication Bit 2                                   */
            uint32_t            : 21;
    } bit;
  } T12DTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Dead-Time value Register CC7$x                             */
    
    struct {
      __IOM uint32_t DTM_RISE   : 8;            /*!< [7..0] Dead-Time rise                                                     */
      __IOM uint32_t DTM_FALL   : 8;            /*!< [15..8] Dead-Time fall                                                    */
            uint32_t            : 16;
    } bit;
  } T12DT0_VAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Dead-Time value Register CC7$x                             */
    
    struct {
      __IOM uint32_t DTM_RISE   : 8;            /*!< [7..0] Dead-Time rise                                                     */
      __IOM uint32_t DTM_FALL   : 8;            /*!< [15..8] Dead-Time fall                                                    */
            uint32_t            : 16;
    } bit;
  } T12DT1_VAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Dead-Time value Register CC7$x                             */
    
    struct {
      __IOM uint32_t DTM_RISE   : 8;            /*!< [7..0] Dead-Time rise                                                     */
      __IOM uint32_t DTM_FALL   : 8;            /*!< [15..8] Dead-Time fall                                                    */
            uint32_t            : 16;
    } bit;
  } T12DT2_VAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Dead-Time Input Selection Register (Demo in Windows)       */
    
    struct {
      __IOM uint32_t DTINSEL0   : 2;            /*!< [1..0] Deadtime Input selection 0                                         */
            uint32_t            : 2;
      __IOM uint32_t DTINSEL1   : 2;            /*!< [5..4] Deadtime Input selection 1                                         */
            uint32_t            : 2;
      __IOM uint32_t DTINSEL2   : 2;            /*!< [9..8] Deadtime Input selection 2                                         */
            uint32_t            : 22;
    } bit;
  } T12DTINSEL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000040) Capture/Compare Register for Channel CC70                  */
    
    struct {
      __IM  uint32_t CCV        : 16;           /*!< [15..0] Capture/Compare Value - CCV                                       */
            uint32_t            : 16;
    } bit;
  } CC70R;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000044) Capture/Compare Register for Channel CC71                  */
    
    struct {
      __IM  uint32_t CCV        : 16;           /*!< [15..0] Capture/Compare Value - CCV                                       */
            uint32_t            : 16;
    } bit;
  } CC71R;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) Capture/Compare Register for Channel CC72                  */
    
    struct {
      __IM  uint32_t CCV        : 16;           /*!< [15..0] Capture/Compare Value - CCV                                       */
            uint32_t            : 16;
    } bit;
  } CC72R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Capture/Compare Shadow Reg. for Channel CC70               */
    
