popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel x Capture/Compare Value
                                                     - CCS                                                                     */
            uint32_t            : 16;
    } bit;
  } CC70SR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Capture/Compare Shadow Reg. for Channel CC71               */
    
    struct {
      __IOM uint32_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel x Capture/Compare Value
                                                     - CCS                                                                     */
            uint32_t            : 16;
    } bit;
  } CC71SR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Capture/Compare Shadow Reg. for Channel CC72               */
    
    struct {
      __IOM uint32_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel x Capture/Compare Value
                                                     - CCS                                                                     */
            uint32_t            : 16;
    } bit;
  } CC72SR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000058) Compare Register for Channel C70B                          */
    
    struct {
      __IM  uint32_t CV         : 16;           /*!< [15..0] Compare Value - CV                                                */
            uint32_t            : 16;
    } bit;
  } CC70BR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000005C) Compare Register for Channel C71B                          */
    
    struct {
      __IM  uint32_t CV         : 16;           /*!< [15..0] Compare Value - CV                                                */
            uint32_t            : 16;
    } bit;
  } CC71BR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000060) Compare Register for Channel C72B                          */
    
    struct {
      __IM  uint32_t CV         : 16;           /*!< [15..0] Compare Value - CV                                                */
            uint32_t            : 16;
    } bit;
  } CC72BR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) Compare Shadow Reg. for Channel C70BSR                     */
    
    struct {
      __IOM uint32_t CS         : 16;           /*!< [15..0] Shadow Register for Channel x Compare Value - CS                  */
            uint32_t            : 16;
    } bit;
  } CC70BSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Compare Shadow Reg. for Channel C71BSR                     */
    
    struct {
      __IOM uint32_t CS         : 16;           /*!< [15..0] Shadow Register for Channel x Compare Value - CS                  */
            uint32_t            : 16;
    } bit;
  } CC71BSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Compare Shadow Reg. for Channel C72BSR                     */
    
    struct {
      __IOM uint32_t CS         : 16;           /*!< [15..0] Shadow Register for Channel x Compare Value - CS                  */
            uint32_t            : 16;
    } bit;
  } CC72BSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Timer T13 Counter Register                                 */
    
    struct {
      __IOM uint32_t T1xCV      : 16;           /*!< [15..0] Timer T1x Counter Value                                           */
            uint32_t            : 16;
    } bit;
  } T13R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) Timer T14 Counter Register                                 */
    
    struct {
      __IOM uint32_t T1xCV      : 16;           /*!< [15..0] Timer T1x Counter Value                                           */
            uint32_t            : 16;
    } bit;
  } T14R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Timer T15 Counter Register                                 */
    
    struct {
      __IOM uint32_t T1xCV      : 16;           /*!< [15..0] Timer T1x Counter Value                                           */
            uint32_t            : 16;
    } bit;
  } T15R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) Timer T16 Counter Register                                 */
    
    struct {
      __IOM uint32_t T1xCV      : 16;           /*!< [15..0] Timer T1x Counter Value                                           */
            uint32_t            : 16;
    } bit;
  } T16R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Timer T13 Period Register                                  */
    
    struct {
      __IOM uint32_t T1xPV      : 16;           /*!< [15..0] T1x Period Value                                                  */
            uint32_t            : 16;
    } bit;
  } T13PR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) Timer T14 Period Register                                  */
    
    struct {
      __IOM uint32_t T1xPV      : 16;           /*!< [15..0] T1x Period Value                                                  */
            uint32_t            : 16;
    } bit;
  } T14PR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Timer T15 Period Register                                  */
    
    struct {
      __IOM uint32_t T1xPV      : 16;           /*!< [15..0] T1x Period Value                                                  */
            uint32_t            : 16;
    } bit;
  } T15PR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Timer T16 Period Register                                  */
    
    struct {
      __IOM uint32_t T1xPV      : 16;           /*!< [15..0] T1x Period Value                                                  */
            uint32_t            : 16;
    } bit;
  } T16PR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000090) Compare Register for Channel C73                           */
    
