popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t CCV        : 16;           /*!< [15..0] Channel C7x Compare Value - CCV                                   */
            uint32_t            : 16;
    } bit;
  } C73R;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000094) Compare Register for Channel C74                           */
    
    struct {
      __IM  uint32_t CCV        : 16;           /*!< [15..0] Channel C7x Compare Value - CCV                                   */
            uint32_t            : 16;
    } bit;
  } C74R;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000098) Compare Register for Channel C75                           */
    
    struct {
      __IM  uint32_t CCV        : 16;           /*!< [15..0] Channel C7x Compare Value - CCV                                   */
            uint32_t            : 16;
    } bit;
  } C75R;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000009C) Compare Register for Channel C76                           */
    
    struct {
      __IM  uint32_t CCV        : 16;           /*!< [15..0] Channel C7x Compare Value - CCV                                   */
            uint32_t            : 16;
    } bit;
  } C76R;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Compare Shadow Reg. for Channel CC73                       */
    
    struct {
      __IOM uint32_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel CC73 Compare Value                    */
            uint32_t            : 16;
    } bit;
  } C73SR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Compare Shadow Reg. for Channel CC74                       */
    
    struct {
      __IOM uint32_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel CC74 Compare Value                    */
            uint32_t            : 16;
    } bit;
  } C74SR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Compare Shadow Reg. for Channel CC75                       */
    
    struct {
      __IOM uint32_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel CC75 Compare Value                    */
            uint32_t            : 16;
    } bit;
  } C75SR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Compare Shadow Reg. for Channel CC76                       */
    
    struct {
      __IOM uint32_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel CC76 Compare Value                    */
            uint32_t            : 16;
    } bit;
  } C76SR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Compare State Register                                     */
    
    struct {
      __IM  uint32_t CC70ST     : 1;            /*!< [0..0] Capture/Compare State Bits                                         */
      __IM  uint32_t CC71ST     : 1;            /*!< [1..1] Capture/Compare State Bits                                         */
      __IM  uint32_t CC72ST     : 1;            /*!< [2..2] Capture/Compare State Bits                                         */
      __IM  uint32_t CCPOS0     : 1;            /*!< [3..3] Sampled Hall Pattern Bit 0                                         */
      __IM  uint32_t CCPOS1     : 1;            /*!< [4..4] Sampled Hall Pattern Bit 1                                         */
      __IM  uint32_t CCPOS2     : 1;            /*!< [5..5] Sampled Hall Pattern Bit 2                                         */
      __IM  uint32_t CC73ST     : 1;            /*!< [6..6] Compare State Bits                                                 */
            uint32_t            : 1;
      __IOM uint32_t CC70PS     : 1;            /*!< [8..8] Passive State Select for Compare Outputs                           */
      __IOM uint32_t COUT70PS   : 1;            /*!< [9..9] Passive State Select for Compare Outputs                           */
      __IOM uint32_t CC71PS     : 1;            /*!< [10..10] Passive State Select for Compare Outputs                         */
      __IOM uint32_t COUT71PS   : 1;            /*!< [11..11] Passive State Select for Compare Outputs                         */
      __IOM uint32_t CC72PS     : 1;            /*!< [12..12] Passive State Select for Compare Outputs                         */
      __IOM uint32_t COUT72PS   : 1;            /*!< [13..13] Passive State Select for Compare Outputs                         */
      __IOM uint32_t COUT73PS   : 1;            /*!< [14..14] Passive State Select for Compare Outputs                         */
      __IOM uint32_t T13IM      : 1;            /*!< [15..15] T13 Inverted Modulation                                          */
            uint32_t            : 16;
    } bit;
  } CMPSTAT;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000B4) Compare State Register 2                                   */
    
    struct {
      __IM  uint32_t C70BST     : 1;            /*!< [0..0] Compare State Bits B                                               */
      __IM  uint32_t C71BST     : 1;            /*!< [1..1] Compare State Bits B                                               */
      __IM  uint32_t C72BST     : 1;            /*!< [2..2] Compare State Bits B                                               */
            uint32_t            : 1;
      __IM  uint32_t C74ST      : 1;            /*!< [4..4] Compare State Bits                                                 */
      __IM  uint32_t C75ST      : 1;            /*!< [5..5] Compare State Bits                                                 */
      __IM  uint32_t C76ST      : 1;            /*!< [6..6] Compare State Bits                                                 */
            uint32_t            : 1;
      __IM  uint32_t CC70ST     : 1;            /*!< [8..8] Capture/Compare State Bits                                         */
      __IM  uint32_t CC71ST     : 1;            /*!< [9..9] Capture/Compare State Bits                                         */
      __IM  uint32_t CC72ST     : 1;            /*!< [10..10] Capture/Compare State Bits                                       */
            uint32_t            : 21;
    } bit;
  } CMPSTAT_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) Compare State Modification Register                        */
    
