popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t MCC70S     : 1;            /*!< [0..0] Capture/Compare Status Modification Bit 0 (Set)                    */
      __OM  uint32_t MCC71S     : 1;            /*!< [1..1] Capture/Compare Status Modification Bit 1 (Set)                    */
      __OM  uint32_t MCC72S     : 1;            /*!< [2..2] Capture/Compare Status Modification Bit 2 (Set)                    */
      __OM  uint32_t MCC70BS    : 1;            /*!< [3..3] Compare B Status Modification Bit 0 (Set)                          */
      __OM  uint32_t MCC71BS    : 1;            /*!< [4..4] Compare B Status Modification Bit 1 (Set)                          */
      __OM  uint32_t MCC72BS    : 1;            /*!< [5..5] Compare B Status Modification Bit 2 (Set)                          */
      __OM  uint32_t MCC73S     : 1;            /*!< [6..6] Capture/Compare Status Modification Bits (Set)                     */
            uint32_t            : 1;
      __OM  uint32_t MCC70R     : 1;            /*!< [8..8] Capture/Compare Status Modification Bit 0(Reset)                   */
      __OM  uint32_t MCC71R     : 1;            /*!< [9..9] Capture/Compare Status Modification Bit 1(Reset)                   */
      __OM  uint32_t MCC72R     : 1;            /*!< [10..10] Capture/Compare Status Modification Bit 2(Reset)                 */
      __OM  uint32_t MCC70BR    : 1;            /*!< [11..11] Compare B Status Modification Bit 0(Reset)                       */
      __OM  uint32_t MCC71BR    : 1;            /*!< [12..12] Compare B Status Modification Bit 1(Reset)                       */
      __OM  uint32_t MCC72BR    : 1;            /*!< [13..13] Compare B Status Modification Bit 2(Reset)                       */
      __OM  uint32_t MCC73R     : 1;            /*!< [14..14] Capture/Compare Status Modification Bits (Reset)                 */
            uint32_t            : 17;
    } bit;
  } CMPMODIF;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) Compare State Modification Register 2                      */
    
    struct {
      __OM  uint32_t MC74S      : 1;            /*!< [0..0] Compare Status Modification Bit 4 (Set)                            */
      __OM  uint32_t MC75S      : 1;            /*!< [1..1] Compare Status Modification Bit 5 (Set)                            */
      __OM  uint32_t MC76S      : 1;            /*!< [2..2] Compare Status Modification Bit 6 (Set)                            */
            uint32_t            : 1;
      __IOM uint32_t CC70INV    : 1;            /*!< [4..4] Output channel CC70ST Inversion Enable                             */
      __IOM uint32_t CC71INV    : 1;            /*!< [5..5] Output channel CC71ST Inversion Enable                             */
      __IOM uint32_t CC72INV    : 1;            /*!< [6..6] Output channel CC72ST Inversion Enable                             */
            uint32_t            : 1;
      __OM  uint32_t MC74R      : 1;            /*!< [8..8] Compare Status Modification Bit 4(Reset)                           */
      __OM  uint32_t MC75R      : 1;            /*!< [9..9] Compare Status Modification Bit 5(Reset)                           */
      __OM  uint32_t MC76R      : 1;            /*!< [10..10] Compare Status Modification Bit 6(Reset)                         */
            uint32_t            : 1;
      __IOM uint32_t C70BINV    : 1;            /*!< [12..12] Output channel C70BST Inversion Enable                           */
      __IOM uint32_t C71BINV    : 1;            /*!< [13..13] Output channel C71BST Inversion Enable                           */
      __IOM uint32_t C72BINV    : 1;            /*!< [14..14] Output channel C72BST Inversion Enable                           */
            uint32_t            : 17;
    } bit;
  } CMPMODIF_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) T12 Capture/Compare Mode Select Register                   */
    
    struct {
      __IOM uint32_t MSEL70     : 4;            /*!< [3..0] Capture/Compare Mode Selection MSEL7x (x=0,1,2)                    */
      __IOM uint32_t MSEL71     : 4;            /*!< [7..4] Capture/Compare Mode Selection MSEL7x (x=0,1,2)                    */
      __IOM uint32_t MSEL72     : 4;            /*!< [11..8] Capture/Compare Mode Selection MSEL7x (x=0,1,2)                   */
      __IOM uint32_t HSYNC      : 3;            /*!< [14..12] Hall Synchronization                                             */
      __IOM uint32_t DBYP       : 1;            /*!< [15..15] Delay Bypass                                                     */
            uint32_t            : 16;
    } bit;
  } T12MSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) Timer Control Register 0                                   */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t T12PRE     : 1;            /*!< [3..3] Timer T12 Prescaler Bit                                            */
      __IM  uint32_t T12R       : 1;            /*!< [4..4] Timer T12 Run Bit                                                  */
      __IM  uint32_t STE12      : 1;            /*!< [5..5] Timer T12 Shadow Transfer Enable                                   */
      __IM  uint32_t CDIR       : 1;            /*!< [6..6] Count Direction of Timer T12                                       */
      __IOM uint32_t CTM        : 1;            /*!< [7..7] T12 Operating Mode                                                 */
            uint32_t            : 3;
      __IOM uint32_t T13PRE     : 1;            /*!< [11..11] Timer T13 Prescaler Bit                                          */
      __IM  uint32_t T13R       : 1;            /*!< [12..12] Timer T13 Run Bit                                                */
      __IM  uint32_t STE13      : 1;            /*!< [13..13] Timer T13 Shadow Transfer Enable                                 */
            uint32_t            : 18;
    } bit;
  } TCTR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C8) Timer Control Register 1                                   */
    
