popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
            uint32_t            : 3;
      __IOM uint32_t T1xPRE     : 1;            /*!< [3..3] Timer T14 / 15 /16 Prescaler Bit                                   */
      __IM  uint32_t T14R       : 1;            /*!< [4..4] Timer T14 Run Bit                                                  */
      __IM  uint32_t STE14      : 1;            /*!< [5..5] Timer T14 Shadow Transfer Enable                                   */
            uint32_t            : 2;
      __IM  uint32_t T15R       : 1;            /*!< [8..8] Timer T15 Run Bit                                                  */
      __IM  uint32_t STE15      : 1;            /*!< [9..9] Timer T15 Shadow Transfer Enable                                   */
            uint32_t            : 2;
      __IM  uint32_t T16R       : 1;            /*!< [12..12] Timer T16 Run Bit                                                */
      __IM  uint32_t STE16      : 1;            /*!< [13..13] Timer T16 Shadow Transfer Enable                                 */
      __IM  uint32_t STE12      : 1;            /*!< [14..14] Timer T12 Shadow Transfer Enable                                 */
      __IM  uint32_t STE13      : 1;            /*!< [15..15] Timer T13 Shadow Transfer Enable                                 */
            uint32_t            : 16;
    } bit;
  } TCTR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000CC) Timer Control Register 2                                   */
    
    struct {
      __IOM uint32_t T12SSC     : 1;            /*!< [0..0] Timer T12 Single Shot Control                                      */
      __IOM uint32_t T13SSC     : 1;            /*!< [1..1] Timer T13 Single Shot Control                                      */
      __IOM uint32_t T13TEC     : 3;            /*!< [4..2] T13 Trigger Event Control                                          */
      __IOM uint32_t T13TED     : 2;            /*!< [6..5] Timer T13 Trigger Event Direction                                  */
            uint32_t            : 1;
      __IOM uint32_t T12RSEL    : 2;            /*!< [9..8] Timer T12 External Run Selection                                   */
      __IOM uint32_t T13RSEL    : 2;            /*!< [11..10] Timer T13 External Run Selection                                 */
            uint32_t            : 20;
    } bit;
  } TCTR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) Timer Control Register 24                                  */
    
    struct {
      __IOM uint32_t T1xSSC     : 1;            /*!< [0..0] Timer T1x Single Shot Control                                      */
      __IOM uint32_t T1xTEC     : 3;            /*!< [3..1] T1x Trigger Event Control                                          */
      __IOM uint32_t T1xTED     : 2;            /*!< [5..4] Timer T1x Trigger Event Direction                                  */
            uint32_t            : 2;
      __IOM uint32_t T1xRSEL    : 2;            /*!< [9..8] Timer T1x External Run Selection                                   */
            uint32_t            : 22;
    } bit;
  } TCTR24;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D4) Timer Control Register 25                                  */
    
    struct {
      __IOM uint32_t T1xSSC     : 1;            /*!< [0..0] Timer T1x Single Shot Control                                      */
      __IOM uint32_t T1xTEC     : 3;            /*!< [3..1] T1x Trigger Event Control                                          */
      __IOM uint32_t T1xTED     : 2;            /*!< [5..4] Timer T1x Trigger Event Direction                                  */
            uint32_t            : 2;
      __IOM uint32_t T1xRSEL    : 2;            /*!< [9..8] Timer T1x External Run Selection                                   */
            uint32_t            : 22;
    } bit;
  } TCTR25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) Timer Control Register 26                                  */
    
    struct {
      __IOM uint32_t T1xSSC     : 1;            /*!< [0..0] Timer T1x Single Shot Control                                      */
      __IOM uint32_t T1xTEC     : 3;            /*!< [3..1] T1x Trigger Event Control                                          */
      __IOM uint32_t T1xTED     : 2;            /*!< [5..4] Timer T1x Trigger Event Direction                                  */
            uint32_t            : 2;
      __IOM uint32_t T1xRSEL    : 2;            /*!< [9..8] Timer T1x External Run Selection                                   */
            uint32_t            : 22;
    } bit;
  } TCTR26;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000DC) Timer Control Register 4                                   */
    
    struct {
      __OM  uint32_t T12RR      : 1;            /*!< [0..0] Timer T12 Run Reset                                                */
      __OM  uint32_t T12RS      : 1;            /*!< [1..1] Timer T12 Run Set                                                  */
      __OM  uint32_t T12RES     : 1;            /*!< [2..2] Timer T12 Reset                                                    */
      __OM  uint32_t DTRES      : 1;            /*!< [3..3] Dead-Time Counter Reset                                            */
            uint32_t            : 1;
      __OM  uint32_t T12CNT     : 1;            /*!< [5..5] Timer T12 Count Event                                              */
      __OM  uint32_t T12STR     : 1;            /*!< [6..6] Timer T12 Shadow Transfer Request                                  */
      __OM  uint32_t T12STD     : 1;            /*!< [7..7] Timer T12 Shadow Transfer Disable                                  */
      __OM  uint32_t T13RR      : 1;            /*!< [8..8] Timer T13 Run Reset                                                */
      __OM  uint32_t T13RS      : 1;            /*!< [9..9] Timer T13 Run Set                                                  */
      __OM  uint32_t T13RES     : 1;            /*!< [10..10] Timer T13 Reset                                                  */
            uint32_t            : 2;
      __OM  uint32_t T13CNT     : 1;            /*!< [13..13] Timer T13 Count Event                                            */
      __OM  uint32_t T13STR     : 1;            /*!< [14..14] Timer T13 Shadow Transfer Request                                */
      __OM  uint32_t T13STD     : 1;            /*!< [15..15] Timer T13 Shadow Transfer Disable                                */
            uint32_t            : 16;
    } bit;
  } TCTR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) Timer Control Register 44                                  */
    
