popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t T1xRR      : 1;            /*!< [0..0] Timer T1x Run Reset                                                */
      __OM  uint32_t T1xRS      : 1;            /*!< [1..1] Timer T1x Run Set                                                  */
      __OM  uint32_t T1xRES     : 1;            /*!< [2..2] Timer T1x Reset                                                    */
            uint32_t            : 1;
      __OM  uint32_t T1xCNT     : 1;            /*!< [4..4] Timer T1x Count Event                                              */
      __OM  uint32_t T1xSTR     : 1;            /*!< [5..5] Timer T1x Shadow Transfer Request                                  */
      __OM  uint32_t T1xSTD     : 1;            /*!< [6..6] Timer T1x Shadow Transfer Disable                                  */
            uint32_t            : 25;
    } bit;
  } TCTR44;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E4) Timer Control Register 45                                  */
    
    struct {
      __OM  uint32_t T1xRR      : 1;            /*!< [0..0] Timer T1x Run Reset                                                */
      __OM  uint32_t T1xRS      : 1;            /*!< [1..1] Timer T1x Run Set                                                  */
      __OM  uint32_t T1xRES     : 1;            /*!< [2..2] Timer T1x Reset                                                    */
            uint32_t            : 1;
      __OM  uint32_t T1xCNT     : 1;            /*!< [4..4] Timer T1x Count Event                                              */
      __OM  uint32_t T1xSTR     : 1;            /*!< [5..5] Timer T1x Shadow Transfer Request                                  */
      __OM  uint32_t T1xSTD     : 1;            /*!< [6..6] Timer T1x Shadow Transfer Disable                                  */
            uint32_t            : 25;
    } bit;
  } TCTR45;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E8) Timer Control Register 46                                  */
    
    struct {
      __OM  uint32_t T1xRR      : 1;            /*!< [0..0] Timer T1x Run Reset                                                */
      __OM  uint32_t T1xRS      : 1;            /*!< [1..1] Timer T1x Run Set                                                  */
      __OM  uint32_t T1xRES     : 1;            /*!< [2..2] Timer T1x Reset                                                    */
            uint32_t            : 1;
      __OM  uint32_t T1xCNT     : 1;            /*!< [4..4] Timer T1x Count Event                                              */
      __OM  uint32_t T1xSTR     : 1;            /*!< [5..5] Timer T1x Shadow Transfer Request                                  */
      __OM  uint32_t T1xSTD     : 1;            /*!< [6..6] Timer T1x Shadow Transfer Disable                                  */
            uint32_t            : 25;
    } bit;
  } TCTR46;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000EC) Modulation Control Register                                */
    
    struct {
      __IOM uint32_t T12MODEN_CC70 : 1;         /*!< [0..0] T12 Modulation Enable                                              */
      __IOM uint32_t T12MODEN_COUT70 : 1;       /*!< [1..1] T12 Modulation Enable                                              */
      __IOM uint32_t T12MODEN_CC71 : 1;         /*!< [2..2] T12 Modulation Enable                                              */
      __IOM uint32_t T12MODEN_COUT71 : 1;       /*!< [3..3] T12 Modulation Enable                                              */
      __IOM uint32_t T12MODEN_CC72 : 1;         /*!< [4..4] T12 Modulation Enable                                              */
      __IOM uint32_t T12MODEN_COUT72 : 1;       /*!< [5..5] T12 Modulation Enable                                              */
            uint32_t            : 1;
      __IOM uint32_t MCMEN      : 1;            /*!< [7..7] Multi-Channel Mode Enable                                          */
      __IOM uint32_t T13MODEN_CC70 : 1;         /*!< [8..8] T13 Modulation Enable                                              */
      __IOM uint32_t T13MODEN_COUT70 : 1;       /*!< [9..9] T13 Modulation Enable                                              */
      __IOM uint32_t T13MODEN_CC71 : 1;         /*!< [10..10] T13 Modulation Enable                                            */
      __IOM uint32_t T13MODEN_COUT71 : 1;       /*!< [11..11] T13 Modulation Enable                                            */
      __IOM uint32_t T13MODEN_CC72 : 1;         /*!< [12..12] T13 Modulation Enable                                            */
      __IOM uint32_t T13MODEN_COUT72 : 1;       /*!< [13..13] T13 Modulation Enable                                            */
            uint32_t            : 1;
      __IOM uint32_t ECT13O     : 1;            /*!< [15..15] Enable Compare Timer T13 Output                                  */
            uint32_t            : 16;
    } bit;
  } MODCTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) Trap Control Register                                      */
    
    struct {
      __IOM uint32_t TRPM0      : 1;            /*!< [0..0] Trap Mode Control Bit 0 - TRPM0                                    */
      __IOM uint32_t TRPM1      : 1;            /*!< [1..1] Trap Mode Control Bit 1 - TRPM1                                    */
      __IOM uint32_t TRPM2      : 1;            /*!< [2..2] Trap Mode Control Bit 2 - TRPM2                                    */
            uint32_t            : 5;
      __IOM uint32_t TRPEN      : 6;            /*!< [13..8] Trap Enable Control                                               */
      __IOM uint32_t TRPEN13    : 1;            /*!< [14..14] Trap Enable Control for Timer T13                                */
      __IOM uint32_t TRPPEN     : 1;            /*!< [15..15] Trap Pin Enable - TRPPEN                                         */
            uint32_t            : 16;
    } bit;
  } TRPCTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F4) Passive State Level Register                               */
    
