popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t PSL_CC70   : 1;            /*!< [0..0] Compare Outputs Passive State Level                                */
      __IOM uint32_t PSL_COUT70 : 1;            /*!< [1..1] Compare Outputs Passive State Level                                */
      __IOM uint32_t PSL_CC71   : 1;            /*!< [2..2] Compare Outputs Passive State Level                                */
      __IOM uint32_t PSL_COUT71 : 1;            /*!< [3..3] Compare Outputs Passive State Level                                */
      __IOM uint32_t PSL_CC72   : 1;            /*!< [4..4] Compare Outputs Passive State Level                                */
      __IOM uint32_t PSL_COUT72 : 1;            /*!< [5..5] Compare Outputs Passive State Level                                */
            uint32_t            : 1;
      __IOM uint32_t PSL73      : 1;            /*!< [7..7] Passive State Level of Output COUT73                               */
            uint32_t            : 24;
    } bit;
  } PSLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F8) Multi-Channel Mode Output Shadow Register                  */
    
    struct {
      __IOM uint32_t MCMPS      : 6;            /*!< [5..0] Multi-Channel PWM Pattern Shadow                                   */
            uint32_t            : 1;
      __OM  uint32_t STRMCM     : 1;            /*!< [7..7] Shadow Transfer Request for MCMPS - STRMCM                         */
      __IOM uint32_t EXPHS      : 3;            /*!< [10..8] Expected Hall Pattern Shadow                                      */
      __IOM uint32_t CURHS      : 3;            /*!< [13..11] Current Hall Pattern Shadow                                      */
            uint32_t            : 1;
      __OM  uint32_t STRHP      : 1;            /*!< [15..15] Shadow Transfer Request for the Hall Pattern - STRHP             */
            uint32_t            : 16;
    } bit;
  } MCMOUTS;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000FC) Multi-Channel Mode Output Register                         */
    
    struct {
      __IM  uint32_t MCMP       : 6;            /*!< [5..0] Multi-Channel PWM Pattern                                          */
      __IM  uint32_t R          : 1;            /*!< [6..6] Reminder Flag                                                      */
            uint32_t            : 1;
      __IM  uint32_t EXPH       : 3;            /*!< [10..8] Expected Hall Pattern - EXPH                                      */
      __IM  uint32_t CURH       : 3;            /*!< [13..11] Current Hall Pattern - CURH                                      */
            uint32_t            : 18;
    } bit;
  } MCMOUT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) Multi-Channel Mode Control Register                        */
    
    struct {
      __IOM uint32_t SWSEL      : 3;            /*!< [2..0] Switching Selection                                                */
            uint32_t            : 1;
      __IOM uint32_t SWSYN      : 2;            /*!< [5..4] Switching Synchronization                                          */
            uint32_t            : 2;
      __IOM uint32_t STE12U     : 1;            /*!< [8..8] Shadow Transfer Enable for T12 Upcounting                          */
      __IOM uint32_t STE12D     : 1;            /*!< [9..9] Shadow Transfer Enable for T12 Downcounting                        */
      __IOM uint32_t STE13U     : 1;            /*!< [10..10] Shadow Transfer Enable for T13 Upcounting                        */
            uint32_t            : 21;
    } bit;
  } MCMCTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000104) Input Monitoring Register                                  */
    
    struct {
      __IOM uint32_t LBE        : 1;            /*!< [0..0] Lost Bit Event - LBE                                               */
      __IOM uint32_t CCPOS0I    : 1;            /*!< [1..1] Event indication for input signal CCPOS0 - CCPOS0I                 */
      __IOM uint32_t CCPOS1I    : 1;            /*!< [2..2] Event indication for input signal CCPOS1 - CCPOS1I                 */
      __IOM uint32_t CCPOS2I    : 1;            /*!< [3..3] Event indication for input signal CCPOS2 - CCPOS2I                 */
      __IOM uint32_t CC70INI    : 1;            /*!< [4..4] Event indication for input signal CC70IN - CC70INI                 */
      __IOM uint32_t CC71INI    : 1;            /*!< [5..5] Event indication for input signal CC71IN - CC71INI                 */
      __IOM uint32_t CC72INI    : 1;            /*!< [6..6] Event indication for input signal CC72IN - CC72INI                 */
      __IOM uint32_t CTRAPI     : 1;            /*!< [7..7] Event indication for input signal CTRAP - CTRAPI                   */
      __IOM uint32_t T12HRI     : 1;            /*!< [8..8] Event indication for input signal T12HR - T12HRI                   */
      __IOM uint32_t T13HRI     : 1;            /*!< [9..9] Event indication for input signal T13HR - T13HRI                   */
            uint32_t            : 22;
    } bit;
  } IMON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000108) Lost Indicator Register                                    */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t CCPOS0EN   : 1;            /*!< [1..1] Lost Indicator Enable for input signal CCPOS0 - CCPOS0EN           */
      __IOM uint32_t CCPOS1EN   : 1;            /*!< [2..2] Lost Indicator Enable for input signal CCPOS1 - CCPOS1EN           */
      __IOM uint32_t CCPOS2EN   : 1;            /*!< [3..3] Lost Indicator Enable for input signal CCPOS2 - CCPOS2EN           */
      __IOM uint32_t CC70INEN   : 1;            /*!< [4..4] Lost Indicator Enable for input signal CC70IN - CC70INEN           */
      __IOM uint32_t CC71INEN   : 1;            /*!< [5..5] Lost Indicator Enable for input signal CC71IN - CC71INEN           */
      __IOM uint32_t CC72INEN   : 1;            /*!< [6..6] Lost Indicator Enable for input signal CC72IN - CC72INEN           */
      __IOM uint32_t CTRAPEN    : 1;            /*!< [7..7] Lost Indicator Enable for input signal CTRAP - CTRAPEN             */
      __IOM uint32_t T12HREN    : 1;            /*!< [8..8] Lost Indicator Enable for input signal T12HR - T12HREN             */
      __IOM uint32_t T13HREN    : 1;            /*!< [9..9] Lost Indicator Enable for input signal T13HR - T13HREN             */
            uint32_t            : 3;
      __IOM uint32_t LBEEN      : 1;            /*!< [13..13] Interrupt Enable for Lost Bit Event - LBEEN                      */
      __IOM uint32_t INPLBE     : 2;            /*!< [15..14] Interrupt Node Pointer for lost bit event - INPLBE               */
            uint32_t            : 16;
    } bit;
  } LI;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000010C) Capture/Compare Interrupt Status Register 1                */
    
