popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t ICC70R     : 1;            /*!< [0..0] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint32_t ICC70F     : 1;            /*!< [1..1] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint32_t ICC71R     : 1;            /*!< [2..2] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint32_t ICC71F     : 1;            /*!< [3..3] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint32_t ICC72R     : 1;            /*!< [4..4] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint32_t ICC72F     : 1;            /*!< [5..5] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint32_t T12OM      : 1;            /*!< [6..6] Timer T12 One-Match Flag                                           */
      __IM  uint32_t T12PM      : 1;            /*!< [7..7] Timer T12 Period-Match Flag                                        */
      __IM  uint32_t T13CM      : 1;            /*!< [8..8] Timer T13 Compare-Match Flag                                       */
      __IM  uint32_t T13PM      : 1;            /*!< [9..9] Timer T13 Period-Match Flag                                        */
      __IM  uint32_t TRPF       : 1;            /*!< [10..10] Trap Flag                                                        */
      __IM  uint32_t TRPS       : 1;            /*!< [11..11] Trap State                                                       */
      __IM  uint32_t CHE        : 1;            /*!< [12..12] Correct Hall Event                                               */
      __IM  uint32_t WHE        : 1;            /*!< [13..13] Wrong Hall Event                                                 */
      __IM  uint32_t IDLE       : 1;            /*!< [14..14] IDLE State                                                       */
      __IM  uint32_t STR        : 1;            /*!< [15..15] Multi-Channel Mode Shadow Transfer Request                       */
            uint32_t            : 16;
    } bit;
  } IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000110) Capture/Compare Interrupt Status Set Register
                                                                    1                                                          */
    
    struct {
      __OM  uint32_t SCC70R     : 1;            /*!< [0..0] Set Capture, Compare-Match Rising Edge Flag                        */
      __OM  uint32_t SCC70F     : 1;            /*!< [1..1] Set Capture, Compare-Match Falling Edge Flag                       */
      __OM  uint32_t SCC71R     : 1;            /*!< [2..2] Set Capture, Compare-Match Rising Edge Flag                        */
      __OM  uint32_t SCC71F     : 1;            /*!< [3..3] Set Capture, Compare-Match Falling Edge Flag                       */
      __OM  uint32_t SCC72R     : 1;            /*!< [4..4] Set Capture, Compare-Match Rising Edge Flag                        */
      __OM  uint32_t SCC72F     : 1;            /*!< [5..5] Set Capture, Compare-Match Falling Edge Flag                       */
      __OM  uint32_t ST12OM     : 1;            /*!< [6..6] Set Timer T12 One-Match Flag                                       */
      __OM  uint32_t ST12PM     : 1;            /*!< [7..7] Set Timer T12 Period-Match Flag                                    */
      __OM  uint32_t ST13CM     : 1;            /*!< [8..8] Set Timer T13 Compare-Match Flag                                   */
      __OM  uint32_t ST13PM     : 1;            /*!< [9..9] Set Timer T13 Period-Match Flag                                    */
      __OM  uint32_t STRPF      : 1;            /*!< [10..10] Set Trap Flag                                                    */
      __OM  uint32_t SWHC       : 1;            /*!< [11..11] Software Hall Compare                                            */
      __OM  uint32_t SCHE       : 1;            /*!< [12..12] Set Correct Hall Event Flag                                      */
      __OM  uint32_t SWHE       : 1;            /*!< [13..13] Set Wrong Hall Event Flag                                        */
      __OM  uint32_t SIDLE      : 1;            /*!< [14..14] Set IDLE Flag                                                    */
      __OM  uint32_t SSTR       : 1;            /*!< [15..15] Set STR Flag                                                     */
            uint32_t            : 16;
    } bit;
  } ISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000114) Capture/Compare Interrupt Status Reset Register
                                                                    1                                                          */
    
    struct {
      __OM  uint32_t RCC70R     : 1;            /*!< [0..0] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint32_t RCC70F     : 1;            /*!< [1..1] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint32_t RCC71R     : 1;            /*!< [2..2] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint32_t RCC71F     : 1;            /*!< [3..3] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint32_t RCC72R     : 1;            /*!< [4..4] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint32_t RCC72F     : 1;            /*!< [5..5] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint32_t RT12OM     : 1;            /*!< [6..6] Reset Timer T12 One-Match Flag                                     */
      __OM  uint32_t RT12PM     : 1;            /*!< [7..7] Reset Timer T12 Period-Match Flag                                  */
      __OM  uint32_t RT13CM     : 1;            /*!< [8..8] Reset Timer T13 Compare-Match Flag                                 */
      __OM  uint32_t RT13PM     : 1;            /*!< [9..9] Reset Timer T13 Period-Match Flag                                  */
      __OM  uint32_t RTRPF      : 1;            /*!< [10..10] Reset Trap Flag                                                  */
            uint32_t            : 1;
      __OM  uint32_t RCHE       : 1;            /*!< [12..12] Reset Correct Hall Event Flag                                    */
      __OM  uint32_t RWHE       : 1;            /*!< [13..13] Reset Wrong Hall Event Flag                                      */
      __OM  uint32_t RIDLE      : 1;            /*!< [14..14] Reset IDLE Flag                                                  */
      __OM  uint32_t RSTR       : 1;            /*!< [15..15] Reset STR Flag                                                   */
            uint32_t            : 16;
    } bit;
  } ISR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000118) Capture/Compare Interrupt Node Pointer Register
                                                                    1                                                          */
    
