popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t INPCC70    : 2;            /*!< [1..0] Interrupt Node Pointer for Channel 0 Interrupts                    */
      __IOM uint32_t INPCC71    : 2;            /*!< [3..2] Interrupt Node Pointer for Channel 1 Interrupts                    */
      __IOM uint32_t INPCC72    : 2;            /*!< [5..4] Interrupt Node Pointer for Channel 2 Interrupts                    */
      __IOM uint32_t INPCHE     : 2;            /*!< [7..6] Interrupt Node Pointer for the CHE Interrupt                       */
      __IOM uint32_t INPERR     : 2;            /*!< [9..8] Interrupt Node Pointer for Error Interrupts                        */
      __IOM uint32_t INPT12     : 2;            /*!< [11..10] Interrupt Node Pointer for Timer T12 Interrupts                  */
      __IOM uint32_t INPT13     : 2;            /*!< [13..12] Interrupt Node Pointer for Timer T13 Interrupts                  */
            uint32_t            : 18;
    } bit;
  } INP;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000011C) Capture/Compare Interrupt Enable Register 1                */
    
    struct {
      __IOM uint32_t ENCC70R    : 1;            /*!< [0..0] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                     Channel 0                                                                 */
      __IOM uint32_t ENCC70F    : 1;            /*!< [1..1] Capture, Compare-Match Falling Edge Interrupt Enable
                                                     for Channel 0                                                             */
      __IOM uint32_t ENCC71R    : 1;            /*!< [2..2] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                     Channel 1                                                                 */
      __IOM uint32_t ENCC71F    : 1;            /*!< [3..3] Capture, Compare-Match Falling Edge Interrupt Enable
                                                     for Channel 1                                                             */
      __IOM uint32_t ENCC72R    : 1;            /*!< [4..4] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                     Channel 2                                                                 */
      __IOM uint32_t ENCC72F    : 1;            /*!< [5..5] Capture, Compare-Match Falling Edge Interrupt Enable
                                                     for Channel 2                                                             */
      __IOM uint32_t ENT12OM    : 1;            /*!< [6..6] Enable Interrupt for T12 One-Match                                 */
      __IOM uint32_t ENT12PM    : 1;            /*!< [7..7] Enable Interrupt for T12 Period-Match                              */
      __IOM uint32_t ENT13CM    : 1;            /*!< [8..8] Enable Interrupt for T13 Compare-Match                             */
      __IOM uint32_t ENT13PM    : 1;            /*!< [9..9] Enable Interrupt for T13 Period-Match                              */
      __IOM uint32_t ENTRPF     : 1;            /*!< [10..10] Enable Interrupt for Trap Flag                                   */
            uint32_t            : 1;
      __IOM uint32_t ENCHE      : 1;            /*!< [12..12] Enable Interrupt for Correct Hall Event                          */
      __IOM uint32_t ENWHE      : 1;            /*!< [13..13] Enable Interrupt for Wrong Hall Event                            */
      __IOM uint32_t ENIDLE     : 1;            /*!< [14..14] Enable Idle                                                      */
      __IOM uint32_t ENSTR      : 1;            /*!< [15..15] Enable Multi-Channel Mode Shadow Transfer Interrupt              */
            uint32_t            : 16;
    } bit;
  } IEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000120) Capture/Compare Interrupt Status Register 2                */
    
    struct {
      __IM  uint32_t ICC70BR    : 1;            /*!< [0..0] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint32_t ICC70BF    : 1;            /*!< [1..1] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint32_t ICC71BR    : 1;            /*!< [2..2] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint32_t ICC71BF    : 1;            /*!< [3..3] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint32_t ICC72BR    : 1;            /*!< [4..4] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint32_t ICC72BF    : 1;            /*!< [5..5] Capture, Compare-Match Falling Edge Flag                           */
            uint32_t            : 2;
      __IM  uint32_t T14CM      : 1;            /*!< [8..8] Timer T14 Compare-Match Flag                                       */
      __IM  uint32_t T14PM      : 1;            /*!< [9..9] Timer T14 Period-Match Flag                                        */
      __IM  uint32_t T15CM      : 1;            /*!< [10..10] Timer T15 Compare-Match Flag                                     */
      __IM  uint32_t T15PM      : 1;            /*!< [11..11] Timer T15 Period-Match Flag                                      */
      __IM  uint32_t T16CM      : 1;            /*!< [12..12] Timer T16 Compare-Match Flag                                     */
      __IM  uint32_t T16PM      : 1;            /*!< [13..13] Timer T16 Period-Match Flag                                      */
            uint32_t            : 18;
    } bit;
  } IS_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000124) Capture/Compare Interrupt Status Set Register
                                                                    2                                                          */
    
    struct {
      __OM  uint32_t SCC70BR    : 1;            /*!< [0..0] Set Capture, Compare-Match Rising Edge Flag                        */
      __OM  uint32_t SCC70BF    : 1;            /*!< [1..1] Set Capture, Compare-Match Falling Edge Flag                       */
      __OM  uint32_t SCC71BR    : 1;            /*!< [2..2] Set Capture, Compare-Match Rising Edge Flag                        */
      __OM  uint32_t SCC71BF    : 1;            /*!< [3..3] Set Capture, Compare-Match Falling Edge Flag                       */
      __OM  uint32_t SCC72BR    : 1;            /*!< [4..4] Set Capture, Compare-Match Rising Edge Flag                        */
      __OM  uint32_t SCC72BF    : 1;            /*!< [5..5] Set Capture, Compare-Match Falling Edge Flag                       */
            uint32_t            : 2;
      __OM  uint32_t ST14CM     : 1;            /*!< [8..8] Set Timer T14 Compare-Match Flag                                   */
      __OM  uint32_t ST14PM     : 1;            /*!< [9..9] Set Timer T14 Period-Match Flag                                    */
      __OM  uint32_t ST15CM     : 1;            /*!< [10..10] Set Timer T15 Compare-Match Flag                                 */
      __OM  uint32_t ST15PM     : 1;            /*!< [11..11] Set Timer T15 Period-Match Flag                                  */
      __OM  uint32_t ST16CM     : 1;            /*!< [12..12] Set Timer T16 Compare-Match Flag                                 */
      __OM  uint32_t ST16PM     : 1;            /*!< [13..13] Set Timer T16 Period-Match Flag                                  */
            uint32_t            : 18;
    } bit;
  } ISS_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000128) Capture/Compare Interrupt Status Reset Register
                                                                    2                                                          */
    
