popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t RCC70BR    : 1;            /*!< [0..0] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint32_t RCC70BF    : 1;            /*!< [1..1] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint32_t RCC71BR    : 1;            /*!< [2..2] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint32_t RCC71BF    : 1;            /*!< [3..3] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint32_t RCC72BR    : 1;            /*!< [4..4] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint32_t RCC72BF    : 1;            /*!< [5..5] Reset Capture, Compare-Match Falling Edge Flag                     */
            uint32_t            : 2;
      __OM  uint32_t RT14CM     : 1;            /*!< [8..8] Reset Timer T14 Compare-Match Flag                                 */
      __OM  uint32_t RT14PM     : 1;            /*!< [9..9] Reset Timer T14 Period-Match Flag                                  */
      __OM  uint32_t RT15CM     : 1;            /*!< [10..10] Reset Timer T15 Compare-Match Flag                               */
      __OM  uint32_t RT15PM     : 1;            /*!< [11..11] Reset Timer T15 Period-Match Flag                                */
      __OM  uint32_t RT16CM     : 1;            /*!< [12..12] Reset Timer T16 Compare-Match Flag                               */
      __OM  uint32_t RT16PM     : 1;            /*!< [13..13] Reset Timer T16 Period-Match Flag                                */
            uint32_t            : 18;
    } bit;
  } ISR_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000012C) Capture/Compare Interrupt Node Pointer Register
                                                                    2                                                          */
    
    struct {
      __IOM uint32_t INPCC70B   : 2;            /*!< [1..0] Interrupt Node Pointer for Channel 0 Interrupts                    */
      __IOM uint32_t INPCC71B   : 2;            /*!< [3..2] Interrupt Node Pointer for Channel 1 Interrupts                    */
      __IOM uint32_t INPCC72B   : 2;            /*!< [5..4] Interrupt Node Pointer for Channel 2 Interrupts                    */
            uint32_t            : 2;
      __IOM uint32_t INPT14     : 2;            /*!< [9..8] Interrupt Node Pointer for Timer T14 Interrupts                    */
      __IOM uint32_t INPT15     : 2;            /*!< [11..10] Interrupt Node Pointer for Timer T15 Interrupts                  */
      __IOM uint32_t INPT16     : 2;            /*!< [13..12] Interrupt Node Pointer for Timer T16 Interrupts                  */
            uint32_t            : 18;
    } bit;
  } INP_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000130) Capture/Compare Interrupt Enable Register 2                */
    
    struct {
      __IOM uint32_t ENCC70BR   : 1;            /*!< [0..0] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                     Channel 0                                                                 */
      __IOM uint32_t ENCC70BF   : 1;            /*!< [1..1] Capture, Compare-Match Falling Edge Interrupt Enable
                                                     for Channel 0                                                             */
      __IOM uint32_t ENCC71BR   : 1;            /*!< [2..2] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                     Channel 1                                                                 */
      __IOM uint32_t ENCC71BF   : 1;            /*!< [3..3] Capture, Compare-Match Falling Edge Interrupt Enable
                                                     for Channel 1                                                             */
      __IOM uint32_t ENCC72BR   : 1;            /*!< [4..4] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                     Channel 2                                                                 */
      __IOM uint32_t ENCC72BF   : 1;            /*!< [5..5] Capture, Compare-Match Falling Edge Interrupt Enable
                                                     for Channel 2                                                             */
            uint32_t            : 2;
      __IOM uint32_t ENT14CM    : 1;            /*!< [8..8] Enable Interrupt for T14 Compare-Match                             */
      __IOM uint32_t ENT14PM    : 1;            /*!< [9..9] Enable Interrupt for T14 Period-Match                              */
      __IOM uint32_t ENT15CM    : 1;            /*!< [10..10] Enable Interrupt for T15 Compare-Match                           */
      __IOM uint32_t ENT15PM    : 1;            /*!< [11..11] Enable Interrupt for T15 Period-Match                            */
      __IOM uint32_t ENT16CM    : 1;            /*!< [12..12] Enable Interrupt for T16 Compare-Match                           */
      __IOM uint32_t ENT16PM    : 1;            /*!< [13..13] Enable Interrupt for T16 Period-Match                            */
            uint32_t            : 18;
    } bit;
  } IEN_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000134) OCDS Control and Status Register                           */
    
    struct {
            uint32_t            : 24;
      __IOM uint32_t SUS        : 4;            /*!< [27..24] OCDS Suspend Control - SUS                                       */
      __OM  uint32_t SUS_P      : 1;            /*!< [28..28] SUS Write Protection - SUS_P                                     */
      __IM  uint32_t SUSSTA     : 1;            /*!< [29..29] Suspend State - SUSSTA                                           */
            uint32_t            : 2;
    } bit;
  } OCS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000138) Fractional Divider$x                                       */
    
