popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t PQ         : 16;           /*!< [15..0] PQ                                                                */
            uint32_t            : 16;
    } bit;
  } T_FDIV0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000013C) Fractional Divider$x                                       */
    
    struct {
      __IOM uint32_t PQ         : 16;           /*!< [15..0] PQ                                                                */
            uint32_t            : 16;
    } bit;
  } T_FDIV1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000140) Timer Clock Selection                                      */
    
    struct {
      __IOM uint32_t T12_CLK_SEL : 2;           /*!< [1..0] Clock selector for Timer 12                                        */
      __IOM uint32_t T13_CLK_SEL : 2;           /*!< [3..2] Clock selector for Timer 13                                        */
      __IOM uint32_t T14_CLK_SEL : 2;           /*!< [5..4] Clock selector for Timer 14                                        */
      __IOM uint32_t T15_CLK_SEL : 2;           /*!< [7..6] Clock selector for Timer 15                                        */
      __IOM uint32_t T16_CLK_SEL : 2;           /*!< [9..8] Clock selector for Timer 16                                        */
      __IOM uint32_t DT_CLK_SEL : 2;            /*!< [11..10] Clock Selector for dead time control                             */
      __IOM uint32_t FDIV0_SEL  : 1;            /*!< [12..12] FDIV0 Mode Selection                                             */
      __IOM uint32_t FDIV1_SEL  : 1;            /*!< [13..13] FDIV1 Mode Selection                                             */
            uint32_t            : 18;
    } bit;
  } T_CLK_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000144) Timer Control Register 3                                   */
    
    struct {
      __OM  uint32_t T12STR     : 1;            /*!< [0..0] Timer T12 Shadow Transfer Request                                  */
      __OM  uint32_t T13STR     : 1;            /*!< [1..1] Timer T13 Shadow Transfer Request                                  */
      __OM  uint32_t T14STR     : 1;            /*!< [2..2] Timer T14 Shadow Transfer Request                                  */
      __OM  uint32_t T15STR     : 1;            /*!< [3..3] Timer T15 Shadow Transfer Request                                  */
      __OM  uint32_t T16STR     : 1;            /*!< [4..4] Timer T16 Shadow Transfer Request                                  */
            uint32_t            : 3;
      __OM  uint32_t T12STD     : 1;            /*!< [8..8] Timer T12 Shadow Transfer Disable                                  */
      __OM  uint32_t T13STD     : 1;            /*!< [9..9] Timer T13 Shadow Transfer Disable                                  */
      __OM  uint32_t T14STD     : 1;            /*!< [10..10] Timer T14 Shadow Transfer Disable                                */
      __OM  uint32_t T15STD     : 1;            /*!< [11..11] Timer T15 Shadow Transfer Disable                                */
      __OM  uint32_t T16STD     : 1;            /*!< [12..12] Timer T16 Shadow Transfer Disable                                */
            uint32_t            : 19;
    } bit;
  } TCTR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000148) Interupt gating Register                                   */
    
    struct {
      __IOM uint32_t GT0        : 2;            /*!< [1..0] Gating SR0                                                         */
            uint32_t            : 2;
      __IOM uint32_t GT1        : 2;            /*!< [5..4] Gating SR1                                                         */
            uint32_t            : 2;
      __IOM uint32_t GT2        : 2;            /*!< [9..8] Gating SR2                                                         */
            uint32_t            : 2;
      __IOM uint32_t GT3        : 2;            /*!< [13..12] Gating SR3                                                       */
            uint32_t            : 18;
    } bit;
  } IGT;
} CCU7_Type;                                    /*!< Size = 332 (0x14c)                                                        */



/* =========================================================================================================================== */
/* ================                                            CPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CPU (CPU)
  */

typedef struct {                                /*!< (@ 0xE000E000) CPU Structure                                              */
  __IM  uint32_t  RESERVED;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000004) Interrupt Controller Type                                  */
    
    struct {
      __IM  uint32_t INTLINESNUM : 5;           /*!< [4..0] Total number of interrupt lines                                    */
            uint32_t            : 27;
    } bit;
  } ICT;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) SysTick Control and Status                                 */
    
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< [0..0] SysTick counter enable                                             */
      __IOM uint32_t TICKINT    : 1;            /*!< [1..1] TICKINT                                                            */
      __IOM uint32_t CLKSOURCE  : 1;            /*!< [2..2] CLK SysTick timer clock source selection                           */
            uint32_t            : 13;
      __IM  uint32_t COUNTFLAG  : 1;            /*!< [16..16] Count Flag                                                       */
            uint32_t            : 15;
    } bit;
  } SYSTICK_CS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) SysTick Reload Value                                       */
    
