popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t RELOAD     : 24;           /*!< [23..0] Reload value for SysTick                                          */
            uint32_t            : 8;
    } bit;
  } SYSTICK_RL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) SysTick Current Value                                      */
    
    struct {
      __IOM uint32_t CURRENT    : 24;           /*!< [23..0] Current value of SysTick                                          */
            uint32_t            : 8;
    } bit;
  } SYSTICK_CUR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000001C) SysTick Calibration Value                                  */
    
    struct {
      __IM  uint32_t TENMS      : 24;           /*!< [23..0] Reload value used for 10 ms timing                                */
            uint32_t            : 6;
      __IM  uint32_t SKEW       : 1;            /*!< [30..30] Skew                                                             */
      __IM  uint32_t NOREF      : 1;            /*!< [31..31] Presence of a reference clock                                    */
    } bit;
  } SYSTICK_CAL;
  __IM  uint32_t  RESERVED2[56];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) Interrupt Set-Enable                                       */
    
    struct {
      __IOM uint32_t IRQEN0     : 1;            /*!< [0..0] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN1     : 1;            /*!< [1..1] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN2     : 1;            /*!< [2..2] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN3     : 1;            /*!< [3..3] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN4     : 1;            /*!< [4..4] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN5     : 1;            /*!< [5..5] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN6     : 1;            /*!< [6..6] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN7     : 1;            /*!< [7..7] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN8     : 1;            /*!< [8..8] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN9     : 1;            /*!< [9..9] IRQx interrupt set enable                                          */
      __IOM uint32_t IRQEN10    : 1;            /*!< [10..10] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN11    : 1;            /*!< [11..11] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN12    : 1;            /*!< [12..12] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN13    : 1;            /*!< [13..13] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN14    : 1;            /*!< [14..14] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN15    : 1;            /*!< [15..15] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN16    : 1;            /*!< [16..16] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN17    : 1;            /*!< [17..17] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN18    : 1;            /*!< [18..18] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN19    : 1;            /*!< [19..19] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN20    : 1;            /*!< [20..20] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN21    : 1;            /*!< [21..21] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN22    : 1;            /*!< [22..22] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN23    : 1;            /*!< [23..23] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN24    : 1;            /*!< [24..24] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN25    : 1;            /*!< [25..25] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN26    : 1;            /*!< [26..26] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN27    : 1;            /*!< [27..27] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN28    : 1;            /*!< [28..28] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN29    : 1;            /*!< [29..29] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN30    : 1;            /*!< [30..30] IRQx interrupt set enable                                        */
      __IOM uint32_t IRQEN31    : 1;            /*!< [31..31] IRQx interrupt set enable                                        */
    } bit;
  } NVIC_ISER;
  __IM  uint32_t  RESERVED3[31];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) Interrupt Clear-Enable                                     */
    
    struct {
      __IOM uint32_t IRQCLREN0  : 1;            /*!< [0..0] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN1  : 1;            /*!< [1..1] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN2  : 1;            /*!< [2..2] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN3  : 1;            /*!< [3..3] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN4  : 1;            /*!< [4..4] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN5  : 1;            /*!< [5..5] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN6  : 1;            /*!< [6..6] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN7  : 1;            /*!< [7..7] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN8  : 1;            /*!< [8..8] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN9  : 1;            /*!< [9..9] IRQx interrupt clear enable                                        */
      __IOM uint32_t IRQCLREN10 : 1;            /*!< [10..10] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN11 : 1;            /*!< [11..11] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN12 : 1;            /*!< [12..12] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN13 : 1;            /*!< [13..13] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN14 : 1;            /*!< [14..14] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN15 : 1;            /*!< [15..15] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN16 : 1;            /*!< [16..16] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN17 : 1;            /*!< [17..17] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN18 : 1;            /*!< [18..18] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN19 : 1;            /*!< [19..19] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN20 : 1;            /*!< [20..20] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN21 : 1;            /*!< [21..21] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN22 : 1;            /*!< [22..22] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN23 : 1;            /*!< [23..23] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN24 : 1;            /*!< [24..24] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN25 : 1;            /*!< [25..25] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN26 : 1;            /*!< [26..26] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN27 : 1;            /*!< [27..27] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN28 : 1;            /*!< [28..28] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN29 : 1;            /*!< [29..29] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN30 : 1;            /*!< [30..30] IRQx interrupt clear enable                                      */
      __IOM uint32_t IRQCLREN31 : 1;            /*!< [31..31] IRQx interrupt clear enable                                      */
    } bit;
  } NVIC_ICER;
  __IM  uint32_t  RESERVED4[31];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000200) Interrupt Set-Pending                                      */
    
