popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t IRQSETPEND0 : 1;           /*!< [0..0] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND1 : 1;           /*!< [1..1] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND2 : 1;           /*!< [2..2] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND3 : 1;           /*!< [3..3] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND4 : 1;           /*!< [4..4] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND5 : 1;           /*!< [5..5] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND6 : 1;           /*!< [6..6] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND7 : 1;           /*!< [7..7] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND8 : 1;           /*!< [8..8] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND9 : 1;           /*!< [9..9] IRQx interrupt set pending                                         */
      __IOM uint32_t IRQSETPEND10 : 1;          /*!< [10..10] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND11 : 1;          /*!< [11..11] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND12 : 1;          /*!< [12..12] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND13 : 1;          /*!< [13..13] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND14 : 1;          /*!< [14..14] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND15 : 1;          /*!< [15..15] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND16 : 1;          /*!< [16..16] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND17 : 1;          /*!< [17..17] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND18 : 1;          /*!< [18..18] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND19 : 1;          /*!< [19..19] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND20 : 1;          /*!< [20..20] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND21 : 1;          /*!< [21..21] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND22 : 1;          /*!< [22..22] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND23 : 1;          /*!< [23..23] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND24 : 1;          /*!< [24..24] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND25 : 1;          /*!< [25..25] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND26 : 1;          /*!< [26..26] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND27 : 1;          /*!< [27..27] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND28 : 1;          /*!< [28..28] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND29 : 1;          /*!< [29..29] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND30 : 1;          /*!< [30..30] IRQx interrupt set pending                                       */
      __IOM uint32_t IRQSETPEND31 : 1;          /*!< [31..31] IRQx interrupt set pending                                       */
    } bit;
  } NVIC_ISPR;
  __IM  uint32_t  RESERVED5[31];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000280) Interrupt Clear-Pending                                    */
    
    struct {
      __IOM uint32_t IRQCLRPEND0 : 1;           /*!< [0..0] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND1 : 1;           /*!< [1..1] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND2 : 1;           /*!< [2..2] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND3 : 1;           /*!< [3..3] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND4 : 1;           /*!< [4..4] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND5 : 1;           /*!< [5..5] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND6 : 1;           /*!< [6..6] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND7 : 1;           /*!< [7..7] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND8 : 1;           /*!< [8..8] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND9 : 1;           /*!< [9..9] IRQx interrupt clear pending                                       */
      __IOM uint32_t IRQCLRPEND10 : 1;          /*!< [10..10] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND11 : 1;          /*!< [11..11] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND12 : 1;          /*!< [12..12] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND13 : 1;          /*!< [13..13] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND14 : 1;          /*!< [14..14] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND15 : 1;          /*!< [15..15] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND16 : 1;          /*!< [16..16] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND17 : 1;          /*!< [17..17] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND18 : 1;          /*!< [18..18] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND19 : 1;          /*!< [19..19] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND20 : 1;          /*!< [20..20] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND21 : 1;          /*!< [21..21] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND22 : 1;          /*!< [22..22] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND23 : 1;          /*!< [23..23] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND24 : 1;          /*!< [24..24] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND25 : 1;          /*!< [25..25] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND26 : 1;          /*!< [26..26] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND27 : 1;          /*!< [27..27] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND28 : 1;          /*!< [28..28] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND29 : 1;          /*!< [29..29] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND30 : 1;          /*!< [30..30] IRQx interrupt clear pending                                     */
      __IOM uint32_t IRQCLRPEND31 : 1;          /*!< [31..31] IRQx interrupt clear pending                                     */
    } bit;
  } NVIC_ICPR;
  __IM  uint32_t  RESERVED6[31];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000300) Active Bit Register                                        */
    
