popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t IRQACTIVE0 : 1;            /*!< [0..0] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE1 : 1;            /*!< [1..1] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE2 : 1;            /*!< [2..2] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE3 : 1;            /*!< [3..3] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE4 : 1;            /*!< [4..4] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE5 : 1;            /*!< [5..5] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE6 : 1;            /*!< [6..6] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE7 : 1;            /*!< [7..7] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE8 : 1;            /*!< [8..8] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE9 : 1;            /*!< [9..9] IRQx interrupt active flag                                         */
      __IM  uint32_t IRQACTIVE10 : 1;           /*!< [10..10] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE11 : 1;           /*!< [11..11] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE12 : 1;           /*!< [12..12] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE13 : 1;           /*!< [13..13] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE14 : 1;           /*!< [14..14] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE15 : 1;           /*!< [15..15] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE16 : 1;           /*!< [16..16] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE17 : 1;           /*!< [17..17] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE18 : 1;           /*!< [18..18] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE19 : 1;           /*!< [19..19] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE20 : 1;           /*!< [20..20] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE21 : 1;           /*!< [21..21] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE22 : 1;           /*!< [22..22] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE23 : 1;           /*!< [23..23] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE24 : 1;           /*!< [24..24] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE25 : 1;           /*!< [25..25] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE26 : 1;           /*!< [26..26] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE27 : 1;           /*!< [27..27] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE28 : 1;           /*!< [28..28] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE29 : 1;           /*!< [29..29] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE30 : 1;           /*!< [30..30] IRQx interrupt active flag                                       */
      __IM  uint32_t IRQACTIVE31 : 1;           /*!< [31..31] IRQx interrupt active flag                                       */
    } bit;
  } NVIC_IABR;
  __IM  uint32_t  RESERVED7[63];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000400) Interrupt Priority                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N0     : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N1     : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N2     : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N3     : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000404) Interrupt Priority                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N4     : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N5     : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N6     : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N7     : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000408) Interrupt Priority                                         */
    
