popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N8     : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N9     : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N10    : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N11    : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000040C) Interrupt Priority                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N12    : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N13    : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N14    : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N15    : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000410) Interrupt Priority                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N16    : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N17    : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N18    : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N19    : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000414) Interrupt Priority                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N20    : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N21    : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N22    : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N23    : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000418) Interrupt Priority                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N24    : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N25    : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N26    : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N27    : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000041C) Interrupt Priority                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_N28    : 5;            /*!< [7..3] IRQx interrupt priority                                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_N29    : 5;            /*!< [15..11] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N30    : 5;            /*!< [23..19] IRQx interrupt priority                                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_N31    : 5;            /*!< [31..27] IRQx interrupt priority                                          */
    } bit;
  } NVIC_IPR7;
  __IM  uint32_t  RESERVED8[568];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000D00) CPU ID Base Register                                       */
    
    struct {
      __IM  uint32_t REVISION   : 4;            /*!< [3..0] Revision Number                                                    */
      __IM  uint32_t PARTNO     : 12;           /*!< [15..4] Part Number                                                       */
      __IM  uint32_t ARCHITECTURE : 4;          /*!< [19..16] Architecture                                                     */
      __IM  uint32_t VARIANT    : 4;            /*!< [23..20] Variant Number                                                   */
      __IM  uint32_t IMPLEMENTER : 8;           /*!< [31..24] Implementer Code                                                 */
    } bit;
  } CPUID;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D04) Interrupt Control State Register                           */
    
    struct {
      __IM  uint32_t VECTACTIVE : 9;            /*!< [8..0] Active exception number                                            */
            uint32_t            : 2;
      __IM  uint32_t RETTOBASE  : 1;            /*!< [11..11] Presence of preempted active exceptions                          */
      __IM  uint32_t VECTPending : 9;           /*!< [20..12] Exception number with the highest priority pending
                                                     enabled exception                                                         */
            uint32_t            : 1;
      __IM  uint32_t ISRPending : 1;            /*!< [22..22] External interrupt generated by the NVIC pending flag            */
      __IM  uint32_t ISRPREEMPT : 1;            /*!< [23..23] Service of a pending exception on exit from debug halt
                                                     state                                                                     */
            uint32_t            : 1;
      __IOM uint32_t PENDSTCLR  : 1;            /*!< [25..25] SysTick exception clear pending                                  */
      __IOM uint32_t PENDSTSET  : 1;            /*!< [26..26] SysTick exception set pending                                    */
      __IOM uint32_t PENDSVCLR  : 1;            /*!< [27..27] PendSV clear pending                                             */
      __IOM uint32_t PENDSVSET  : 1;            /*!< [28..28] PendSV set pending                                               */
            uint32_t            : 2;
      __IOM uint32_t NMIPENDSET : 1;            /*!< [31..31] NMI set pending                                                  */
    } bit;
  } ICSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D08) Vector Table Offset Register                               */
    
