popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
            uint32_t            : 7;
      __IOM uint32_t TBLOFF     : 25;           /*!< [31..7] Vector Table Offset                                               */
    } bit;
  } VTOR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D0C) Application Interrupt/Reset Control Register               */
    
    struct {
      __IOM uint32_t VECTRESET  : 1;            /*!< [0..0] Local system reset                                                 */
      __IOM uint32_t VECTCLRACTIVE : 1;         /*!< [1..1] Active status information clear for fixed and configurable
                                                     exception                                                                 */
      __IOM uint32_t SYSRESETREQ : 1;           /*!< [2..2] System Reset Request                                               */
            uint32_t            : 5;
      __IOM uint32_t PRIGROUP   : 3;            /*!< [10..8] Priority Grouping                                                 */
            uint32_t            : 4;
      __IM  uint32_t ENDIANNESS : 1;            /*!< [15..15] Data endianness
                                                                                                                               */
      __IOM uint32_t VECTKEY    : 16;           /*!< [31..16] Vector Key                                                       */
    } bit;
  } AIRCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D10) System Control Register                                    */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t SLEEPONEXIT : 1;           /*!< [1..1] Sleep on exit when returning from Handler mode to Thread
                                                     mode                                                                      */
      __IOM uint32_t SLEEPDEEP  : 1;            /*!< [2..2] Selection of sleep mode or deep sleep mode as low power
                                                     mode                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SEVONPEND  : 1;            /*!< [4..4] Send event on pending                                              */
            uint32_t            : 27;
    } bit;
  } SCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D14) Configuration Control Register                             */
    
    struct {
      __IOM uint32_t NONBASETHRDENA : 1;        /*!< [0..0] Control of the processor entry point into the Thread
                                                     mode                                                                      */
      __IOM uint32_t USERSETMPEND : 1;          /*!< [1..1] Unprivileged software access to the STIR enable                    */
            uint32_t            : 1;
      __IOM uint32_t UNALIGN_TRP : 1;           /*!< [3..3] Unaligned access traps enable                                      */
      __IOM uint32_t DIV_0_TRP  : 1;            /*!< [4..4] Trap divide by zero enable                                         */
            uint32_t            : 3;
      __IOM uint32_t BFHFMIGN   : 1;            /*!< [8..8] Effect of precise data access faults on handlers running
                                                     at a priority -1 or -2                                                    */
      __IOM uint32_t STKALIGN   : 1;            /*!< [9..9] Stack frame alignment on exception entry                           */
            uint32_t            : 22;
    } bit;
  } CCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D18) System Handler Priority Register 1                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_4      : 5;            /*!< [7..3] Priority of System Handler 4, MemManage                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_5      : 5;            /*!< [15..11] Priority of System Handler 5, BusFault                           */
            uint32_t            : 3;
      __IOM uint32_t PRI_6      : 5;            /*!< [23..19] Priority of System Handler 6, UsageFault                         */
            uint32_t            : 3;
      __IOM uint32_t PRI_7      : 5;            /*!< [31..27] Reserved for Priority of System Handler 7                        */
    } bit;
  } SHPR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D1C) System Handler Priority Register 2                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_8      : 5;            /*!< [7..3] Reserved for Priority of System Handler 8                          */
            uint32_t            : 3;
      __IOM uint32_t PRI_9      : 5;            /*!< [15..11] Reserved for Priority of System Handler 9                        */
            uint32_t            : 3;
      __IOM uint32_t PRI_10     : 5;            /*!< [23..19] Reserved for Priority of System Handler 10                       */
            uint32_t            : 3;
      __IOM uint32_t PRI_11     : 5;            /*!< [31..27] Priority of System Handler 11, SVCall                            */
    } bit;
  } SHPR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D20) System Handler Priority Register 3                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PRI_12     : 5;            /*!< [7..3] Priority of System Handler 12, DebugMonitor                        */
            uint32_t            : 3;
      __IOM uint32_t PRI_13     : 5;            /*!< [15..11] Reserved for Priority of System Handler 13                       */
            uint32_t            : 3;
      __IOM uint32_t PRI_14     : 5;            /*!< [23..19] Priority of System Handler 14, PendSV                            */
            uint32_t            : 3;
      __IOM uint32_t PRI_15     : 5;            /*!< [31..27] Priority of System Handler 15, SysTick                           */
    } bit;
  } SHPR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D24) System Handler Control and State Register                  */
    
