popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t MEMFAULTACT : 1;           /*!< [0..0] MemManage exception status                                         */
      __IOM uint32_t BUSFAULTACT : 1;           /*!< [1..1] BusFault exception status                                          */
            uint32_t            : 1;
      __IOM uint32_t USGFAULTACT : 1;           /*!< [3..3] UsageFault exception status                                        */
            uint32_t            : 3;
      __IOM uint32_t SVCALLACT  : 1;            /*!< [7..7] SVCall status                                                      */
      __IOM uint32_t MONITORACT : 1;            /*!< [8..8] Debug monitor status                                               */
            uint32_t            : 1;
      __IOM uint32_t PENDSVACT  : 1;            /*!< [10..10] PendSV exception status                                          */
      __IOM uint32_t SYSTICKACT : 1;            /*!< [11..11] SysTick exception status                                         */
      __IOM uint32_t USGFAULTPENDED : 1;        /*!< [12..12] UsageFault exception pending status                              */
      __IOM uint32_t MEMFAULTPENDED : 1;        /*!< [13..13] MemManage exception pending status                               */
      __IOM uint32_t BUSFAULTPENDED : 1;        /*!< [14..14] BusFault exception pending status                                */
      __IOM uint32_t SVCALLPENDED : 1;          /*!< [15..15] SVCall exception pending status                                  */
      __IOM uint32_t MEMFAULTENA : 1;           /*!< [16..16] MemManage enable                                                 */
      __IOM uint32_t BUSFAULTENA : 1;           /*!< [17..17] BusFault enable                                                  */
      __IOM uint32_t USGFAULTENA : 1;           /*!< [18..18] UsageFault enable                                                */
            uint32_t            : 13;
    } bit;
  } SHCSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D28) Configurable Fault Status Register                         */
    
    struct {
      __IOM uint32_t IACCVIOL   : 1;            /*!< [0..0] Instruction access violation flag                                  */
      __IOM uint32_t DACCVIOL   : 1;            /*!< [1..1] Data access violation flag                                         */
            uint32_t            : 1;
      __IOM uint32_t MUNSTKERR  : 1;            /*!< [3..3] MemManage fault on unstacking for a return from exception          */
      __IOM uint32_t MSTERR     : 1;            /*!< [4..4] MemManage fault on stacking for exception entry                    */
      __IOM uint32_t MLSPERR    : 1;            /*!< [5..5] MemManage fault during FP lazy state preservation                  */
            uint32_t            : 1;
      __IOM uint32_t MMARVALID  : 1;            /*!< [7..7] MemManage Fault Address Register (MMFAR) valid flag                */
      __IOM uint32_t IBUSERR    : 1;            /*!< [8..8] Instruction bus error                                              */
      __IOM uint32_t PRECISERR  : 1;            /*!< [9..9] Precise data bus error                                             */
      __IOM uint32_t IMPRECISERR : 1;           /*!< [10..10] Imprecise data bus error                                         */
      __IOM uint32_t UNSTKERR   : 1;            /*!< [11..11] BusFault on unstacking for a return from exception               */
      __IOM uint32_t STKERR     : 1;            /*!< [12..12] BusFault on stacking for exception entry                         */
      __IOM uint32_t LSPERR     : 1;            /*!< [13..13] BusFault during FP lazy state preservation                       */
            uint32_t            : 1;
      __IOM uint32_t BFARVALID  : 1;            /*!< [15..15] BusFault Address Register (BFAR) valid flag                      */
      __IOM uint32_t UNDEFINSTR : 1;            /*!< [16..16] Undefined instruction UsageFault                                 */
      __IOM uint32_t INVSTATE   : 1;            /*!< [17..17] Invalid state UsageFault                                         */
      __IOM uint32_t INVPC      : 1;            /*!< [18..18] Invalid PC load UsageFault                                       */
      __IOM uint32_t NOCP       : 1;            /*!< [19..19] No coprocessor UsageFault                                        */
            uint32_t            : 4;
      __IOM uint32_t UNALIGNED  : 1;            /*!< [24..24] Unaligned access UsageFault                                      */
      __IOM uint32_t DIVBYZERO  : 1;            /*!< [25..25] Divide by zero UsageFault                                        */
            uint32_t            : 6;
    } bit;
  } CFSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D2C) Hard Fault Status Register                                 */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t VECTTBL    : 1;            /*!< [1..1] BusFault flag on a vector table read during exception
                                                     processing                                                                */
            uint32_t            : 28;
      __IOM uint32_t FORCED     : 1;            /*!< [30..30] Forced HardFault flag                                            */
      __IOM uint32_t DEBUGEVT   : 1;            /*!< [31..31] Debug Event                                                      */
    } bit;
  } HFSR;
  __IM  uint32_t  RESERVED9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D34) MemManage Fault Address Register                           */
    
    struct {
      __IOM uint32_t ADDRESS    : 32;           /*!< [31..0] Address of the location that generated a MemManage fault          */
    } bit;
  } MMFAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D38) Bus Fault Address Register                                 */
    
