popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t ADDRESS    : 32;           /*!< [31..0] Address of the location that generated a BusFault                 */
    } bit;
  } BFAR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000D3C) Auxiliary Fault Status Register                            */
    
    struct {
      __IM  uint32_t AUXFAULT   : 32;           /*!< [31..0] Additional system fault information                               */
    } bit;
  } AFSR;
  __IM  uint32_t  RESERVED10[112];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000F00) Software Triggered Interrupt                               */
    
    struct {
      __OM  uint32_t INTID      : 9;            /*!< [8..0] Interrupt ID to be triggered. The value written is (ExceptionNumber
                                                     - 16)                                                                     */
            uint32_t            : 23;
    } bit;
  } STIR;
} CPU_Type;                                     /*!< Size = 3844 (0xf04)                                                       */



/* =========================================================================================================================== */
/* ================                                          CSACSC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CSA and CSC (CSACSC)
  */

typedef struct {                                /*!< (@ 0x40010000) CSACSC Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Current sense amplifier and comparator control             */
    
    struct {
      __IOM uint32_t CSAC_EN    : 1;            /*!< [0..0] Current sense amplifier and comparator enable                      */
            uint32_t            : 7;
      __IOM uint32_t GAIN_MIN   : 4;            /*!< [11..8] Current sense amplifier minimum gain setting                      */
      __IOM uint32_t OFFS_MIN   : 4;            /*!< [15..12] Current sense amplifier minimum output offset setting            */
      __IOM uint32_t THR_MAX    : 10;           /*!< [25..16] Current sense comparator maximum threshold setting               */
            uint32_t            : 6;
    } bit;
  } CTRL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Current sense amplifier and comparator control             */
    
    struct {
      __IOM uint32_t ADD_INP_OFFS : 1;          /*!< [0..0] Additional input offset setting                                    */
      __IOM uint32_t GAIN_SEL   : 2;            /*!< [2..1] Current sense amplifier gain setting                               */
      __IOM uint32_t OFFS_SEL   : 2;            /*!< [4..3] Current sense amplifier output offset setting                      */
            uint32_t            : 3;
      __IOM uint32_t VOUT_SEL   : 1;            /*!< [8..8] Current sense output selection                                     */
            uint32_t            : 7;
      __IOM uint32_t THR_SEL    : 5;            /*!< [20..16] Current sense comparator threshold setting                       */
            uint32_t            : 3;
      __IOM uint32_t TFILT_SEL  : 2;            /*!< [25..24] Filter time for current sense comparator                         */
            uint32_t            : 6;
    } bit;
  } CTRL2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Current sense amplifier/comparator interrupt
                                                                    status                                                     */
    
    struct {
      __IM  uint32_t CSC_OC_IS  : 1;            /*!< [0..0] Overcurrent event interrupt status                                 */
      __IM  uint32_t SEL_ERR_IS : 1;            /*!< [1..1] CSA minimum gain or offset selection error interrupt
                                                     status                                                                    */
            uint32_t            : 14;
      __IM  uint32_t CSC_OC_STS : 1;            /*!< [16..16] Overcurrent event status                                         */
            uint32_t            : 7;
      __IM  uint32_t CSC_OC_OUT : 1;            /*!< [24..24] Overcurrent comparator output                                    */
      __IM  uint32_t CSC_BIST_STS : 1;          /*!< [25..25] CSC built-in self test status                                    */
            uint32_t            : 6;
    } bit;
  } IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Current sense amplifier/comparator interrupt
                                                                    status clear                                               */
    
    struct {
      __OM  uint32_t CSC_OC_ISC : 1;            /*!< [0..0] Overcurrent event interrupt status clear                           */
      __OM  uint32_t SEL_ERR_ISC : 1;           /*!< [1..1] CSA minimum gain or offset selection error interrupt
                                                     status clear                                                              */
            uint32_t            : 14;
      __OM  uint32_t CSC_OC_SC  : 1;            /*!< [16..16] Overcurrent event status clear                                   */
            uint32_t            : 15;
    } bit;
  } IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Current sense amplifier/comparator interrupt
                                                                    status set                                                 */
    
    struct {
      __OM  uint32_t CSC_OC_ISS : 1;            /*!< [0..0] Overcurrent event interrupt status set                             */
      __OM  uint32_t SEL_ERR_ISS : 1;           /*!< [1..1] CSA minimum gain or offset selection error interrupt
                                                     status set                                                                */
            uint32_t            : 14;
      __OM  uint32_t CSC_OC_SS  : 1;            /*!< [16..16] Overcurrent event status set                                     */
            uint32_t            : 15;
    } bit;
  } IRQSET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Current sense amplifier/comparator interrupt
                                                                    enable                                                     */
    
