popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CSC_OC_IEN : 1;            /*!< [0..0] Overcurrent event interrupt enable                                 */
      __IOM uint32_t SEL_ERR_IEN : 1;           /*!< [1..1] CSA minimum gain or offset selection error interrupt
                                                     enable                                                                    */
            uint32_t            : 30;
    } bit;
  } IRQEN;
} CSACSC_Type;                                  /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA (DMA)
  */

typedef struct {                                /*!< (@ 0x48034000) DMA Structure                                              */
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000000) DMA Status Register                                        */
    
    struct {
      __IM  uint32_t MASTER_ENABLE : 1;         /*!< [0..0] Controller Status Enable                                           */
            uint32_t            : 3;
      __IM  uint32_t STATE      : 4;            /*!< [7..4] Current State of the Control State Machine                         */
            uint32_t            : 8;
      __IM  uint32_t CHNLS_MINUS1 : 5;          /*!< [20..16] Number of DMA Channels                                           */
            uint32_t            : 11;
    } bit;
  } DMA_STATUS;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000004) DMA Configuration Register                                 */
    
    struct {
      __OM  uint32_t MASTER_ENABLE : 1;         /*!< [0..0] DMA Controller Enable                                              */
            uint32_t            : 4;
      __OM  uint32_t CHN1_PROT_CTRL : 3;        /*!< [7..5] AHB Protection                                                     */
            uint32_t            : 24;
    } bit;
  } DMA_CFG;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Channel Control Data Base Pointer Register                 */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t CTRL_BASE_PTR : 24;        /*!< [31..8] Pointer to the base address of the primary data structure         */
    } bit;
  } CTRL_BASE_PTR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Channel Alternate Control Data Base Pointer Register       */
    
    struct {
      __IM  uint32_t ALT_CTRL_BASE_PTR : 32;    /*!< [31..0] Base Address of the Alternate Data Structure                      */
    } bit;
  } ALT_CTRL_BASE_PTR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) Channel Wait on Request Status Register                    */
    
    struct {
      __IM  uint32_t DMA_WAITONREQ_STATUS : 8;  /*!< [7..0] Channel Wait on Request Status                                     */
            uint32_t            : 24;
    } bit;
  } DMA_WAITONREQ_STATUS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Channel Software Request Register                          */
    
    struct {
      __OM  uint32_t CHNL_SW_REQUEST : 8;       /*!< [7..0] Software DMA Request                                               */
            uint32_t            : 24;
    } bit;
  } CHNL_SW_REQUEST;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Channel Useburst Set Register                              */
    
    struct {
      __IOM uint32_t CHNL_USEBURST_SET : 8;     /*!< [7..0] Channel Useburst Set                                               */
            uint32_t            : 24;
    } bit;
  } CHNL_USEBURST_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Channel Useburst Clear Register                            */
    
    struct {
      __OM  uint32_t CHNL_USEBURST_CLR : 8;     /*!< [7..0] Channel Useburst Clear                                             */
            uint32_t            : 24;
    } bit;
  } CHNL_USEBURST_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Channel Request Mask Set Register                          */
    
    struct {
      __IOM uint32_t CHNL_REQ_MASK_SET : 8;     /*!< [7..0] Channel Request Mask Set                                           */
            uint32_t            : 24;
    } bit;
  } CHNL_REQ_MASK_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Channel Request Mask Clear Register                        */
    
    struct {
      __OM  uint32_t CHNL_REQ_MASK_CLR : 8;     /*!< [7..0] Channel Request Mask Clear                                         */
            uint32_t            : 24;
    } bit;
  } CHNL_REQ_MASK_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Channel Enable Set Register                                */
    
    struct {
      __IOM uint32_t CHNL_ENABLE_SET : 8;       /*!< [7..0] Channel Enable Set                                                 */
            uint32_t            : 24;
    } bit;
  } CHNL_ENABLE_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Channel Enable Clear Register                              */
    
    struct {
      __OM  uint32_t CHNL_ENABLE_CLR : 8;       /*!< [7..0] Channel Enable Clear                                               */
            uint32_t            : 24;
    } bit;
  } CHNL_ENABLE_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Channel Primary-Alternate Set Register                     */
    
