popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CHNL_PRI_ALT_SET : 8;      /*!< [7..0] Channel Primary Alternate Set                                      */
            uint32_t            : 24;
    } bit;
  } CHNL_PRI_ALT_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Channel Primary-Alternate Clear Register                   */
    
    struct {
      __OM  uint32_t CHNL_PRI_ALT_CLR : 8;      /*!< [7..0] Channel Primary Alternate Clear                                    */
            uint32_t            : 24;
    } bit;
  } CHNL_PRI_ALT_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Channel Priority Set Register                              */
    
    struct {
      __IOM uint32_t CHNL_PRIORITY_SET : 8;     /*!< [7..0] Channel Priority Set                                               */
            uint32_t            : 24;
    } bit;
  } CHNL_PRIORITY_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Channel Priority Clear Register                            */
    
    struct {
      __OM  uint32_t CHNL_PRIORITY_CLR : 8;     /*!< [7..0] Channel Priority Clear                                             */
            uint32_t            : 24;
    } bit;
  } CHNL_PRIORITY_CLR;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Bus Error Status and Clear Register                        */
    
    struct {
      __IOM uint32_t ERR_CLR    : 1;            /*!< [0..0] Error Clear                                                        */
            uint32_t            : 31;
    } bit;
  } ERR_CLR;
} DMA_Type;                                     /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO (GPIO)
  */

typedef struct {                                /*!< (@ 0x48030000) GPIO Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port 0 output register                                     */
    
    struct {
      __IOM uint32_t PO0        : 1;            /*!< [0..0] Output bit                                                         */
      __IOM uint32_t PO1        : 1;            /*!< [1..1] Output bit                                                         */
      __IOM uint32_t PO2        : 1;            /*!< [2..2] Output bit                                                         */
      __IOM uint32_t PO3        : 1;            /*!< [3..3] Output bit                                                         */
      __IOM uint32_t PO4        : 1;            /*!< [4..4] Output bit                                                         */
      __IOM uint32_t PO5        : 1;            /*!< [5..5] Output bit                                                         */
      __IOM uint32_t PO6        : 1;            /*!< [6..6] Output bit                                                         */
      __IOM uint32_t PO7        : 1;            /*!< [7..7] Output bit                                                         */
      __IOM uint32_t PO8        : 1;            /*!< [8..8] Output bit                                                         */
      __IOM uint32_t PO9        : 1;            /*!< [9..9] Output bit                                                         */
      __IOM uint32_t PO10       : 1;            /*!< [10..10] Output bit                                                       */
            uint32_t            : 21;
    } bit;
  } P0_OUT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Port 0 output modification register                        */
    
    struct {
      __OM  uint32_t PS0        : 1;            /*!< [0..0] Output set bit                                                     */
      __OM  uint32_t PS1        : 1;            /*!< [1..1] Output set bit                                                     */
      __OM  uint32_t PS2        : 1;            /*!< [2..2] Output set bit                                                     */
      __OM  uint32_t PS3        : 1;            /*!< [3..3] Output set bit                                                     */
      __OM  uint32_t PS4        : 1;            /*!< [4..4] Output set bit                                                     */
      __OM  uint32_t PS5        : 1;            /*!< [5..5] Output set bit                                                     */
      __OM  uint32_t PS6        : 1;            /*!< [6..6] Output set bit                                                     */
      __OM  uint32_t PS7        : 1;            /*!< [7..7] Output set bit                                                     */
      __OM  uint32_t PS8        : 1;            /*!< [8..8] Output set bit                                                     */
      __OM  uint32_t PS9        : 1;            /*!< [9..9] Output set bit                                                     */
      __OM  uint32_t PS10       : 1;            /*!< [10..10] Output set bit                                                   */
            uint32_t            : 5;
      __OM  uint32_t PR0        : 1;            /*!< [16..16] Output reset bit                                                 */
      __OM  uint32_t PR1        : 1;            /*!< [17..17] Output reset bit                                                 */
      __OM  uint32_t PR2        : 1;            /*!< [18..18] Output reset bit                                                 */
      __OM  uint32_t PR3        : 1;            /*!< [19..19] Output reset bit                                                 */
      __OM  uint32_t PR4        : 1;            /*!< [20..20] Output reset bit                                                 */
      __OM  uint32_t PR5        : 1;            /*!< [21..21] Output reset bit                                                 */
      __OM  uint32_t PR6        : 1;            /*!< [22..22] Output reset bit                                                 */
      __OM  uint32_t PR7        : 1;            /*!< [23..23] Output reset bit                                                 */
      __OM  uint32_t PR8        : 1;            /*!< [24..24] Output reset bit                                                 */
      __OM  uint32_t PR9        : 1;            /*!< [25..25] Output reset bit                                                 */
      __OM  uint32_t PR10       : 1;            /*!< [26..26] Output reset bit                                                 */
            uint32_t            : 5;
    } bit;
  } P0_OMR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Port 0 input register                                      */
    
