popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t PI0        : 1;            /*!< [0..0] Input bit                                                          */
      __IM  uint32_t PI1        : 1;            /*!< [1..1] Input bit                                                          */
      __IM  uint32_t PI2        : 1;            /*!< [2..2] Input bit                                                          */
      __IM  uint32_t PI3        : 1;            /*!< [3..3] Input bit                                                          */
      __IM  uint32_t PI4        : 1;            /*!< [4..4] Input bit                                                          */
      __IM  uint32_t PI5        : 1;            /*!< [5..5] Input bit                                                          */
      __IM  uint32_t PI6        : 1;            /*!< [6..6] Input bit                                                          */
      __IM  uint32_t PI7        : 1;            /*!< [7..7] Input bit                                                          */
      __IM  uint32_t PI8        : 1;            /*!< [8..8] Input bit                                                          */
      __IM  uint32_t PI9        : 1;            /*!< [9..9] Input bit                                                          */
      __IM  uint32_t PI10       : 1;            /*!< [10..10] Input bit                                                        */
            uint32_t            : 21;
    } bit;
  } P0_IN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Port 0 direction control                                   */
    
    struct {
      __IOM uint32_t DIR0       : 1;            /*!< [0..0] Direction control bit                                              */
      __IOM uint32_t DIR1       : 1;            /*!< [1..1] Direction control bit                                              */
      __IOM uint32_t DIR2       : 1;            /*!< [2..2] Direction control bit                                              */
      __IOM uint32_t DIR3       : 1;            /*!< [3..3] Direction control bit                                              */
      __IOM uint32_t DIR4       : 1;            /*!< [4..4] Direction control bit                                              */
      __IOM uint32_t DIR5       : 1;            /*!< [5..5] Direction control bit                                              */
      __IOM uint32_t DIR6       : 1;            /*!< [6..6] Direction control bit                                              */
      __IOM uint32_t DIR7       : 1;            /*!< [7..7] Direction control bit                                              */
      __IOM uint32_t DIR8       : 1;            /*!< [8..8] Direction control bit                                              */
      __IOM uint32_t DIR9       : 1;            /*!< [9..9] Direction control bit                                              */
      __IOM uint32_t DIR10      : 1;            /*!< [10..10] Direction control bit                                            */
            uint32_t            : 21;
    } bit;
  } P0_DIR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Port 0 open drain control                                  */
    
    struct {
      __IOM uint32_t OD0        : 1;            /*!< [0..0] Open drain control bit                                             */
      __IOM uint32_t OD1        : 1;            /*!< [1..1] Open drain control bit                                             */
      __IOM uint32_t OD2        : 1;            /*!< [2..2] Open drain control bit                                             */
      __IOM uint32_t OD3        : 1;            /*!< [3..3] Open drain control bit                                             */
      __IOM uint32_t OD4        : 1;            /*!< [4..4] Open drain control bit                                             */
      __IOM uint32_t OD5        : 1;            /*!< [5..5] Open drain control bit                                             */
      __IOM uint32_t OD6        : 1;            /*!< [6..6] Open drain control bit                                             */
      __IOM uint32_t OD7        : 1;            /*!< [7..7] Open drain control bit                                             */
      __IOM uint32_t OD8        : 1;            /*!< [8..8] Open drain control bit                                             */
      __IOM uint32_t OD9        : 1;            /*!< [9..9] Open drain control bit                                             */
      __IOM uint32_t OD10       : 1;            /*!< [10..10] Open drain control bit                                           */
            uint32_t            : 21;
    } bit;
  } P0_OD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Port 0 pull-up/pull-down control                           */
    
    struct {
      __IOM uint32_t PUDEN0     : 1;            /*!< [0..0] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN1     : 1;            /*!< [1..1] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN2     : 1;            /*!< [2..2] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN3     : 1;            /*!< [3..3] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN4     : 1;            /*!< [4..4] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN5     : 1;            /*!< [5..5] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN6     : 1;            /*!< [6..6] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN7     : 1;            /*!< [7..7] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN8     : 1;            /*!< [8..8] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN9     : 1;            /*!< [9..9] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN10    : 1;            /*!< [10..10] Pull-up/pull-down enable bit                                     */
            uint32_t            : 5;
      __IOM uint32_t PUDSEL0    : 1;            /*!< [16..16] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL1    : 1;            /*!< [17..17] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL2    : 1;            /*!< [18..18] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL3    : 1;            /*!< [19..19] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL4    : 1;            /*!< [20..20] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL5    : 1;            /*!< [21..21] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL6    : 1;            /*!< [22..22] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL7    : 1;            /*!< [23..23] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL8    : 1;            /*!< [24..24] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL9    : 1;            /*!< [25..25] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL10   : 1;            /*!< [26..26] Pull-up/pull-down select bit                                     */
            uint32_t            : 5;
    } bit;
  } P0_PUD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Port 0 alternate output select 0                           */
    
