popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t ALTSEL0    : 3;            /*!< [2..0] Alternate output select                                            */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL1    : 3;            /*!< [6..4] Alternate output select                                            */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL2    : 3;            /*!< [10..8] Alternate output select                                           */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL3    : 3;            /*!< [14..12] Alternate output select                                          */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL4    : 3;            /*!< [18..16] Alternate output select                                          */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL5    : 3;            /*!< [22..20] Alternate output select                                          */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL6    : 3;            /*!< [26..24] Alternate output select                                          */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL7    : 3;            /*!< [30..28] Alternate output select                                          */
            uint32_t            : 1;
    } bit;
  } P0_ALTSEL0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Port 0 alternate output select 1                           */
    
    struct {
      __IOM uint32_t ALTSEL8    : 3;            /*!< [2..0] Alternate output select                                            */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL9    : 3;            /*!< [6..4] Alternate output select                                            */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL10   : 3;            /*!< [10..8] Alternate output select                                           */
            uint32_t            : 21;
    } bit;
  } P0_ALTSEL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Port 0 output driver control                               */
    
    struct {
      __IOM uint32_t PDM0       : 2;            /*!< [1..0] Output driver mode control                                         */
      __IOM uint32_t PDM1       : 2;            /*!< [3..2] Output driver mode control                                         */
      __IOM uint32_t PDM2       : 2;            /*!< [5..4] Output driver mode control                                         */
      __IOM uint32_t PDM3       : 2;            /*!< [7..6] Output driver mode control                                         */
      __IOM uint32_t PDM4       : 2;            /*!< [9..8] Output driver mode control                                         */
      __IOM uint32_t PDM5       : 2;            /*!< [11..10] Output driver mode control                                       */
      __IOM uint32_t PDM6       : 2;            /*!< [13..12] Output driver mode control                                       */
      __IOM uint32_t PDM7       : 2;            /*!< [15..14] Output driver mode control                                       */
      __IOM uint32_t PDM8       : 2;            /*!< [17..16] Output driver mode control                                       */
      __IOM uint32_t PDM9       : 2;            /*!< [19..18] Output driver mode control                                       */
      __IOM uint32_t PDM10      : 2;            /*!< [21..20] Output driver mode control                                       */
            uint32_t            : 10;
    } bit;
  } P0_POCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Port 1 output register                                     */
    
    struct {
      __IOM uint32_t PO0        : 1;            /*!< [0..0] Output bit                                                         */
      __IOM uint32_t PO1        : 1;            /*!< [1..1] Output bit                                                         */
      __IOM uint32_t PO2        : 1;            /*!< [2..2] Output bit                                                         */
      __IOM uint32_t PO3        : 1;            /*!< [3..3] Output bit                                                         */
      __IOM uint32_t PO4        : 1;            /*!< [4..4] Output bit                                                         */
            uint32_t            : 27;
    } bit;
  } P1_OUT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Port 1 output modification register                        */
    
    struct {
      __OM  uint32_t PS0        : 1;            /*!< [0..0] Output set bit                                                     */
      __OM  uint32_t PS1        : 1;            /*!< [1..1] Output set bit                                                     */
      __OM  uint32_t PS2        : 1;            /*!< [2..2] Output set bit                                                     */
      __OM  uint32_t PS3        : 1;            /*!< [3..3] Output set bit                                                     */
      __OM  uint32_t PS4        : 1;            /*!< [4..4] Output set bit                                                     */
            uint32_t            : 11;
      __OM  uint32_t PR0        : 1;            /*!< [16..16] Output reset bit                                                 */
      __OM  uint32_t PR1        : 1;            /*!< [17..17] Output reset bit                                                 */
      __OM  uint32_t PR2        : 1;            /*!< [18..18] Output reset bit                                                 */
      __OM  uint32_t PR3        : 1;            /*!< [19..19] Output reset bit                                                 */
      __OM  uint32_t PR4        : 1;            /*!< [20..20] Output reset bit                                                 */
            uint32_t            : 11;
    } bit;
  } P1_OMR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) Port 1 input register                                      */
    
