popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t PI0        : 1;            /*!< [0..0] Input bit                                                          */
      __IM  uint32_t PI1        : 1;            /*!< [1..1] Input bit                                                          */
      __IM  uint32_t PI2        : 1;            /*!< [2..2] Input bit                                                          */
      __IM  uint32_t PI3        : 1;            /*!< [3..3] Input bit                                                          */
      __IM  uint32_t PI4        : 1;            /*!< [4..4] Input bit                                                          */
            uint32_t            : 27;
    } bit;
  } P1_IN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Port 1 direction control                                   */
    
    struct {
      __IOM uint32_t DIR0       : 1;            /*!< [0..0] Direction control bit                                              */
      __IOM uint32_t DIR1       : 1;            /*!< [1..1] Direction control bit                                              */
      __IOM uint32_t DIR2       : 1;            /*!< [2..2] Direction control bit                                              */
      __IOM uint32_t DIR3       : 1;            /*!< [3..3] Direction control bit                                              */
      __IOM uint32_t DIR4       : 1;            /*!< [4..4] Direction control bit                                              */
            uint32_t            : 27;
    } bit;
  } P1_DIR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Port 1 open drain control                                  */
    
    struct {
      __IOM uint32_t OD0        : 1;            /*!< [0..0] Open drain control bit                                             */
      __IOM uint32_t OD1        : 1;            /*!< [1..1] Open drain control bit                                             */
      __IOM uint32_t OD2        : 1;            /*!< [2..2] Open drain control bit                                             */
      __IOM uint32_t OD3        : 1;            /*!< [3..3] Open drain control bit                                             */
      __IOM uint32_t OD4        : 1;            /*!< [4..4] Open drain control bit                                             */
            uint32_t            : 27;
    } bit;
  } P1_OD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Port 1 pull-up/pull-down control                           */
    
    struct {
      __IOM uint32_t PUDEN0     : 1;            /*!< [0..0] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN1     : 1;            /*!< [1..1] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN2     : 1;            /*!< [2..2] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN3     : 1;            /*!< [3..3] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN4     : 1;            /*!< [4..4] Pull-up/pull-down enable bit                                       */
            uint32_t            : 11;
      __IOM uint32_t PUDSEL0    : 1;            /*!< [16..16] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL1    : 1;            /*!< [17..17] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL2    : 1;            /*!< [18..18] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL3    : 1;            /*!< [19..19] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL4    : 1;            /*!< [20..20] Pull-up/pull-down select bit                                     */
            uint32_t            : 11;
    } bit;
  } P1_PUD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Port 1 alternate output select 0                           */
    
    struct {
      __IOM uint32_t ALTSEL0    : 3;            /*!< [2..0] Alternate output select                                            */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL1    : 3;            /*!< [6..4] Alternate output select                                            */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL2    : 3;            /*!< [10..8] Alternate output select                                           */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL3    : 3;            /*!< [14..12] Alternate output select                                          */
            uint32_t            : 1;
      __IOM uint32_t ALTSEL4    : 3;            /*!< [18..16] Alternate output select                                          */
            uint32_t            : 13;
    } bit;
  } P1_ALTSEL0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Port 1 output driver control                               */
    
    struct {
      __IOM uint32_t PDM0       : 2;            /*!< [1..0] Output driver mode control                                         */
      __IOM uint32_t PDM1       : 2;            /*!< [3..2] Output driver mode control                                         */
      __IOM uint32_t PDM2       : 2;            /*!< [5..4] Output driver mode control                                         */
      __IOM uint32_t PDM3       : 2;            /*!< [7..6] Output driver mode control                                         */
      __IOM uint32_t PDM4       : 2;            /*!< [9..8] Output driver mode control                                         */
            uint32_t            : 22;
    } bit;
  } P1_POCON;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000044) Port 2 input register                                      */
    
