popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t PI0        : 1;            /*!< [0..0] Input bit                                                          */
      __IM  uint32_t PI1        : 1;            /*!< [1..1] Input bit                                                          */
      __IM  uint32_t PI2        : 1;            /*!< [2..2] Input bit                                                          */
      __IM  uint32_t PI3        : 1;            /*!< [3..3] Input bit                                                          */
      __IM  uint32_t PI4        : 1;            /*!< [4..4] Input bit                                                          */
      __IM  uint32_t PI5        : 1;            /*!< [5..5] Input bit                                                          */
      __IM  uint32_t PI6        : 1;            /*!< [6..6] Input bit                                                          */
      __IM  uint32_t PI7        : 1;            /*!< [7..7] Input bit                                                          */
      __IM  uint32_t PI8        : 1;            /*!< [8..8] Input bit                                                          */
      __IM  uint32_t PI9        : 1;            /*!< [9..9] Input bit                                                          */
            uint32_t            : 22;
    } bit;
  } P2_IN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Port 2 input disable register                              */
    
    struct {
      __IOM uint32_t INDIS0     : 1;            /*!< [0..0] Input disable control bit                                          */
      __IOM uint32_t INDIS1     : 1;            /*!< [1..1] Input disable control bit                                          */
      __IOM uint32_t INDIS2     : 1;            /*!< [2..2] Input disable control bit                                          */
      __IOM uint32_t INDIS3     : 1;            /*!< [3..3] Input disable control bit                                          */
      __IOM uint32_t INDIS4     : 1;            /*!< [4..4] Input disable control bit                                          */
      __IOM uint32_t INDIS5     : 1;            /*!< [5..5] Input disable control bit                                          */
      __IOM uint32_t INDIS6     : 1;            /*!< [6..6] Input disable control bit                                          */
      __IOM uint32_t INDIS7     : 1;            /*!< [7..7] Input disable control bit                                          */
      __IOM uint32_t INDIS8     : 1;            /*!< [8..8] Input disable control bit                                          */
      __IOM uint32_t INDIS9     : 1;            /*!< [9..9] Input disable control bit                                          */
            uint32_t            : 22;
    } bit;
  } P2_INDIS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Port 2 pull-up/pull-down control                           */
    
    struct {
      __IOM uint32_t PUDEN0     : 1;            /*!< [0..0] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN1     : 1;            /*!< [1..1] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN2     : 1;            /*!< [2..2] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN3     : 1;            /*!< [3..3] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN4     : 1;            /*!< [4..4] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN5     : 1;            /*!< [5..5] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN6     : 1;            /*!< [6..6] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN7     : 1;            /*!< [7..7] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN8     : 1;            /*!< [8..8] Pull-up/pull-down enable bit                                       */
      __IOM uint32_t PUDEN9     : 1;            /*!< [9..9] Pull-up/pull-down enable bit                                       */
            uint32_t            : 6;
      __IOM uint32_t PUDSEL0    : 1;            /*!< [16..16] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL1    : 1;            /*!< [17..17] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL2    : 1;            /*!< [18..18] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL3    : 1;            /*!< [19..19] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL4    : 1;            /*!< [20..20] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL5    : 1;            /*!< [21..21] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL6    : 1;            /*!< [22..22] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL7    : 1;            /*!< [23..23] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL8    : 1;            /*!< [24..24] Pull-up/pull-down select bit                                     */
      __IOM uint32_t PUDSEL9    : 1;            /*!< [25..25] Pull-up/pull-down select bit                                     */
            uint32_t            : 6;
    } bit;
  } P2_PUD;
} GPIO_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPT12                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief GPT12 (GPT12)
  */

