popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
typedef struct {                                /*!< (@ 0x40014000) GPT12 Structure                                            */
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000000) Module Identification Register                             */
    
    struct {
      __IM  uint32_t MOD_REV    : 8;            /*!< [7..0] Module Revision Number                                             */
      __IM  uint32_t MOD_TYPE   : 8;            /*!< [15..8] Module Identification Number                                      */
            uint32_t            : 16;
    } bit;
  } ID;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Port Input Select Register                                 */
    
    struct {
      __IOM uint32_t IST2IN     : 1;            /*!< [0..0] Input Select for T2IN                                              */
      __IOM uint32_t IST2EUD    : 1;            /*!< [1..1] Input Select for T2EUD                                             */
      __IOM uint32_t IST3IN     : 2;            /*!< [3..2] Input Select for T3IN                                              */
      __IOM uint32_t IST3EUD    : 2;            /*!< [5..4] Input Select for T3EUD                                             */
      __IOM uint32_t IST4IN     : 2;            /*!< [7..6] Input Select for T4IN                                              */
      __IOM uint32_t IST4EUD    : 2;            /*!< [9..8] Input Select for TEUD                                              */
      __IOM uint32_t IST5IN     : 1;            /*!< [10..10] Input Select for T5IN                                            */
      __IOM uint32_t IST5EUD    : 1;            /*!< [11..11] Input Select for T5EUD                                           */
      __IOM uint32_t IST6IN     : 1;            /*!< [12..12] Input Select for T6IN                                            */
      __IOM uint32_t IST6EUD    : 1;            /*!< [13..13] Input Select for T6EUD                                           */
      __IOM uint32_t ISCAPIN    : 2;            /*!< [15..14] Input Select for CAPIN                                           */
            uint32_t            : 16;
    } bit;
  } PISEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Timer T2 Control Register                                  */
    
    struct {
      __IOM uint32_t T2I        : 3;            /*!< [2..0] Timer T2 Input Parameter Selection                                 */
      __IOM uint32_t T2M        : 3;            /*!< [5..3] Timer T2 Input Mode Control                                        */
      __IOM uint32_t T2R        : 1;            /*!< [6..6] Timer T2 Input Run Bit                                             */
      __IOM uint32_t T2UD       : 1;            /*!< [7..7] Timer T2 Up/Down Control                                           */
      __IOM uint32_t T2UDE      : 1;            /*!< [8..8] Timer T2 External Up/Down Enable                                   */
      __IOM uint32_t T2RC       : 1;            /*!< [9..9] Timer T2 Remote Control                                            */
            uint32_t            : 2;
      __IOM uint32_t T2IRIDIS   : 1;            /*!< [12..12] Timer T2 Interrupt Disable                                       */
      __IOM uint32_t T2EDGE     : 1;            /*!< [13..13] Timer T2 Edge Detection                                          */
      __IOM uint32_t T2CHDIR    : 1;            /*!< [14..14] Timer T2 Count Direction Change                                  */
      __IM  uint32_t T2DIR      : 1;            /*!< [15..15] Timer T2 Rotation Direction                                      */
            uint32_t            : 16;
    } bit;
  } T2CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Timer T3 Control Register                                  */
    
    struct {
      __IOM uint32_t T3I        : 3;            /*!< [2..0] Timer T3 Input Parameter Selection                                 */
      __IOM uint32_t T3M        : 3;            /*!< [5..3] Timer T3 Input Mode Control                                        */
      __IOM uint32_t T3R        : 1;            /*!< [6..6] Timer T3 Input Run Bit                                             */
      __IOM uint32_t T3UD       : 1;            /*!< [7..7] Timer T3 Up/Down Control                                           */
      __IOM uint32_t T3UDE      : 1;            /*!< [8..8] Timer T3 External Up/Down Enable                                   */
      __IOM uint32_t T3OE       : 1;            /*!< [9..9] Overflow/Underflow Output Enable                                   */
      __IOM uint32_t T3OTL      : 1;            /*!< [10..10] Timer T3 Overflow Toggle Latch                                   */
      __IOM uint32_t BPS1       : 2;            /*!< [12..11] GPT1 Block Prescaler Control                                     */
      __IOM uint32_t T3EDGE     : 1;            /*!< [13..13] Timer T3 Edge Detection Flag                                     */
      __IOM uint32_t T3CHDIR    : 1;            /*!< [14..14] Timer T3 Count Direction Change Flag                             */
      __IM  uint32_t T3DIR      : 1;            /*!< [15..15] Timer T3 Rotation Direction Flag                                 */
            uint32_t            : 16;
    } bit;
  } T3CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Timer T4 Control Register                                  */
    
    struct {
      __IOM uint32_t T4I        : 3;            /*!< [2..0] Timer T4 Input Parameter Selection                                 */
      __IOM uint32_t T4M        : 3;            /*!< [5..3] Timer T4 Mode Control (Basic Operating Mode)                       */
      __IOM uint32_t T4R        : 1;            /*!< [6..6] Timer T4 Input Run Bit                                             */
      __IOM uint32_t T4UD       : 1;            /*!< [7..7] Timer T2 Up/Down Control                                           */
      __IOM uint32_t T4UDE      : 1;            /*!< [8..8] Timer T4 External Up/Down Enable                                   */
      __IOM uint32_t T4RC       : 1;            /*!< [9..9] Timer T4 Remote Control                                            */
      __IOM uint32_t CLRT2EN    : 1;            /*!< [10..10] Clear Timer T2 Enable                                            */
      __IOM uint32_t CLRT3EN    : 1;            /*!< [11..11] Clear Timer T3 Enable                                            */
      __IOM uint32_t T4IRDIS    : 1;            /*!< [12..12] Timer T4 Interrupt Disable                                       */
      __IOM uint32_t T4EDGE     : 1;            /*!< [13..13] Timer T4 Edge Direction                                          */
      __IOM uint32_t T4CHDIR    : 1;            /*!< [14..14] Timer T4 Count Direction Change                                  */
      __IM  uint32_t T4RDIR     : 1;            /*!< [15..15] Timer T4 Rotation Direction                                      */
            uint32_t            : 16;
    } bit;
  } T4CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Timer T5 Control Register                                  */
    
