popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t T5I        : 3;            /*!< [2..0] Timer T5 Input Parameter Selection                                 */
      __IOM uint32_t T5M        : 2;            /*!< [4..3] Timer T5 Input Mode Control                                        */
            uint32_t            : 1;
      __IOM uint32_t T5R        : 1;            /*!< [6..6] Timer T5 Run Bit                                                   */
      __IOM uint32_t T5UD       : 1;            /*!< [7..7] Timer T2 Up/Down Control                                           */
      __IOM uint32_t T5UDE      : 1;            /*!< [8..8] Timer T5 External Up/Down Enable                                   */
      __IOM uint32_t T5RC       : 1;            /*!< [9..9] Timer T5 Remote Control                                            */
      __IOM uint32_t CT3        : 1;            /*!< [10..10] Timer T3 Capture Trigger Enable                                  */
            uint32_t            : 1;
      __IOM uint32_t CI         : 2;            /*!< [13..12] Register CAPREL Capture Trigger Selection                        */
      __IOM uint32_t T5CLR      : 1;            /*!< [14..14] Timer T5 Clear Enable Bit                                        */
      __IOM uint32_t T5SC       : 1;            /*!< [15..15] Timer T5 Capture Mode Enable                                     */
            uint32_t            : 16;
    } bit;
  } T5CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Timer T6 Control Register                                  */
    
    struct {
      __IOM uint32_t T6I        : 3;            /*!< [2..0] Timer T6 Input Parameter Selection                                 */
      __IOM uint32_t T6M        : 3;            /*!< [5..3] Timer T6 Mode Control                                              */
      __IOM uint32_t T6R        : 1;            /*!< [6..6] Timer T6 Input Run Bit                                             */
      __IOM uint32_t T6UD       : 1;            /*!< [7..7] Timer T6 Up/Down Control                                           */
      __IOM uint32_t T6UDE      : 1;            /*!< [8..8] Timer T6 External Up/Down Enable                                   */
      __IOM uint32_t T6OE       : 1;            /*!< [9..9] Overflow/Underflow Output Enable                                   */
      __IOM uint32_t T6OTL      : 1;            /*!< [10..10] Timer T6 Overflow Toggle Latch                                   */
      __IOM uint32_t BPS2       : 2;            /*!< [12..11] GPT2 Block Prescaler Control                                     */
            uint32_t            : 1;
      __IOM uint32_t T6CLR      : 1;            /*!< [14..14] Timer T6 Clear Enable Bit                                        */
      __IOM uint32_t T6SR       : 1;            /*!< [15..15] Timer T6 Reload Mode Enable                                      */
            uint32_t            : 16;
    } bit;
  } T6CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Capture/Reload Register                                    */
    
    struct {
      __IOM uint32_t CAPREL     : 16;           /*!< [15..0] Current reload value or Captured value                            */
            uint32_t            : 16;
    } bit;
  } CAPREL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Timer T2 Count Register                                    */
    
    struct {
      __IOM uint32_t T2         : 16;           /*!< [15..0] Timer T2 Current Value                                            */
            uint32_t            : 16;
    } bit;
  } T2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Timer T3 Count Register                                    */
    
    struct {
      __IOM uint32_t T3         : 16;           /*!< [15..0] Timer T3 Current Value                                            */
            uint32_t            : 16;
    } bit;
  } T3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Timer T4 Count Register                                    */
    
    struct {
      __IOM uint32_t T4         : 16;           /*!< [15..0] Timer T4 Current Value                                            */
            uint32_t            : 16;
    } bit;
  } T4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Timer 5 Count Register                                     */
    
    struct {
      __IOM uint32_t T5         : 16;           /*!< [15..0] Timer T5 Current Value                                            */
            uint32_t            : 16;
    } bit;
  } T5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Timer 6 Count Register                                     */
    
    struct {
      __IOM uint32_t T6         : 16;           /*!< [15..0] Timer T6 Current Value                                            */
            uint32_t            : 16;
    } bit;
  } T6;
} GPT12_Type;                                   /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                          MEMCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MEMCTRL (MEMCTRL)
  */

typedef struct {                                /*!< (@ 0x48044000) MEMCTRL Structure                                          */
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000000) Bus Fault Status Register                                  */
    
    struct {
      __IM  uint32_t DBFSTS     : 1;            /*!< [0..0] Data Bus Fault Status Valid Flag                                   */
      __IM  uint32_t SBFSTS     : 1;            /*!< [1..1] System Bus Fault Status Valid Flag                                 */
            uint32_t            : 30;
    } bit;
  } BFSTS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Bus Fault Status Clear Register                            */
    
