popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t DBFSTSCLR  : 1;            /*!< [0..0] Data Bus Fault Status Valid Flag Clear                             */
      __OM  uint32_t SBFSTSCLR  : 1;            /*!< [1..1] System Bus Fault Status Valid Flag Clear                           */
            uint32_t            : 30;
    } bit;
  } BFSTSC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Bus Fault Status Set Register                              */
    
    struct {
      __OM  uint32_t DBFSTSSET  : 1;            /*!< [0..0] Data Bus Fault Status Valid Flag Set                               */
      __OM  uint32_t SBFSTSSET  : 1;            /*!< [1..1] System Bus Fault Status Valid Flag Set                             */
            uint32_t            : 30;
    } bit;
  } BFSTSS;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Data Bus Fault Address Register                            */
    
    struct {
      __IM  uint32_t DBFA       : 32;           /*!< [31..0] Data Bus Fault Address                                            */
    } bit;
  } DBFA;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) System Bus Fault Address Register                          */
    
    struct {
      __IM  uint32_t SBFA       : 32;           /*!< [31..0] System Bus Fault Address                                          */
    } bit;
  } SBFA;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) NMI Control Register                                       */
    
    struct {
      __IOM uint32_t NMIDSEN    : 1;            /*!< [0..0] DSRAM Double Bit ECC Error NMI Enable                              */
      __IOM uint32_t NMIPSEN    : 1;            /*!< [1..1] PSRAM Double Bit ECC Error NMI Enable                              */
      __IOM uint32_t NMICDEN    : 1;            /*!< [2..2] Cache Data RAM Double Bit ECC Error NMI Enable                     */
      __IOM uint32_t NMINVM0EN  : 1;            /*!< [3..3] NVM0 Double Bit ECC Error NMI Enable                               */
      __IOM uint32_t NMINVM1EN  : 1;            /*!< [4..4] NVM1 Double Bit ECC Error NMI Enable                               */
      __IOM uint32_t NMIMAP0EN  : 1;            /*!< [5..5] NVM0 MAP Error NMI Enable                                          */
      __IOM uint32_t NMIMAP1EN  : 1;            /*!< [6..6] NVM1 MAP Error NMI Enable                                          */
      __IOM uint32_t NMIWDTEN   : 1;            /*!< [7..7] Watchdog Timer NMI Enable                                          */
      __IOM uint32_t NMISTOFEN  : 1;            /*!< [8..8] Stack Overflow NMI Enable                                          */
            uint32_t            : 23;
    } bit;
  } NMICON;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) NMI Status Register                                        */
    
    struct {
      __IM  uint32_t NMIDS      : 1;            /*!< [0..0] DSRAM Double Bit ECC Error NMI Status                              */
      __IM  uint32_t NMIPS      : 1;            /*!< [1..1] PSRAM Double Bit ECC Error NMI Status                              */
      __IM  uint32_t NMICD      : 1;            /*!< [2..2] Cache Data RAM Double Bit ECC Error NMI Status                     */
      __IM  uint32_t NMINVM0    : 1;            /*!< [3..3] NVM0 Double Bit ECC Error NMI Status                               */
      __IM  uint32_t NMINVM1    : 1;            /*!< [4..4] NVM1 Double Bit ECC Error NMI Status                               */
      __IM  uint32_t NMIMAP0    : 1;            /*!< [5..5] NVM0 MAP Error NMI Status                                          */
      __IM  uint32_t NMIMAP1    : 1;            /*!< [6..6] NVM1 MAP Error NMI Status                                          */
      __IM  uint32_t NMIWDT     : 1;            /*!< [7..7] Watchdog Timer NMI Status                                          */
      __IM  uint32_t NMISTOF    : 1;            /*!< [8..8] Stack Overflow NMI Status                                          */
            uint32_t            : 23;
    } bit;
  } NMISR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) NMI Status Clear Register                                  */
    
    struct {
      __OM  uint32_t NMIDSCLR   : 1;            /*!< [0..0] DSRAM Double Bit ECC Error NMI Status Clear                        */
      __OM  uint32_t NMIPSCLR   : 1;            /*!< [1..1] PSRAM Double Bit ECC Error NMI Status Clear                        */
      __OM  uint32_t NMICDCLR   : 1;            /*!< [2..2] Cache Data RAM Double Bit ECC Error NMI Status Clear               */
      __OM  uint32_t NMINVM0CLR : 1;            /*!< [3..3] NVM 0 Double Bit ECC Error NMI Status Clear                        */
      __OM  uint32_t NMINVM1CLR : 1;            /*!< [4..4] NVM1 Double Bit ECC Error NMI Status Clear                         */
      __OM  uint32_t NMIMAP0CLR : 1;            /*!< [5..5] NVM0 MAP Error NMI Status Clear                                    */
      __OM  uint32_t NMIMAP1CLR : 1;            /*!< [6..6] NVM1 MAP Error NMI Status Clear                                    */
      __OM  uint32_t NMIWDTCLR  : 1;            /*!< [7..7] Watchdog Timer NMI Status Clear                                    */
      __OM  uint32_t NMISTOFCLR : 1;            /*!< [8..8] Stack Overflow NMI Status Clear                                    */
            uint32_t            : 23;
    } bit;
  } NMISRC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) NMI Status Set Register                                    */
    
    struct {
      __OM  uint32_t NMIDSSET   : 1;            /*!< [0..0] DSRAM Double Bit ECC Error NMI Status Set                          */
      __OM  uint32_t NMIPSSET   : 1;            /*!< [1..1] PSRAM Double Bit ECC Error NMI Status Set                          */
      __OM  uint32_t NMICDSET   : 1;            /*!< [2..2] Cache Data RAM Double Bit ECC Error NMI Status Set                 */
      __OM  uint32_t NMINVM0SET : 1;            /*!< [3..3] NVM 0 Double Bit ECC Error NMI Status Set                          */
      __OM  uint32_t NMINVM1SET : 1;            /*!< [4..4] NVM1 Double Bit ECC Error NMI Status Set                           */
      __OM  uint32_t NMIMAP0SET : 1;            /*!< [5..5] NVM0 MAP Error NMI Status Set                                      */
      __OM  uint32_t NMIMAP1SET : 1;            /*!< [6..6] NVM1 MAP Error NMI Status Set                                      */
      __OM  uint32_t NMIWDTSET  : 1;            /*!< [7..7] Watchdog Timer NMI Status Set                                      */
      __OM  uint32_t NMISTOFSET : 1;            /*!< [8..8] Stack Overflow NMI Status Set                                      */
            uint32_t            : 23;
    } bit;
  } NMISRS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) MEMCTRL Interrupt Enable Register                          */
    
