popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t NVM0OPCIEN : 1;            /*!< [0..0] NVM0 Operation Complete Interrupt Enable                           */
      __IOM uint32_t NVM1OPCIEN : 1;            /*!< [1..1] NVM1 Operation Complete Interrupt Enable                           */
            uint32_t            : 30;
    } bit;
  } IEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000028) MEMCTRL Interrupt Status Register                          */
    
    struct {
      __IM  uint32_t NVM0OPC    : 1;            /*!< [0..0] NVM0 Operation Complete Interrupt Status                           */
      __IM  uint32_t NVM1OPC    : 1;            /*!< [1..1] NVM1 Operation Complete Interrupt Status                           */
            uint32_t            : 30;
    } bit;
  } IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) MEMCTRL Interrupt Status Clear Register                    */
    
    struct {
      __OM  uint32_t NVM0OPCLR  : 1;            /*!< [0..0] NVM0 Operation Complete Interrupt Status Clear                     */
      __OM  uint32_t NVM1OPCLR  : 1;            /*!< [1..1] NVM1 Operation Complete Interrupt Status Clear                     */
            uint32_t            : 30;
    } bit;
  } ISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) MEMCTRL Interrupt Status Set Register                      */
    
    struct {
      __OM  uint32_t NVM0OPSET  : 1;            /*!< [0..0] NVM0 Operation Complete Interrupt Status Set                       */
      __OM  uint32_t NVM1OPSET  : 1;            /*!< [1..1] NVM1 Operation Complete Interrupt Status Set                       */
            uint32_t            : 30;
    } bit;
  } ISS;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000034) Memory Protection and Error Status Register                */
    
    struct {
      __IM  uint32_t NVM0_PROT_ERR : 1;         /*!< [0..0] NVM0 Access Protection Error                                       */
      __IM  uint32_t NVM0_ADDR_ERR : 1;         /*!< [1..1] NVM0 Address Protection Error                                      */
      __IM  uint32_t NVM0_SFR_PROT_ERR : 1;     /*!< [2..2] NVM0 SFR Access Protection Error                                   */
      __IM  uint32_t NVM0_SFR_ADDR_ERR : 1;     /*!< [3..3] NVM0 SFR Address Protection Error                                  */
      __IM  uint32_t NVM1_PROT_ERR : 1;         /*!< [4..4] NVM1 Access Protection Error                                       */
      __IM  uint32_t NVM1_ADDR_ERR : 1;         /*!< [5..5] NVM1 Address Protection Error                                      */
      __IM  uint32_t NVM1_SFR_PROT_ERR : 1;     /*!< [6..6] NVM1 SFR Access Protection Error                                   */
      __IM  uint32_t NVM1_SFR_ADDR_ERR : 1;     /*!< [7..7] NVM1 SFR Address Protection Error                                  */
      __IM  uint32_t ROM_PROT_ERR : 1;          /*!< [8..8] ROM Access Protection Error                                        */
      __IM  uint32_t DSRAM_PROT_ERR : 1;        /*!< [9..9] DSRAM Access Protection Error                                      */
      __IM  uint32_t PSRAM_PROT_ERR : 1;        /*!< [10..10] PSRAM Access Protection Error                                    */
            uint32_t            : 5;
      __IM  uint32_t DSSBE      : 1;            /*!< [16..16] DSRAM Single Bit Error Status                                    */
      __IM  uint32_t PSSBE      : 1;            /*!< [17..17] PSRAM Single Bit Error Status                                    */
      __IM  uint32_t CDSBE      : 1;            /*!< [18..18] Cache Data RAM Single Bit Error Status                           */
            uint32_t            : 13;
    } bit;
  } MEMSTS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Memory Protection and Error Status Register Clear          */
    
    struct {
      __OM  uint32_t NVM0_PROT_ERRCLR : 1;      /*!< [0..0] NVM0Access Protection Error Clear                                  */
      __OM  uint32_t NVM0_ADDR_ERRCLR : 1;      /*!< [1..1] NVM0 Address Protection Error Clear                                */
      __OM  uint32_t NVM0_SFR_PROT_ERRCLR : 1;  /*!< [2..2] NVM0 SFR Access Protection Error Clear                             */
      __OM  uint32_t NVM0_SFR_ADDR_ERRCLR : 1;  /*!< [3..3] NVM0 SFR Address Protection Error Clear                            */
      __OM  uint32_t NVM1_PROT_ERRCLR : 1;      /*!< [4..4] NVM1 Access Protection Error Clear                                 */
      __OM  uint32_t NVM1_ADDR_ERRCLR : 1;      /*!< [5..5] NVM1 Address Protection Error Clear                                */
      __OM  uint32_t NVM1_SFR_PROT_ERRCLR : 1;  /*!< [6..6] NVM1 SFR Access Protection Error Clear                             */
      __OM  uint32_t NVM1_SFR_ADDR_ERRCLR : 1;  /*!< [7..7] NVM1 SFR Address Protection Error Clear                            */
      __OM  uint32_t ROM_PROT_ERRCLR : 1;       /*!< [8..8] ROM Access Protection Error Clear                                  */
      __OM  uint32_t DSRAM_PROT_ERRCLR : 1;     /*!< [9..9] DSRAM Access Protection Error Clear                                */
      __OM  uint32_t PSRAM_PROT_ERRCLR : 1;     /*!< [10..10] PSRAM Access Protection Error Clear                              */
            uint32_t            : 5;
      __OM  uint32_t DSSBECLR   : 1;            /*!< [16..16] DSRAM Single Bit Error Status Clear                              */
      __OM  uint32_t PSSBECLR   : 1;            /*!< [17..17] PSRAM Single Bit Error Status Clear                              */
      __OM  uint32_t CDSBECLR   : 1;            /*!< [18..18] Cache Data RAM Single Bit Error Status Clear                     */
            uint32_t            : 13;
    } bit;
  } MEMSTSC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Memory Protection and Error Status Register Set            */
    
