popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t NVM0_PROT_ERRSET : 1;      /*!< [0..0] NVM0 Access Protection Error Set                                   */
      __OM  uint32_t NVM0_ADDR_ERRSET : 1;      /*!< [1..1] NVM0 Address Protection Error Set                                  */
      __OM  uint32_t NVM0_SFR_PROT_ERRSET : 1;  /*!< [2..2] NVM0 SFR Access Protection Error Set                               */
      __OM  uint32_t NVM0_SFR_ADDR_ERRSET : 1;  /*!< [3..3] NVM0 SFR Address Protection Error Set                              */
      __OM  uint32_t NVM1_PROT_ERRSET : 1;      /*!< [4..4] NVM1 Access Protection Error Set                                   */
      __OM  uint32_t NVM1_ADDR_ERRSET : 1;      /*!< [5..5] NVM1 Address Protection Error Set                                  */
      __OM  uint32_t NVM1_SFR_PROT_ERRSET : 1;  /*!< [6..6] NVM1 SFR Access Protection Error Set                               */
      __OM  uint32_t NVM1_SFR_ADDR_ERRSET : 1;  /*!< [7..7] NVM1 SFR Address Protection Error Set                              */
      __OM  uint32_t ROM_PROT_ERRSET : 1;       /*!< [8..8] ROM Access Protection Error Set                                    */
      __OM  uint32_t DSRAM_PROT_ERRSET : 1;     /*!< [9..9] DSRAM Access Protection Error Set                                  */
      __OM  uint32_t PSRAM_PROT_ERRSET : 1;     /*!< [10..10] PSRAM Access Protection Error Set                                */
            uint32_t            : 5;
      __OM  uint32_t DSSBESET   : 1;            /*!< [16..16] DSRAM Single Bit Error Status Set                                */
      __OM  uint32_t PSSBESET   : 1;            /*!< [17..17] PSRAM Single Bit Error Status Set                                */
      __OM  uint32_t CDSBESET   : 1;            /*!< [18..18] Cache Data RAM Single Bit Error Status Set                       */
            uint32_t            : 13;
    } bit;
  } MEMSTSS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Memory Control Register                                    */
    
    struct {
      __IOM uint32_t ROMAWSEN   : 1;            /*!< [0..0] ROM AHB Wait State Enable                                          */
      __IOM uint32_t MEM_DBG_ERR : 1;           /*!< [1..1] Mem Debug Error                                                    */
      __IOM uint32_t CACHEEN    : 1;            /*!< [2..2] NVM1 Cache Enable                                                  */
            uint32_t            : 29;
    } bit;
  } MEMCONTROL;
  __IM  uint32_t  RESERVED[19];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) System Startup Status Register                             */
    
    struct {
      __IOM uint32_t MRAMINITSTS : 1;           /*!< [0..0] Map RAM Initialization Status                                      */
      __IOM uint32_t PG100TP_CHKS_ERR : 1;      /*!< [1..1] 100TP Page Checksum Error                                          */
            uint32_t            : 14;
      __IOM uint32_t MAPRAM1_MBISTEXEC : 1;     /*!< [16..16] Map RAM 1 MBIST Execution Status Flag                            */
      __IOM uint32_t MAPRAM0_MBISTEXEC : 1;     /*!< [17..17] Map RAM 0 MBIST Execution Status Flag                            */
      __IOM uint32_t CDRAM_MBISTEXEC : 1;       /*!< [18..18] Cache Data RAM MBIST Execution Status Flag                       */
      __IOM uint32_t CTRAM_MBISTEXEC : 1;       /*!< [19..19] Cache Tag RAM MBIST Execution Status Flag                        */
      __IOM uint32_t CMRAM_MBISTEXEC : 1;       /*!< [20..20] CAN Msg RAM MBIST Execution Status Flag                          */
      __IOM uint32_t PSRAM_MBISTEXEC : 1;       /*!< [21..21] PSRAM MBIST Execution Status Flag                                */
      __IOM uint32_t DSRAM_MBISTEXEC : 1;       /*!< [22..22] DSRAM MBIST Execution Status Flag                                */
            uint32_t            : 1;
      __IOM uint32_t MAPRAM1_MBISTFAIL : 1;     /*!< [24..24] Map RAM 1 MBIST Execution Fail Flag                              */
      __IOM uint32_t MAPRAM0_MBISTFAIL : 1;     /*!< [25..25] Map RAM 0 MBIST Execution Fail Flag                              */
      __IOM uint32_t CDRAM_MBISTFAIL : 1;       /*!< [26..26] Cache Data RAM MBIST Execution Fail Flag                         */
      __IOM uint32_t CTRAM_MBISTFAIL : 1;       /*!< [27..27] Cache Tag RAM MBIST Execution Fail Flag                          */
      __IOM uint32_t CMRAM_MBISTFAIL : 1;       /*!< [28..28] CAN Msg RAM MBIST Execution Fail Flag                            */
      __IOM uint32_t PSRAM_MBISTFAIL : 1;       /*!< [29..29] PSRAM MBIST Execution Fail Flag                                  */
      __IOM uint32_t DSRAM_MBISTFAIL : 1;       /*!< [30..30] DSRAM MBIST Execution Fail Flag                                  */
            uint32_t            : 1;
    } bit;
  } SYS_STRTUP_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) NVM Protection Status Register                             */
    
    struct {
      __IOM uint32_t RDEN_UBSL  : 1;            /*!< [0..0] NVM0 Read Protection of Data in User BSL Region                    */
      __IOM uint32_t WREN_UBSL  : 1;            /*!< [1..1] NVM0 Write Protection of Data in User BSL Region                   */
      __IOM uint32_t RDEN_UCODE : 1;            /*!< [2..2] NVM1 Read Protection of Data in User Code Sectors                  */
      __IOM uint32_t WREN_UCODE : 1;            /*!< [3..3] NVM1 Write Protection of Data in User Code Sectors                 */
      __IOM uint32_t RDEN_UDATA : 1;            /*!< [4..4] NVM0 Read Protection of Data in User Data Sectors                  */
      __IOM uint32_t WREN_UDATA : 1;            /*!< [5..5] NVM0 Write Protection of Data in User Data Sectors                 */
      __IOM uint32_t WREN_CS0   : 1;            /*!< [6..6] NVM0 Config Sector Write Protection                                */
      __IOM uint32_t WREN_CS1   : 1;            /*!< [7..7] NVM1 Config Sector Write Protection                                */
      __IOM uint32_t RDEN_CS0   : 1;            /*!< [8..8] NVM0 Read Protection of Config Sector 0                            */
      __IOM uint32_t RDEN_CS1   : 1;            /*!< [9..9] NVM0 Read Protection of Config Sector 1                            */
      __IOM uint32_t WREN_CRYPTO : 1;           /*!< [10..10] NVM1 Write Protection of Data in Crypto Lib Sectors              */
      __IOM uint32_t WREN_MCTRL : 1;            /*!< [11..11] NVM1 Write Protection of Data in Motor Control Lib
                                                     Sectors                                                                   */
      __IOM uint32_t SFR_PROT_DIS : 1;          /*!< [12..12] NVM1 SFR Access Protection                                       */
      __IOM uint32_t RDEN_CRYPTO : 1;           /*!< [13..13] NVM1 Read Protection of Crypto Lib                               */
      __IOM uint32_t RDEN_MCTRL : 1;            /*!< [14..14] NVM1 Read Protection of Secure Lib                               */
            uint32_t            : 1;
      __IOM uint32_t ROM_PROT_DIS : 1;          /*!< [16..16] Disable ROM Protection                                           */
      __IOM uint32_t DSRAM_PROT_DIS : 1;        /*!< [17..17] Disable DSRAM Protection                                         */
      __IOM uint32_t PSRAM_PROT_DIS : 1;        /*!< [18..18] Disable PSRAM Protection                                         */
      __IOM uint32_t NVM0_PROT_DIS : 1;         /*!< [19..19] Disable NVM0 Protection                                          */
      __IOM uint32_t NVM1_PROT_DIS : 1;         /*!< [20..20] Disable NVM1 Protection                                          */
      __IOM uint32_t NVMSFR_PROT_DIS : 1;       /*!< [21..21] Disable NVMSFR Protection                                        */
            uint32_t            : 2;
      __IOM uint32_t UBSL_SIZE  : 3;            /*!< [26..24] User BSL Region Size Definition                                  */
      __IOM uint32_t UBSL_PRIV  : 1;            /*!< [27..27] User BSL Privilege Setting                                       */
            uint32_t            : 4;
    } bit;
  } NVM_PROT_STS;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Memory Status Register                                     */
    
