popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t SECTORINFO : 6;            /*!< [5..0] Sector number where the Service Algorithm is running
                                                                                                                               */
      __IOM uint32_t SASTATUS   : 2;            /*!< [7..6] Service Algorithm Status                                           */
            uint32_t            : 24;
    } bit;
  } MEMSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Stack Overflow Control Register                            */
    
    struct {
      __IOM uint32_t STOF_EN    : 1;            /*!< [0..0] Stack Overflow Enable                                              */
            uint32_t            : 31;
    } bit;
  } STACK_OVF_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Stack Overflow Address Register                            */
    
    struct {
            uint32_t            : 2;
      __IOM uint32_t STOF_ADDR_OFF_L : 13;      /*!< [14..2] Lower DSRAM address offset boundary for stack overflow
                                                     protection                                                                */
            uint32_t            : 3;
      __IOM uint32_t STOF_ADDR_OFF_H : 13;      /*!< [30..18] Higher DSRAM address offset boundary for stack overflow
                                                     protection                                                                */
            uint32_t            : 1;
    } bit;
  } STACK_OVF_ADDR;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) System Tick Calibration Register                           */
    
    struct {
      __IOM uint32_t STCALIB    : 26;           /*!< [25..0] System Tick Calibration                                           */
            uint32_t            : 6;
    } bit;
  } STCALIB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) System Watchdog Timer Control Register                     */
    
    struct {
      __IOM uint32_t WDTIN      : 1;            /*!< [0..0] Watchdog Timer Input Frequency Selection                           */
      __IOM uint32_t WDTRS      : 1;            /*!< [1..1] WDT Refresh Start                                                  */
      __IOM uint32_t WDTEN      : 1;            /*!< [2..2] WDT Enable                                                         */
            uint32_t            : 1;
      __IM  uint32_t WDTPR      : 1;            /*!< [4..4] Watchdog Prewarning Mode Flag                                      */
      __IOM uint32_t WDTBEN     : 1;            /*!< [5..5] Watchdog Window-Boundary Enable                                    */
            uint32_t            : 26;
    } bit;
  } SYSWDTCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) System Watchdog Timer Reload Register                      */
    
    struct {
      __IOM uint32_t WDTREL     : 8;            /*!< [7..0] Watchdog Timer Reload Value - Upper Watchdog Timer Byte            */
            uint32_t            : 24;
    } bit;
  } SYSWDTREL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000C0) System Watchdog Timer Value                                */
    
    struct {
      __IM  uint32_t WDT        : 16;           /*!< [15..0] Watchdog Timer Current Value                                      */
            uint32_t            : 16;
    } bit;
  } SYSWDT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) System Watchdog Window-Boundary Count                      */
    
    struct {
      __IOM uint32_t WDTWINB    : 8;            /*!< [7..0] Watchdog Window-Boundary Count Value                               */
            uint32_t            : 24;
    } bit;
  } SYSWDTWINB;
  __IM  uint32_t  RESERVED3[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) NVM0 AEP Control Register                                  */
    
    struct {
      __IOM uint32_t NVM0_ACCDIS : 1;           /*!< [0..0] NVM0 Access Disable for AEP                                        */
            uint32_t            : 31;
    } bit;
  } AEP_CTRL;
} MEMCTRL_Type;                                 /*!< Size = 220 (0xdc)                                                         */



/* =========================================================================================================================== */
/* ================                                            PLL                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PLL (PLL)
  */

typedef struct {                                /*!< (@ 0x48008000) PLL Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) PLL0 Control Register                                      */
    
    struct {
      __IOM uint32_t NDIV       : 8;            /*!< [7..0] N-Divider Setting                                                  */
      __IOM uint32_t PDIV       : 6;            /*!< [13..8] P-Divider Setting                                                 */
            uint32_t            : 2;
      __IOM uint32_t K2DIV      : 3;            /*!< [18..16] K2-Divider Setting                                               */
            uint32_t            : 1;
      __IOM uint32_t INSEL      : 2;            /*!< [21..20] PLL Reference Clock Select                                       */
            uint32_t            : 2;
      __IOM uint32_t FREERUN    : 1;            /*!< [24..24] Freerunning Mode Select                                          */
      __OM  uint32_t RESLD      : 1;            /*!< [25..25] Lock Detection Reset                                             */
            uint32_t            : 5;
      __IOM uint32_t PLLEN      : 1;            /*!< [31..31] PLL Enable                                                       */
    } bit;
  } CON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) PLL1 Control Register                                      */
    
