popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t NDIV       : 8;            /*!< [7..0] N-Divider Setting                                                  */
      __IOM uint32_t PDIV       : 6;            /*!< [13..8] P-Divider Setting                                                 */
            uint32_t            : 2;
      __IOM uint32_t K2DIV      : 3;            /*!< [18..16] K2-Divider Setting                                               */
            uint32_t            : 1;
      __IOM uint32_t INSEL      : 2;            /*!< [21..20] PLL Reference Clock Select                                       */
            uint32_t            : 2;
      __IOM uint32_t FREERUN    : 1;            /*!< [24..24] Freerunning Mode Select                                          */
      __OM  uint32_t RESLD      : 1;            /*!< [25..25] Lock Detection Reset                                             */
            uint32_t            : 5;
      __IOM uint32_t PLLEN      : 1;            /*!< [31..31] PLL Enable                                                       */
    } bit;
  } CON1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) PLL NDIV Spread Control Register                           */
    
    struct {
      __IOM uint32_t SPEN0      : 1;            /*!< [0..0] NDIV PLL0 Spread Enable                                            */
            uint32_t            : 3;
      __IOM uint32_t SPRANGE0   : 2;            /*!< [5..4] PLL0 NDIV Spread Range Value                                       */
      __IOM uint32_t SPUPVAL0   : 10;           /*!< [15..6] PLL0 NDIV Spread Update Interval                                  */
      __IOM uint32_t SPEN1      : 1;            /*!< [16..16] NDIV PLL1 Spread Enable                                          */
            uint32_t            : 3;
      __IOM uint32_t SPRANGE1   : 2;            /*!< [21..20] PLL1 NDIV Spread Range Value                                     */
      __IOM uint32_t SPUPVAL1   : 10;           /*!< [31..22] PLL1 NDIV Spread Update Interval                                 */
    } bit;
  } SPCTR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) PLL Status Register                                        */
    
    struct {
      __IM  uint32_t LCK0       : 1;            /*!< [0..0] Lock Status PLL 0                                                  */
      __IM  uint32_t LCK1       : 1;            /*!< [1..1] Lock Status PLL1                                                   */
            uint32_t            : 2;
      __IM  uint32_t PLL0_LOL_STS : 1;          /*!< [4..4] PLL0 Loss Of Lock Status                                           */
      __IM  uint32_t PLL1_LOL_STS : 1;          /*!< [5..5] PLL1 Loss Of Lock Status                                           */
            uint32_t            : 10;
      __IM  uint32_t OSCSEL_STAT0 : 1;          /*!< [16..16] Oscillator Select Status PLL0                                    */
      __IM  uint32_t OSCSEL_STAT1 : 1;          /*!< [17..17] Oscillator Select Status PLL1                                    */
            uint32_t            : 14;
    } bit;
  } STAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) PLL Status Clear Register                                  */
    
    struct {
      __OM  uint32_t PLL0_LOL_STSCLR : 1;       /*!< [0..0] PLL0 Loss Of Lock Status Clear                                     */
      __OM  uint32_t PLL1_LOL_STSCLR : 1;       /*!< [1..1] PLL1 Loss Of Lock Status Clear                                     */
            uint32_t            : 30;
    } bit;
  } STATC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) PLL Status Set Register                                    */
    
    struct {
      __OM  uint32_t PLL0_LOL_STSSET : 1;       /*!< [0..0] PLL0 Loss Of Lock Status Set                                       */
      __OM  uint32_t PLL1_LOL_STSSET : 1;       /*!< [1..1] PLL1 Loss Of Lock Status Set                                       */
            uint32_t            : 30;
    } bit;
  } STATS;
} PLL_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power Management Unit (PMU)
  */

typedef struct {                                /*!< (@ 0x48000000) PMU Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) VDDP voltage regulator control register                    */
    
    struct {
      __IOM uint32_t MCNFSTOP   : 2;            /*!< [1..0] Stop mode configuration of VDDP regulator                          */
      __IOM uint32_t ITH_SEL    : 1;            /*!< [2..2] Select current threshold for LCM/HCM mode                          */
            uint32_t            : 29;
    } bit;
  } VDDP_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) VDDP interrupt enable register                             */
    
    struct {
      __IOM uint32_t UVWARN_IEN : 1;            /*!< [0..0] VDDP undervoltage warning interrupt enable                         */
      __IOM uint32_t OV_IEN     : 1;            /*!< [1..1] VDDP overvoltage interrupt enable                                  */
            uint32_t            : 30;
    } bit;
  } VDDP_IRQEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) VDDP regulator status register                             */
    
    struct {
      __IM  uint32_t UVWARN_IS  : 1;            /*!< [0..0] VDDP undervoltage warning interrupt status                         */
      __IM  uint32_t OV_IS      : 1;            /*!< [1..1] VDDP overvoltage interrupt status                                  */
            uint32_t            : 14;
      __IM  uint32_t UVWARN_STS : 1;            /*!< [16..16] VDDP undervoltage warning status                                 */
            uint32_t            : 3;
      __IM  uint32_t ILIM_STS   : 1;            /*!< [20..20] VDDP current limitation status                                   */
      __IM  uint32_t HCM_STS    : 1;            /*!< [21..21] VDDP high current mode status                                    */
            uint32_t            : 10;
    } bit;
  } VDDP_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) VDDP regulator status clear register                       */
    
