popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t UVWARN_IS_CLR : 1;         /*!< [0..0] VDDP undervoltage warning interrupt status clear                   */
      __OM  uint32_t OV_IS_CLR  : 1;            /*!< [1..1] VDDP overvoltage interrupt status clear                            */
            uint32_t            : 14;
      __OM  uint32_t UVWARN_STS_CLR : 1;        /*!< [16..16] VDDP undervoltage warning status clear                           */
            uint32_t            : 3;
      __OM  uint32_t ILIM_STS_CLR : 1;          /*!< [20..20] VDDP current limitation status clear                             */
      __OM  uint32_t HCM_STS_CLR : 1;           /*!< [21..21] VDDP high current mode status clear                              */
            uint32_t            : 10;
    } bit;
  } VDDP_STS_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) VDDP regulator status set register                         */
    
    struct {
      __OM  uint32_t UVWARN_IS_SET : 1;         /*!< [0..0] VDDP undervoltage warning interrupt status set                     */
      __OM  uint32_t OV_IS_SET  : 1;            /*!< [1..1] VDDP overvoltage interrupt status set                              */
            uint32_t            : 14;
      __OM  uint32_t UVWARN_STS_SET : 1;        /*!< [16..16] VDDP undervoltage warning status set                             */
            uint32_t            : 3;
      __OM  uint32_t ILIM_STS_SET : 1;          /*!< [20..20] VDDP Ilimit status set                                           */
      __OM  uint32_t HCM_STS_SET : 1;           /*!< [21..21] VDDP high current mode status set                                */
            uint32_t            : 10;
    } bit;
  } VDDP_STS_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) VDDC voltage regulator control register                    */
    
    struct {
      __IOM uint32_t MCNFSTOP   : 2;            /*!< [1..0] Stop mode configuration of VDDC regulator                          */
            uint32_t            : 30;
    } bit;
  } VDDC_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) VDDC interrupt enable register                             */
    
    struct {
      __IOM uint32_t UVWARN_IEN : 1;            /*!< [0..0] VDDC undervoltage warning interrupt enable                         */
      __IOM uint32_t OV_IEN     : 1;            /*!< [1..1] VDDC overvoltage interrupt enable                                  */
            uint32_t            : 30;
    } bit;
  } VDDC_IRQEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000001C) VDDC regulator status register                             */
    
    struct {
      __IM  uint32_t UVWARN_IS  : 1;            /*!< [0..0] VDDC undervoltage warning interrupt status                         */
      __IM  uint32_t OV_IS      : 1;            /*!< [1..1] VDDC overvoltage interrupt status                                  */
            uint32_t            : 14;
      __IM  uint32_t UVWARN_STS : 1;            /*!< [16..16] VDDC undervoltage warning status                                 */
            uint32_t            : 4;
      __IM  uint32_t HCM_STS    : 1;            /*!< [21..21] VDDC high current mode status                                    */
            uint32_t            : 10;
    } bit;
  } VDDC_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) VDDC regulator status clear register                       */
    
    struct {
      __OM  uint32_t UVWARN_IS_CLR : 1;         /*!< [0..0] VDDC undervoltage warning interrupt status clear                   */
      __OM  uint32_t OV_IS_CLR  : 1;            /*!< [1..1] Overvoltage interrupt status clear                                 */
            uint32_t            : 14;
      __OM  uint32_t UVWARN_STS_CLR : 1;        /*!< [16..16] VDDC undervoltage warning status clear                           */
            uint32_t            : 4;
      __OM  uint32_t HCM_STS_CLR : 1;           /*!< [21..21] VDDC high current mode status clear                              */
            uint32_t            : 10;
    } bit;
  } VDDC_STS_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) VDDC regulator status set register                         */
    
    struct {
      __OM  uint32_t UVWARN_IS_SET : 1;         /*!< [0..0] VDDC undervoltage warning interrupt status set                     */
      __OM  uint32_t OV_IS_SET  : 1;            /*!< [1..1] VDDC overvoltage interrupt status set                              */
            uint32_t            : 14;
      __OM  uint32_t UVWARN_STS_SET : 1;        /*!< [16..16] VDDC undervoltage warning status set                             */
            uint32_t            : 4;
      __OM  uint32_t HCM_STS_SET : 1;           /*!< [21..21] VDDC high current mode status set                                */
            uint32_t            : 10;
    } bit;
  } VDDC_STS_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) VDDEXT voltage regulator control register                  */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] VDDEXT enable                                                      */
      __IOM uint32_t CYC_EN     : 1;            /*!< [1..1] VDDEXT cyclic sense enable                                         */
            uint32_t            : 30;
    } bit;
  } VDDEXT_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) VDDEXT interrupt enable register                           */
    
    struct {
      __IOM uint32_t UV_IEN     : 1;            /*!< [0..0] VDDEXT undervoltage interrupt enable                               */
      __IOM uint32_t OT_IEN     : 1;            /*!< [1..1] VDDEXT overtemperature interrupt enable                            */
            uint32_t            : 30;
    } bit;
  } VDDEXT_IRQEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) VDDEXT regulator status register                           */
    
