popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t UV_IS      : 1;            /*!< [0..0] VDDEXT undervoltage interrupt status                               */
      __IM  uint32_t OT_IS      : 1;            /*!< [1..1] VDDEXT overtemperature interrupt status                            */
            uint32_t            : 14;
      __IM  uint32_t UV_STS     : 1;            /*!< [16..16] VDDEXT undervoltage status                                       */
      __IM  uint32_t OT_STS     : 1;            /*!< [17..17] VDDEXT overtemperature status                                    */
            uint32_t            : 14;
    } bit;
  } VDDEXT_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) VDDEXT regulator status register clear                     */
    
    struct {
      __OM  uint32_t UV_IS_CLR  : 1;            /*!< [0..0] VDDEXT undervoltage interrupt status clear                         */
      __OM  uint32_t OT_IS_CLR  : 1;            /*!< [1..1] VDDEXT overtemperature interrupt status clear                      */
            uint32_t            : 14;
      __OM  uint32_t UV_STS_CLR : 1;            /*!< [16..16] VDDEXT undervoltage status clear                                 */
      __OM  uint32_t OT_STS_CLR : 1;            /*!< [17..17] VDDEXT overtemperature status clear                              */
            uint32_t            : 14;
    } bit;
  } VDDEXT_STS_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) VDDEXT regulator status register set                       */
    
    struct {
      __OM  uint32_t UV_IS_SET  : 1;            /*!< [0..0] VDDEXT undervoltage interrupt status set                           */
      __OM  uint32_t OT_IS_SET  : 1;            /*!< [1..1] VDDEXT overtemperature interrupt status set                        */
            uint32_t            : 14;
      __OM  uint32_t UV_STS_SET : 1;            /*!< [16..16] VDDEXT undervoltage status set                                   */
      __OM  uint32_t OT_STS_SET : 1;            /*!< [17..17] VDDEXT overtemperature status set                                */
            uint32_t            : 14;
    } bit;
  } VDDEXT_STS_SET;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000003C) Wake fail status register                                  */
    
    struct {
      __IM  uint32_t VDDP_TMOUT : 1;            /*!< [0..0] VDDP regulator timeout                                             */
      __IM  uint32_t VDDC_TMOUT : 1;            /*!< [1..1] VDDP regulator timeout                                             */
      __IM  uint32_t HPCLK_FAIL : 1;            /*!< [2..2] HP clock fail status                                               */
      __IM  uint32_t SYS_OT     : 1;            /*!< [3..3] System overtemperature status                                      */
      __IM  uint32_t FSWD_SEQ_FAIL : 1;         /*!< [4..4] Fail safe watchdog sequential fail status                          */
      __IM  uint32_t VDDP_OT    : 1;            /*!< [5..5] VDDP regulator overtemperature status                              */
      __IM  uint32_t VDDC_OC    : 1;            /*!< [6..6] VDDC overcurrent Status                                            */
            uint32_t            : 25;
    } bit;
  } WAKE_FAIL_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Wake fail status clear register                            */
    
    struct {
      __OM  uint32_t VDDP_TMOUT_CLR : 1;        /*!< [0..0] VDDP Regulator timeout Status Clear                                */
      __OM  uint32_t VDDC_TMOUT_CLR : 1;        /*!< [1..1] VDDP regulator timeout status clear                                */
      __OM  uint32_t HPCLK_FAIL_CLR : 1;        /*!< [2..2] HP clock fail status clear                                         */
      __OM  uint32_t SYS_OT_CLR : 1;            /*!< [3..3] System overtemperature status clear                                */
      __OM  uint32_t FSWD_SEQ_FAIL_CLR : 1;     /*!< [4..4] Fail safe watchdog sequential fail status clear                    */
      __OM  uint32_t VDDP_OT_CLR : 1;           /*!< [5..5] VDDP regulator overtemperature status clear                        */
      __OM  uint32_t VDDC_OC_CLR : 1;           /*!< [6..6] VDDC overcurrent status clear                                      */
            uint32_t            : 25;
    } bit;
  } WAKE_FAIL_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Wake fail status set register                              */
    
    struct {
      __OM  uint32_t VDDP_TMOUT_SET : 1;        /*!< [0..0] VDDP regulator timeout status set                                  */
      __OM  uint32_t VDDC_TMOUT_SET : 1;        /*!< [1..1] VDDP regulator timeout status set                                  */
      __OM  uint32_t HPCLK_FAIL_SET : 1;        /*!< [2..2] HP clock fail status set                                           */
      __OM  uint32_t SYS_OT_SET : 1;            /*!< [3..3] System overtemperature status set                                  */
      __OM  uint32_t FSWD_SEQ_FAIL_SET : 1;     /*!< [4..4] Fails safe watchdog sequential fail status set                     */
      __OM  uint32_t VDDP_OT_SET : 1;           /*!< [5..5] VDDP regulator overtemperature status set                          */
      __OM  uint32_t VDDC_OC_SET : 1;           /*!< [6..6] VDDC overcurrent status set                                        */
            uint32_t            : 25;
    } bit;
  } WAKE_FAIL_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) RESET pin control register                                 */
    
    struct {
      __IOM uint32_t TFB        : 3;            /*!< [2..0] Reset blind time selection                                         */
            uint32_t            : 29;
    } bit;
  } RST_CTRL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000004C) Reset status register                                      */
    
