popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t VMSUP_UV_RST : 1;          /*!< [0..0] Master supply undervoltage reset status                            */
      __IM  uint32_t MCLK_WD_RST : 1;           /*!< [1..1] Master clock watchdog reset status                                 */
      __IM  uint32_t FS_SLEEPEX_RST : 1;        /*!< [2..2] Fail Sleep mode exit reset status                                  */
      __IM  uint32_t SLEEPEX_RST : 1;           /*!< [3..3] Sleep mode exit reset status                                       */
      __IM  uint32_t STOPEX_RST : 1;            /*!< [4..4] Stop mode exit reset status                                        */
      __IM  uint32_t PIN_RST    : 1;            /*!< [5..5] Pin-Reset reset status                                             */
      __IM  uint32_t FSWD_RST   : 1;            /*!< [6..6] Fail safe watchdog reset status                                    */
      __IM  uint32_t WDT_MCU_RST : 1;           /*!< [7..7] MCU watchdog timer reset status                                    */
      __IM  uint32_t SOFT_RST   : 1;            /*!< [8..8] Soft reset status                                                  */
      __IM  uint32_t LOCKUP_RST : 1;            /*!< [9..9] ARM core lockup reset status                                       */
      __IM  uint32_t VDDP_UV_RST : 1;           /*!< [10..10] VDDP undervoltage reset status                                   */
      __IM  uint32_t VDDC_UV_RST : 1;           /*!< [11..11] VDDC undervoltage reset status                                   */
      __IM  uint32_t SEC_STACK_RST : 1;         /*!< [12..12] Secure stack overflow reset status                               */
            uint32_t            : 19;
    } bit;
  } RESET_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Reset status clear register                                */
    
    struct {
      __OM  uint32_t VMSUP_UV_RST_CLR : 1;      /*!< [0..0] Master supply undervoltage reset status clear                      */
      __OM  uint32_t MCLK_WD_RST_CLR : 1;       /*!< [1..1] Master clock watchdog reset status clear                           */
      __OM  uint32_t FS_SLEEPEX_RST_CLR : 1;    /*!< [2..2] Fail Sleep mode exit reset status clear                            */
      __OM  uint32_t SLEEPEX_RST_CLR : 1;       /*!< [3..3] Sleep mode exit reset status clear                                 */
      __OM  uint32_t STOPEX_RST_CLR : 1;        /*!< [4..4] Stop mode exit reset status clear                                  */
      __OM  uint32_t PIN_RST_CLR : 1;           /*!< [5..5] Pin reset Status Clear                                             */
      __OM  uint32_t FSWD_RST_CLR : 1;          /*!< [6..6] Fail safe watchdog reset status clear                              */
      __OM  uint32_t WDT_MCU_RST_CLR : 1;       /*!< [7..7] MCU watchdog timer reset status clear                              */
      __OM  uint32_t SOFT_RST_CLR : 1;          /*!< [8..8] Soft reset status clear                                            */
      __OM  uint32_t LOCKUP_RST_CLR : 1;        /*!< [9..9] ARM core lockup reset status                                       */
      __OM  uint32_t VDDP_UV_RST_CLR : 1;       /*!< [10..10] VDDP undervoltage reset status clear                             */
      __OM  uint32_t VDDC_UV_RST_CLR : 1;       /*!< [11..11] VDDC undervoltage reset status clear                             */
      __OM  uint32_t SEC_STACK_RST_CLR : 1;     /*!< [12..12] Secure stack overflow reset status clear                         */
            uint32_t            : 19;
    } bit;
  } RESET_STS_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Reset status set register                                  */
    
    struct {
      __OM  uint32_t VMSUP_UV_RST_SET : 1;      /*!< [0..0] Master supply undervoltage reset status set                        */
      __OM  uint32_t MCLK_WD_RST_SET : 1;       /*!< [1..1] Master clock watchdog reset status set                             */
      __OM  uint32_t FS_SLEEPEX_RST_SET : 1;    /*!< [2..2] Fail Sleep mode exit reset status set                              */
      __OM  uint32_t SLEEPEX_RST_SET : 1;       /*!< [3..3] Sleep mode exit reset status set                                   */
      __OM  uint32_t STOPEX_RST_SET : 1;        /*!< [4..4] Stop mode exit reset status set                                    */
      __OM  uint32_t PIN_RST_SET : 1;           /*!< [5..5] Pin reset status set                                               */
      __OM  uint32_t FSWD_RST_SET : 1;          /*!< [6..6] Fail safe watchdog reset status set                                */
      __OM  uint32_t WDT_MCU_RST_SET : 1;       /*!< [7..7] MCU watchdog timer reset status set                                */
      __OM  uint32_t SOFT_RST_SET : 1;          /*!< [8..8] Soft reset status set                                              */
      __OM  uint32_t LOCKUP_RST_SET : 1;        /*!< [9..9] ARM core lockup reset status set                                   */
      __OM  uint32_t VDDP_UV_RST_SET : 1;       /*!< [10..10] VDDP undervoltage reset status set                               */
      __OM  uint32_t VDDC_UV_RST_SET : 1;       /*!< [11..11] VDDC undervoltage reset status set                               */
      __OM  uint32_t SEC_STACK_RST_SET : 1;     /*!< [12..12] Secure stack overflow reset status set                           */
            uint32_t            : 19;
    } bit;
  } RESET_STS_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Wake up filter control register                            */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t MON_FT     : 1;            /*!< [1..1] MON wake up filter time selection                                  */
      __IOM uint32_t GPIO_FT    : 2;            /*!< [3..2] GPIO wake up filter time selection                                 */
            uint32_t            : 28;
    } bit;
  } WAKE_FILT_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Cyclic sense / Cyclic wake control register                */
    
