popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CYC_SENSE_EN : 1;          /*!< [0..0] Cyclic sense enable                                                */
            uint32_t            : 3;
      __IOM uint32_t CYC_ON_TIME : 3;           /*!< [6..4] On time in cyclic sense mode                                       */
            uint32_t            : 9;
      __IOM uint32_t CYC_SENSE_M03 : 4;         /*!< [19..16] Cyclic sense timer mantissa                                      */
      __IOM uint32_t CYC_SENSE_E01 : 2;         /*!< [21..20] Cyclic sense timer exponent                                      */
            uint32_t            : 2;
      __IOM uint32_t CYC_WAKE_M03 : 4;          /*!< [27..24] Cyclic wake timer mantissa                                       */
      __IOM uint32_t CYC_WAKE_E01 : 2;          /*!< [29..28] Cyclic wake timer exponent                                       */
            uint32_t            : 2;
    } bit;
  } CYC_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) GPIO wake control register                                 */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Rising edge wake enable                                            */
      __IOM uint32_t FA         : 1;            /*!< [1..1] Falling edge wake enable                                           */
      __IOM uint32_t CYC        : 1;            /*!< [2..2] Cyclic sense enable                                                */
            uint32_t            : 5;
      __IOM uint32_t INP        : 5;            /*!< [12..8] GPIO input pointer                                                */
            uint32_t            : 19;
    } bit;
  } WAKE_GPIO_CTRL0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) GPIO wake control register                                 */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Rising edge wake enable                                            */
      __IOM uint32_t FA         : 1;            /*!< [1..1] Falling edge wake enable                                           */
      __IOM uint32_t CYC        : 1;            /*!< [2..2] Cyclic sense enable                                                */
            uint32_t            : 5;
      __IOM uint32_t INP        : 5;            /*!< [12..8] GPIO input pointer                                                */
            uint32_t            : 19;
    } bit;
  } WAKE_GPIO_CTRL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) GPIO wake control register                                 */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Rising edge wake enable                                            */
      __IOM uint32_t FA         : 1;            /*!< [1..1] Falling edge wake enable                                           */
      __IOM uint32_t CYC        : 1;            /*!< [2..2] Cyclic sense enable                                                */
            uint32_t            : 5;
      __IOM uint32_t INP        : 5;            /*!< [12..8] GPIO input pointer                                                */
            uint32_t            : 19;
    } bit;
  } WAKE_GPIO_CTRL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) GPIO wake control register                                 */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Rising edge wake enable                                            */
      __IOM uint32_t FA         : 1;            /*!< [1..1] Falling edge wake enable                                           */
      __IOM uint32_t CYC        : 1;            /*!< [2..2] Cyclic sense enable                                                */
            uint32_t            : 5;
      __IOM uint32_t INP        : 5;            /*!< [12..8] GPIO input pointer                                                */
            uint32_t            : 19;
    } bit;
  } WAKE_GPIO_CTRL3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) GPIO wake control register                                 */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Rising edge wake enable                                            */
      __IOM uint32_t FA         : 1;            /*!< [1..1] Falling edge wake enable                                           */
      __IOM uint32_t CYC        : 1;            /*!< [2..2] Cyclic sense enable                                                */
            uint32_t            : 5;
      __IOM uint32_t INP        : 5;            /*!< [12..8] GPIO input pointer                                                */
            uint32_t            : 19;
    } bit;
  } WAKE_GPIO_CTRL4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) GPIO wake control register                                 */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Rising edge wake enable                                            */
      __IOM uint32_t FA         : 1;            /*!< [1..1] Falling edge wake enable                                           */
      __IOM uint32_t CYC        : 1;            /*!< [2..2] Cyclic sense enable                                                */
            uint32_t            : 5;
      __IOM uint32_t INP        : 5;            /*!< [12..8] GPIO input pointer                                                */
            uint32_t            : 19;
    } bit;
  } WAKE_GPIO_CTRL5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) MON input control register                                 */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] MON input enable                                                   */
      __IOM uint32_t WAKE_RISE  : 1;            /*!< [1..1] Rising edge wake enable                                            */
      __IOM uint32_t WAKE_FALL  : 1;            /*!< [2..2] Falling edge wake enable                                           */
      __IOM uint32_t CYC_SENSE_EN : 1;          /*!< [3..3] Cyclic sense enable                                                */
      __IOM uint32_t PU         : 1;            /*!< [4..4] Input pull up current Source enable                                */
      __IOM uint32_t PD         : 1;            /*!< [5..5] Input pull down current source enable                              */
            uint32_t            : 26;
    } bit;
  } MON_CTRL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) MON input control register                                 */
    
