popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] MON input enable                                                   */
      __IOM uint32_t WAKE_RISE  : 1;            /*!< [1..1] Rising edge wake enable                                            */
      __IOM uint32_t WAKE_FALL  : 1;            /*!< [2..2] Falling edge wake enable                                           */
      __IOM uint32_t CYC_SENSE_EN : 1;          /*!< [3..3] Cyclic sense enable                                                */
      __IOM uint32_t PU         : 1;            /*!< [4..4] Input pull up current Source enable                                */
      __IOM uint32_t PD         : 1;            /*!< [5..5] Input pull down current source enable                              */
            uint32_t            : 26;
    } bit;
  } MON_CTRL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) MON input control register                                 */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] MON input enable                                                   */
      __IOM uint32_t WAKE_RISE  : 1;            /*!< [1..1] Rising edge wake enable                                            */
      __IOM uint32_t WAKE_FALL  : 1;            /*!< [2..2] Falling edge wake enable                                           */
      __IOM uint32_t CYC_SENSE_EN : 1;          /*!< [3..3] Cyclic sense enable                                                */
      __IOM uint32_t PU         : 1;            /*!< [4..4] Input pull up current Source enable                                */
      __IOM uint32_t PD         : 1;            /*!< [5..5] Input pull down current source enable                              */
            uint32_t            : 26;
    } bit;
  } MON_CTRL3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000084) MON input status register                                  */
    
    struct {
      __IM  uint32_t MON1_STS   : 1;            /*!< [0..0] MON1 input status                                                  */
      __IM  uint32_t MON2_STS   : 1;            /*!< [1..1] MON2 input status                                                  */
      __IM  uint32_t MON3_STS   : 1;            /*!< [2..2] MON3 input status                                                  */
            uint32_t            : 29;
    } bit;
  } MON_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Wake control register                                      */
    
    struct {
      __IOM uint32_t CAN_WAKE_EN : 1;           /*!< [0..0] CAN wake enable                                                    */
            uint32_t            : 1;
      __IOM uint32_t CYC_WAKE_EN : 1;           /*!< [2..2] Cyclic wake enable                                                 */
            uint32_t            : 1;
      __IOM uint32_t GPIO0_WAKE_EN : 1;         /*!< [4..4] GPIO0 wake enable                                                  */
      __IOM uint32_t GPIO1_WAKE_EN : 1;         /*!< [5..5] GPIO1 wake enable                                                  */
      __IOM uint32_t GPIO2_WAKE_EN : 1;         /*!< [6..6] GPIO2 wake enable                                                  */
      __IOM uint32_t GPIO3_WAKE_EN : 1;         /*!< [7..7] GPIO3 wake enable                                                  */
      __IOM uint32_t GPIO4_WAKE_EN : 1;         /*!< [8..8] GPIO4 wake enable                                                  */
      __IOM uint32_t GPIO5_WAKE_EN : 1;         /*!< [9..9] GPIO5 wake enable                                                  */
            uint32_t            : 2;
      __IOM uint32_t MON1_WAKE_EN : 1;          /*!< [12..12] MON1 wake enable                                                 */
      __IOM uint32_t MON2_WAKE_EN : 1;          /*!< [13..13] MON2 wake enable                                                 */
      __IOM uint32_t MON3_WAKE_EN : 1;          /*!< [14..14] MON3 wake enable                                                 */
            uint32_t            : 1;
      __IOM uint32_t VDDP_UVWARN_WAKE_EN : 1;   /*!< [16..16] Stop mode VDDP undervoltage warning wake enable                  */
      __IOM uint32_t VDDP_OV_WAKE_EN : 1;       /*!< [17..17] Stop mode VDDP overvoltage wake enable                           */
      __IOM uint32_t VDDP_HCM_WAKE_EN : 1;      /*!< [18..18] Stop mode VDDP high current mode wake enable                     */
      __IOM uint32_t VDDC_UVWARN_WAKE_EN : 1;   /*!< [19..19] Stop mode VDDC undervoltage warning wake enable                  */
      __IOM uint32_t VDDC_OV_WAKE_EN : 1;       /*!< [20..20] Stop mode VDDC overvoltage wake enable                           */
      __IOM uint32_t VDDC_HCM_WAKE_EN : 1;      /*!< [21..21] Stop mode VDDC high current mode wake enable                     */
      __IOM uint32_t VDDEXT_OT_WAKE_EN : 1;     /*!< [22..22] Stop mode VDDEXT overtemperature wake enable                     */
      __IOM uint32_t VDDEXT_UV_WAKE_EN : 1;     /*!< [23..23] Stop mode VDDEXT undervoltage wake enable                        */
      __IOM uint32_t VSDOV_WAKE_EN : 1;         /*!< [24..24] VSD overvoltage wake enable                                      */
            uint32_t            : 3;
      __IOM uint32_t WAKE_W_RST : 1;            /*!< [28..28] Stop mode - Wake with reset enable                               */
      __IOM uint32_t VDDC_RED_EN : 1;           /*!< [29..29] Stop mode - VDDC output voltage reduction enable                 */
            uint32_t            : 2;
    } bit;
  } WAKE_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Wake status register                                       */
    
    struct {
      __IM  uint32_t CAN        : 1;            /*!< [0..0] CAN wake status                                                    */
            uint32_t            : 1;
      __IM  uint32_t CYC_WAKE   : 1;            /*!< [2..2] Cyclic wake status                                                 */
            uint32_t            : 1;
      __IM  uint32_t GPIO0      : 1;            /*!< [4..4] GPIO0 wake status                                                  */
      __IM  uint32_t GPIO1      : 1;            /*!< [5..5] GPIO1 wake status                                                  */
      __IM  uint32_t GPIO2      : 1;            /*!< [6..6] GPIO2 wake status                                                  */
      __IM  uint32_t GPIO3      : 1;            /*!< [7..7] GPIO3 wake status                                                  */
      __IM  uint32_t GPIO4      : 1;            /*!< [8..8] GPIO4 wake status                                                  */
      __IM  uint32_t GPIO5      : 1;            /*!< [9..9] GPIO5 wake status                                                  */
            uint32_t            : 2;
      __IM  uint32_t MON1       : 1;            /*!< [12..12] MON1 wake status                                                 */
      __IM  uint32_t MON2       : 1;            /*!< [13..13] MON2 wake status                                                 */
      __IM  uint32_t MON3       : 1;            /*!< [14..14] MON3 wake status                                                 */
            uint32_t            : 1;
      __IM  uint32_t VDDP_UVWARN : 1;           /*!< [16..16] VDDP undervoltage warning wake status                            */
      __IM  uint32_t VDDP_OV    : 1;            /*!< [17..17] VDDP overvoltage wake status                                     */
      __IM  uint32_t VDDP_HCM   : 1;            /*!< [18..18] VDDP high current mode wake Status                               */
      __IM  uint32_t VDDC_UVWARN : 1;           /*!< [19..19] VDDC undervoltage warning wake status                            */
      __IM  uint32_t VDDC_OV    : 1;            /*!< [20..20] VDDC overvoltage wake status                                     */
      __IM  uint32_t VDDC_HCM   : 1;            /*!< [21..21] VDDC high current mode wake status                               */
      __IM  uint32_t VDDEXT_OT  : 1;            /*!< [22..22] VDDEXT overtemperture wake status                                */
      __IM  uint32_t VDDEXT_UV  : 1;            /*!< [23..23] VDDEXT undervoltage wake status                                  */
      __IOM uint32_t VSD_OV     : 1;            /*!< [24..24] VSD overvoltage wake status                                      */
            uint32_t            : 7;
    } bit;
  } WAKE_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Wake status clear register                                 */
    
