popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t CAN_CLR    : 1;            /*!< [0..0] CAN wake status clear                                              */
            uint32_t            : 1;
      __OM  uint32_t CYC_WAKE_CLR : 1;          /*!< [2..2] Cyclic wake status                                                 */
            uint32_t            : 1;
      __OM  uint32_t GPIO0_CLR  : 1;            /*!< [4..4] GPIO0 wake status clear                                            */
      __OM  uint32_t GPIO1_CLR  : 1;            /*!< [5..5] GPIO1 wake status clear                                            */
      __OM  uint32_t GPIO2_CLR  : 1;            /*!< [6..6] GPIO2 wake status clear                                            */
      __OM  uint32_t GPIO3_CLR  : 1;            /*!< [7..7] GPIO3 wake status clear                                            */
      __OM  uint32_t GPIO4_CLR  : 1;            /*!< [8..8] GPIO4 wake status clear                                            */
      __OM  uint32_t GPIO5_CLR  : 1;            /*!< [9..9] GPIO5 wake status clear                                            */
            uint32_t            : 2;
      __OM  uint32_t MON1_CLR   : 1;            /*!< [12..12] MON1 wake status clear                                           */
      __OM  uint32_t MON2_CLR   : 1;            /*!< [13..13] MON2 wake status clear                                           */
      __OM  uint32_t MON3_CLR   : 1;            /*!< [14..14] MON3 wake status clear                                           */
            uint32_t            : 1;
      __OM  uint32_t VDDP_UVWARN_CLR : 1;       /*!< [16..16] VDDP undervoltage warning wake status clear                      */
      __OM  uint32_t VDDP_OV_CLR : 1;           /*!< [17..17] VDDP overvoltage wake status clear                               */
      __OM  uint32_t VDDP_HCM_CLR : 1;          /*!< [18..18] VDDP high current mode wake status clear                         */
      __OM  uint32_t VDDC_UVWARN_CLR : 1;       /*!< [19..19] VDDC undervoltage warning wake status clear                      */
      __OM  uint32_t VDDC_OV_CLR : 1;           /*!< [20..20] VDDC overvoltage wake status clear                               */
      __OM  uint32_t VDDC_HCM_CLR : 1;          /*!< [21..21] VDDC high current mode wake status clear                         */
      __OM  uint32_t VDDEXT_OT_CLR : 1;         /*!< [22..22] VDDEXT overtemperture wake status clear                          */
      __OM  uint32_t VDDEXT_UV_CLR : 1;         /*!< [23..23] VDDEXT undervoltage wake status clear                            */
      __OM  uint32_t VSD_OV_CLR : 1;            /*!< [24..24] VSD undervoltage wake status clear                               */
            uint32_t            : 7;
    } bit;
  } WAKE_STS_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) Wake status set register                                   */
    
    struct {
      __OM  uint32_t CAN_SET    : 1;            /*!< [0..0] CAN wake status set                                                */
            uint32_t            : 1;
      __OM  uint32_t CYC_WAKE_SET : 1;          /*!< [2..2] Cyclic wake status set                                             */
            uint32_t            : 1;
      __OM  uint32_t GPIO0_SET  : 1;            /*!< [4..4] GPIO0 wake status set                                              */
      __OM  uint32_t GPIO1_SET  : 1;            /*!< [5..5] GPIO1 wake status set                                              */
      __OM  uint32_t GPIO2_SET  : 1;            /*!< [6..6] GPIO2 wake status set                                              */
      __OM  uint32_t GPIO3_SET  : 1;            /*!< [7..7] GPIO3 wake status set                                              */
      __OM  uint32_t GPIO4_SET  : 1;            /*!< [8..8] GPIO4 wake status set                                              */
      __OM  uint32_t GPIO5_SET  : 1;            /*!< [9..9] GPIO5 wake status set                                              */
            uint32_t            : 2;
      __OM  uint32_t MON1_SET   : 1;            /*!< [12..12] MON1 wake status set                                             */
      __OM  uint32_t MON2_SET   : 1;            /*!< [13..13] MON2 wake status set                                             */
      __OM  uint32_t MON3_SET   : 1;            /*!< [14..14] MON3 wake status set                                             */
            uint32_t            : 1;
      __OM  uint32_t VDDP_UVWARN_SET : 1;       /*!< [16..16] VDDP undervoltage warning wake status set                        */
      __OM  uint32_t VDDP_OV_SET : 1;           /*!< [17..17] VDDP overvoltage wake status set                                 */
      __OM  uint32_t VDDP_HCM_SET : 1;          /*!< [18..18] VDDP high current mode wake status set                           */
      __OM  uint32_t VDDC_UVWARN_SET : 1;       /*!< [19..19] VDDC undervoltage warning wake status set                        */
      __OM  uint32_t VDDC_OV_SET : 1;           /*!< [20..20] VDDC overvoltage wake status set                                 */
      __OM  uint32_t VDDC_HCM_SET : 1;          /*!< [21..21] VDDC high current mode wake status set                           */
      __OM  uint32_t VDDEXT_OT_SET : 1;         /*!< [22..22] VDDEXT overtemperature wake status set                           */
      __OM  uint32_t VDDEXT_UV_SET : 1;         /*!< [23..23] VDDEXT undervoltage wake status set                              */
      __OM  uint32_t VSD_OV_SET : 1;            /*!< [24..24] VSD overvoltage wake status set                                  */
            uint32_t            : 7;
    } bit;
  } WAKE_STS_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) General purpose user data register                         */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Data storage                                                      */
    } bit;
  } GPUDATA0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) General purpose user data register                         */
    
