popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Data storage                                                      */
    } bit;
  } GPUDATA1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) General purpose user data register                         */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Data storage                                                      */
    } bit;
  } GPUDATA2;
  __IM  uint32_t  RESERVED[13];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) Miscellaneous control register                             */
    
    struct {
      __IOM uint32_t FI_PU_EN   : 1;            /*!< [0..0] Failure input pull up enable                                       */
            uint32_t            : 31;
    } bit;
  } MISC_CTRL;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E4) Start configuration control register                       */
    
    struct {
      __IOM uint32_t CONF       : 1;            /*!< [0..0] Start configuration                                                */
      __IOM uint32_t RST_PIN_EN : 1;            /*!< [1..1] Reset PIN enable                                                   */
            uint32_t            : 30;
    } bit;
  } START_CONFIG;
  __IM  uint32_t  RESERVED2[390];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000700) Watchdog control register                                  */
    
    struct {
      __IOM uint32_t EN         : 2;            /*!< [1..0] Watchdog enable                                                    */
            uint32_t            : 14;
      __IOM uint32_t WDP        : 6;            /*!< [21..16] Watchdog period selection                                        */
            uint32_t            : 2;
      __IOM uint32_t SOW        : 2;            /*!< [25..24] Short open window selection - Can only be configured
                                                     in LOW                                                                    */
            uint32_t            : 6;
    } bit;
  } WD_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000704) Watchdog trigger register                                  */
    
    struct {
      __IOM uint32_t TRIG       : 1;            /*!< [0..0] Trigger bit for long open- /window Mode                            */
            uint32_t            : 31;
    } bit;
  } WD_TRIG;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000708) Watchdog SOW trigger register                              */
    
    struct {
      __IOM uint32_t TRIG       : 1;            /*!< [0..0] Trigger bit for short open window mode                             */
            uint32_t            : 31;
    } bit;
  } WD_TRIG_SOW;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000070C) Functional safety status register                          */
    
    struct {
      __IM  uint32_t MCLK_FAIL_STS : 1;         /*!< [0..0] Master clock watchdog fail status                                  */
      __IM  uint32_t VMSUP_UV_STS : 1;          /*!< [1..1] Master supply undervoltage status                                  */
      __IM  uint32_t VMSUP_OV_STS : 1;          /*!< [2..2] Master supply overvoltage status                                   */
      __IM  uint32_t WD_FAIL_STS : 1;           /*!< [3..3] Watchdog Fail status                                               */
      __IM  uint32_t WD_TEST_FAIL_STS : 1;      /*!< [4..4] Watchdog self test fail status                                     */
      __IM  uint32_t VDDC_UV_STS : 1;           /*!< [5..5] VDDC undervoltage status                                           */
      __IM  uint32_t VDDC_OV_STS : 1;           /*!< [6..6] VDDC overvoltage status                                            */
      __IM  uint32_t VDDP_UV_STS : 1;           /*!< [7..7] VDDP undervoltage status                                           */
      __IM  uint32_t VDDP_OV_STS : 1;           /*!< [8..8] VDDP overvoltage status                                            */
      __IM  uint32_t VDDP_OT_STS : 1;           /*!< [9..9] VDDP overtemperature status                                        */
      __IM  uint32_t VAREF_OV_STS : 1;          /*!< [10..10] VAREF overvoltage status                                         */
      __IM  uint32_t CSC_OC_STS : 1;            /*!< [11..11] Current Sense comparator overcurrent status                      */
      __IM  uint32_t CSC_BIST_FAIL_STS : 1;     /*!< [12..12] Current sense comparator self test fail status                   */
      __IM  uint32_t CSC_EN_FAIL_STS : 1;       /*!< [13..13] Current sense comparator enabling fail status                    */
      __IM  uint32_t PIN_MON_STS : 1;           /*!< [14..14] Pin monitor fail status (FI)                                     */
            uint32_t            : 1;
      __IM  uint32_t FO_OC_STS  : 1;            /*!< [16..16] FO overcurrent status (FO)                                       */
            uint32_t            : 15;
    } bit;
  } FS_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000710) Functional safety status clear register                    */
    
    struct {
      __OM  uint32_t MCLK_FAIL_STS_CLR : 1;     /*!< [0..0] Master clock watchdog fail status                                  */
      __OM  uint32_t VMSUP_UV_STS_CLR : 1;      /*!< [1..1] Master supply undervoltage status                                  */
      __OM  uint32_t VMSUP_OV_STS_CLR : 1;      /*!< [2..2] Master supply overvoltage status                                   */
      __OM  uint32_t WD_FAIL_STS_CLR : 1;       /*!< [3..3] Watchdog fail status                                               */
      __OM  uint32_t WD_TEST_FAIL_STS_CLR : 1;  /*!< [4..4] Watchdog self test fail status                                     */
      __OM  uint32_t VDDC_UV_STS_CLR : 1;       /*!< [5..5] VDDC undervoltage status                                           */
      __OM  uint32_t VDDC_OV_STS_CLR : 1;       /*!< [6..6] VDDC overvoltage status                                            */
      __OM  uint32_t VDDP_UV_STS_CLR : 1;       /*!< [7..7] VDDP undervoltage status                                           */
      __OM  uint32_t VDDP_OV_STS_CLR : 1;       /*!< [8..8] VDDP overvoltage status                                            */
      __OM  uint32_t VDDP_OT_STS_CLR : 1;       /*!< [9..9] VDDP overtemperature status                                        */
      __OM  uint32_t VAREF_OV_STS_CLR : 1;      /*!< [10..10] VAREF overvoltage status                                         */
      __OM  uint32_t CSC_OC_STS_CLR : 1;        /*!< [11..11] Current sense comparator overcurrent status                      */
      __OM  uint32_t CSC_BIST_FAIL_STS_CLR : 1; /*!< [12..12] Current sense comparator self test fail status                   */
      __OM  uint32_t CSC_EN_FAIL_STS_CLR : 1;   /*!< [13..13] Current sense comparator enable fail status                      */
      __OM  uint32_t PIN_MON_STS_CLR : 1;       /*!< [14..14] Pin monitor fail status (FI)                                     */
            uint32_t            : 1;
      __OM  uint32_t FO_OC_STS_CLR : 1;         /*!< [16..16] FO overcurrent status clear (FO)                                 */
            uint32_t            : 15;
    } bit;
  } FS_STS_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000714) Functional safety status set register                      */
    
