popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t MCLK_FAIL_STS_SET : 1;     /*!< [0..0] Master clock watchdog fail status                                  */
      __OM  uint32_t VMSUP_UV_STS_SET : 1;      /*!< [1..1] Master supply undervoltage status                                  */
      __OM  uint32_t VMSUP_OV_STS_SET : 1;      /*!< [2..2] Master supply overvoltage status                                   */
      __OM  uint32_t WD_FAIL_STS_SET : 1;       /*!< [3..3] Watchdog fail status                                               */
      __OM  uint32_t WD_TEST_FAIL_STS_SET : 1;  /*!< [4..4] Watchdog self test fail status                                     */
      __OM  uint32_t VDDC_UV_STS_SET : 1;       /*!< [5..5] VDDC undervoltage status                                           */
      __OM  uint32_t VDDC_OV_STS_SET : 1;       /*!< [6..6] VDDC overvoltage status                                            */
      __OM  uint32_t VDDP_UV_STS_SET : 1;       /*!< [7..7] VDDP undervoltage status                                           */
      __OM  uint32_t VDDP_OV_STS_SET : 1;       /*!< [8..8] VDDP overvoltage status                                            */
      __OM  uint32_t VDDP_OT_STS_SET : 1;       /*!< [9..9] VDDP overtemperature status                                        */
      __OM  uint32_t VAREF_OV_STS_SET : 1;      /*!< [10..10] VAREF overvoltage status                                         */
      __OM  uint32_t CSC_OC_STS_SET : 1;        /*!< [11..11] Current sense comparator overcurrent status                      */
      __OM  uint32_t CSC_BIST_FAIL_STS_SET : 1; /*!< [12..12] Current sense comparator self test fail status                   */
      __OM  uint32_t CSC_EN_FAIL_STS_SET : 1;   /*!< [13..13] Current sense comparator enable fail status                      */
      __OM  uint32_t PIN_MON_STS_SET : 1;       /*!< [14..14] Pin monitor fail status (FI)                                     */
            uint32_t            : 1;
      __OM  uint32_t FO_OC_STS_SET : 1;         /*!< [16..16] FO overcurrent status set (FO)                                   */
            uint32_t            : 15;
    } bit;
  } FS_STS_SET;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000718) Safe state status register                                 */
    
    struct {
      __IM  uint32_t SSD_STS    : 2;            /*!< [1..0] Safe shutdown status                                               */
      __IM  uint32_t FO_STS     : 2;            /*!< [3..2] Fail output status (FO)                                            */
            uint32_t            : 28;
    } bit;
  } FS_SSD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000071C) Safe state status clear register                           */
    
    struct {
      __OM  uint32_t SSD_STS_CLR : 1;           /*!< [0..0] Safe shutdown status clear                                         */
      __OM  uint32_t FO_STS_CLR : 1;            /*!< [1..1] Fail output status clear (FO)                                      */
            uint32_t            : 30;
    } bit;
  } FS_SSD_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000720) Safe state status set register                             */
    
    struct {
      __OM  uint32_t SSD_STS_SET : 1;           /*!< [0..0] Safe shutdown status set                                           */
      __OM  uint32_t FO_STS_SET : 1;            /*!< [1..1] Fail output status set (FO)                                        */
            uint32_t            : 30;
    } bit;
  } FS_SSD_SET;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000724) Current sense comparator control register                  */
    
    struct {
      __IOM uint32_t CSC_DIS    : 1;            /*!< [0..0] Current sense comparator disable                                   */
            uint32_t            : 31;
    } bit;
  } CSC_CTRL;
} PMU_Type;                                     /*!< Size = 1832 (0x728)                                                       */



/* =========================================================================================================================== */
/* ================                                            SCU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SCU (SCU)
  */

typedef struct {                                /*!< (@ 0x48004000) SCU Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) System Clock Select Register                               */
    
    struct {
      __IOM uint32_t SELSYS0    : 2;            /*!< [1..0] System Clock fsys0 Select                                          */
      __IOM uint32_t SELSYS1    : 2;            /*!< [3..2] System Clock fsys1 Select                                          */
            uint32_t            : 12;
      __IOM uint32_t SELCLKOUT  : 3;            /*!< [18..16] CLKOUT Selection                                                 */
      __IOM uint32_t CLKOUTEN   : 1;            /*!< [19..19] CLKOUT Enable                                                    */
            uint32_t            : 12;
    } bit;
  } CLKSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Peripheral Clock Prescaler Register                        */
    
    struct {
      __IOM uint32_t PRECPU     : 3;            /*!< [2..0] CPU_CLK Prescaler Setting (based on sys0_clk)                      */
            uint32_t            : 1;
      __IOM uint32_t PREFILT    : 5;            /*!< [8..4] TFILT_CLK Prescaler Setting (based on sys0_clk)                    */
      __IOM uint32_t PREMI      : 3;            /*!< [11..9] MI_CLK Prescaler Setting (based on sys0_clk)                      */
            uint32_t            : 4;
      __IOM uint32_t PRECAN     : 3;            /*!< [18..16] CAN_CLK Prescaler Setting (based on sys1_clk)                    */
            uint32_t            : 1;
      __IOM uint32_t PREUART    : 3;            /*!< [22..20] UART_CLK Prescaler Setting (based on sys1_clk)                   */
            uint32_t            : 1;
      __IOM uint32_t PRECLKOUT  : 3;            /*!< [26..24] CLKOUT_CLK Prescaler Setting (based on selected clock
                                                     by SELCLKOUT)                                                             */
      __IOM uint32_t DIV2CLKOUT : 1;            /*!< [27..27] CLKOUT clock divider by2                                         */
            uint32_t            : 4;
    } bit;
  } CLKCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Peripheral Clock Enable Register                           */
    
