popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t UARTCLKEN  : 1;            /*!< [0..0] UART Clock Enable                                                  */
      __IOM uint32_t CANCLKEN   : 1;            /*!< [1..1] CAN Clock Enable                                                   */
            uint32_t            : 30;
    } bit;
  } CLKEN;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) XTAL Control Register                                      */
    
    struct {
      __IOM uint32_t XPD        : 1;            /*!< [0..0] XTAL Power Down Control                                            */
      __IOM uint32_t XTALHYSEN  : 1;            /*!< [1..1] XTAL Hysteresis Enable                                             */
            uint32_t            : 2;
      __IOM uint32_t XTALHYS    : 2;            /*!< [5..4] XTAL Hysteresis Control                                            */
            uint32_t            : 18;
      __IOM uint32_t XWDGEN     : 1;            /*!< [24..24] XTALWDG Enable                                                   */
            uint32_t            : 3;
      __OM  uint32_t XWDGRES    : 1;            /*!< [28..28] XTALWDG Reset                                                    */
            uint32_t            : 3;
    } bit;
  } XTALCON;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) XTAL Status Register                                       */
    
    struct {
      __IM  uint32_t XTAL_FAIL_STS : 1;         /*!< [0..0] XTAL Watchdog Fail Latched Status                                  */
            uint32_t            : 7;
      __IM  uint32_t XTALFAIL   : 1;            /*!< [8..8] XTAL Watchdog Fail Current Status                                  */
            uint32_t            : 23;
    } bit;
  } XTALSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) XTAL Status Clear Register                                 */
    
    struct {
      __OM  uint32_t XTAL_FAIL_STSCLR : 1;      /*!< [0..0] XTAL Watchdog Fail Latched Status Clear                            */
            uint32_t            : 31;
    } bit;
  } XTALSTATC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) XTAL Status Set Register                                   */
    
    struct {
      __OM  uint32_t XTAL_FAIL_STSSET : 1;      /*!< [0..0] XTAL Watchdog Fail Latched Status Set                              */
            uint32_t            : 31;
    } bit;
  } XTALSTATS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Interrupt Node 0 Mapping Register                          */
    
    struct {
      __IOM uint32_t INP_PMU    : 1;            /*!< [0..0] PMU Interrupt Mapping                                              */
      __IOM uint32_t INP_BDRV_IRQ0 : 1;         /*!< [1..1] Bridge Driver Interrupt 0 Mapping                                  */
      __IOM uint32_t INP_BDRV_IRQ1 : 1;         /*!< [2..2] Bridge Driver Interrupt 1 Mapping                                  */
      __IOM uint32_t INP_CANTX  : 1;            /*!< [3..3] CANTX Interrupt Mapping                                            */
      __IOM uint32_t INP_ARVG   : 1;            /*!< [4..4] ARVG Interrupt Mapping                                             */
      __IOM uint32_t INP_CSC    : 1;            /*!< [5..5] CSC Interrupt Mapping                                              */
            uint32_t            : 26;
    } bit;
  } INP0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Interrupt Node 1 Mapping Register                          */
    
    struct {
      __IOM uint32_t INP_GPT1T2 : 1;            /*!< [0..0] GPT1T2 Interrupt Mapping                                           */
      __IOM uint32_t INP_GPT1T3 : 1;            /*!< [1..1] GPT1T3 Interrupt Mapping                                           */
      __IOM uint32_t INP_GPT1T4 : 1;            /*!< [2..2] GPT1T4 Interrupt Mapping                                           */
      __IOM uint32_t INP_GPT2T5 : 1;            /*!< [3..3] GPT2T5 Interrupt Mapping                                           */
      __IOM uint32_t INP_GPT2T6 : 1;            /*!< [4..4] GPT2T6 Interrupt Mapping                                           */
      __IOM uint32_t INP_GPT2CR : 1;            /*!< [5..5] GPT2CR Interrupt Mapping                                           */
            uint32_t            : 26;
    } bit;
  } INP1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Interrupt Node 2 Mapping Register                          */
    
    struct {
      __IOM uint32_t INP_MON1   : 1;            /*!< [0..0] MON1 Interrupt Mapping                                             */
      __IOM uint32_t INP_MON2   : 1;            /*!< [1..1] MON2 Interrupt Mapping                                             */
      __IOM uint32_t INP_MON3   : 1;            /*!< [2..2] MON3 Interrupt Mapping                                             */
            uint32_t            : 29;
    } bit;
  } INP2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Interrupt Node 3 Mapping Register                          */
    
    struct {
      __IOM uint32_t INP_SDADC0 : 1;            /*!< [0..0] SDADC0 Interrupt Mapping                                           */
      __IOM uint32_t INP_SDADC1 : 1;            /*!< [1..1] SDADC1 Interrupt Mapping                                           */
      __IOM uint32_t INP_BEMF0  : 1;            /*!< [2..2] BEMF0 Interrupt Mapping                                            */
      __IOM uint32_t INP_BEMF1  : 1;            /*!< [3..3] BEMF1 Interrupt Mapping                                            */
      __IOM uint32_t INP_BEMF2  : 1;            /*!< [4..4] BEMF2 Interrupt Mapping                                            */
            uint32_t            : 27;
    } bit;
  } INP3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Interrupt Node 4 Mapping Register                          */
    
