popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t INP_EXINT0 : 1;            /*!< [0..0] EXINT0 Interrupt Mapping                                           */
      __IOM uint32_t INP_EXINT1 : 1;            /*!< [1..1] EXINT1 Interrupt Mapping                                           */
      __IOM uint32_t INP_EXINT2 : 1;            /*!< [2..2] EXINT2 Interrupt Mapping                                           */
      __IOM uint32_t INP_EXINT3 : 1;            /*!< [3..3] EXINT3 Interrupt Mapping                                           */
            uint32_t            : 28;
    } bit;
  } INP4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Interrupt Node 5 Mapping Register                          */
    
    struct {
      __IOM uint32_t INP_LIN0_EOFSYN : 1;       /*!< [0..0] LIN0_EOFSYN Interrupt Mapping                                      */
      __IOM uint32_t INP_LIN0_ERRSYN : 1;       /*!< [1..1] LIN0_ERRSYN Interrupt Mapping                                      */
      __IOM uint32_t INP_LIN1_EOFSYN : 1;       /*!< [2..2] LIN1_EOFSYN Interrupt Mapping                                      */
      __IOM uint32_t INP_LIN1_ERRSYN : 1;       /*!< [3..3] LIN1_ERRSYN Interrupt Mapping                                      */
      __IOM uint32_t INP_UART0_RI : 1;          /*!< [4..4] UART0_RI Interrupt Mapping                                         */
      __IOM uint32_t INP_UART0_TI : 1;          /*!< [5..5] UART0_TI Interrupt Mapping                                         */
      __IOM uint32_t INP_UART1_RI : 1;          /*!< [6..6] UART1_RI Interrupt Mapping                                         */
      __IOM uint32_t INP_UART1_TI : 1;          /*!< [7..7] UART1_TI Interrupt Mapping                                         */
            uint32_t            : 24;
    } bit;
  } INP5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Interrupt Node 6 Mapping Register                          */
    
    struct {
      __IOM uint32_t INP_SSC0_RIR : 1;          /*!< [0..0] SSC0_RIR Interrupt Mapping                                         */
      __IOM uint32_t INP_SSC0_TIR : 1;          /*!< [1..1] SSC0_TIR Interrupt Mapping                                         */
      __IOM uint32_t INP_SSC0_EIR : 1;          /*!< [2..2] SSC0_EIR Interrupt Mapping                                         */
            uint32_t            : 1;
      __IOM uint32_t INP_SSC1_RIR : 1;          /*!< [4..4] SSC1_RIR Interrupt Mapping                                         */
      __IOM uint32_t INP_SSC1_TIR : 1;          /*!< [5..5] SSC1_TIR Interrupt Mapping                                         */
      __IOM uint32_t INP_SSC1_EIR : 1;          /*!< [6..6] SSC1_EIR Interrupt Mapping                                         */
            uint32_t            : 25;
    } bit;
  } INP6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Interrupt Node 7 Mapping Register                          */
    
    struct {
      __IOM uint32_t INP_DMACH0 : 1;            /*!< [0..0] DMACH0 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMACH1 : 1;            /*!< [1..1] DMACH1 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMACH2 : 1;            /*!< [2..2] DMACH2 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMACH3 : 1;            /*!< [3..3] DMACH3 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMACH4 : 1;            /*!< [4..4] DMACH4 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMACH5 : 1;            /*!< [5..5] DMACH5 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMACH6 : 1;            /*!< [6..6] DMACH6 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMACH7 : 1;            /*!< [7..7] DMACH7 Interrupt Mapping                                           */
      __IOM uint32_t INP_DMATRERR : 1;          /*!< [8..8] DMATRERR Interrupt Mapping                                         */
            uint32_t            : 23;
    } bit;
  } INP7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) NMI Control Register                                       */
    
    struct {
      __IOM uint32_t NMIXTALEN  : 1;            /*!< [0..0] XTAL Watchdog Fail NMI Enable                                      */
      __IOM uint32_t NMIPLL0EN  : 1;            /*!< [1..1] PLL0 Loss of Lock NMI Enable                                       */
      __IOM uint32_t NMIPLL1EN  : 1;            /*!< [2..2] PLL1 Loss of Lock NMI Enable                                       */
            uint32_t            : 29;
    } bit;
  } NMICON;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) NMI Status Register                                        */
    
    struct {
      __IM  uint32_t NMIXTAL    : 1;            /*!< [0..0] XTAL Watchdog Fail NMI Status                                      */
      __IM  uint32_t NMIPLL0    : 1;            /*!< [1..1] PLL0 Loss of Lock NMI Status                                       */
      __IM  uint32_t NMIPLL1    : 1;            /*!< [2..2] PLL1 Loss of Lock NMI Status                                       */
            uint32_t            : 29;
    } bit;
  } NMISR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) NMI Status Clear Register                                  */
    
    struct {
      __OM  uint32_t NMIXTALCLR : 1;            /*!< [0..0] XTAL Watchdog Fail NMI Status Clear                                */
      __OM  uint32_t NMIPLL0CLR : 1;            /*!< [1..1] PLL0 Loss of Lock NMI Status Clear                                 */
      __OM  uint32_t NMIPLL1CLR : 1;            /*!< [2..2] PLL1 Loss of Lock NMI Status Clear                                 */
            uint32_t            : 29;
    } bit;
  } NMISRC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) NMI Status Set Register                                    */
    
