popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t NMIXTALSET : 1;            /*!< [0..0] XTAL Watchdog Fail NMI Status Set                                  */
      __OM  uint32_t NMIPLL0SET : 1;            /*!< [1..1] PLL0 Loss of Lock NMI Status Set                                   */
      __OM  uint32_t NMIPLL1SET : 1;            /*!< [2..2] PLL1 Loss of Lock NMI Status Set                                   */
            uint32_t            : 29;
    } bit;
  } NMISRS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) MON Interrupt Enable Register                              */
    
    struct {
      __IOM uint32_t MON1EN     : 1;            /*!< [0..0] MON1 Interrupt Enable                                              */
      __IOM uint32_t MON2EN     : 1;            /*!< [1..1] MON2 Interrupt Enable                                              */
      __IOM uint32_t MON3EN     : 1;            /*!< [2..2] MON3 Interrupt Enable                                              */
            uint32_t            : 29;
    } bit;
  } MONIEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000058) MON Interrupt Status Register                              */
    
    struct {
      __IM  uint32_t MON1R      : 1;            /*!< [0..0] MON1 Rising Edge Interrupt Status                                  */
      __IM  uint32_t MON1F      : 1;            /*!< [1..1] MON1 Falling Edge Interrupt Status                                 */
      __IM  uint32_t MON2R      : 1;            /*!< [2..2] MON2 Rising Edge Interrupt Status                                  */
      __IM  uint32_t MON2F      : 1;            /*!< [3..3] MON2 Falling Edge Interrupt Status                                 */
      __IM  uint32_t MON3R      : 1;            /*!< [4..4] MON3 Rising Edge Interrupt Status                                  */
      __IM  uint32_t MON3F      : 1;            /*!< [5..5] MON3 Falling Edge Interrupt Status                                 */
            uint32_t            : 26;
    } bit;
  } MONIS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) MON Interrupt Status Clear Register                        */
    
    struct {
      __OM  uint32_t MON1RCLR   : 1;            /*!< [0..0] MON1 Rising Edge Interrupt Status Clear                            */
      __OM  uint32_t MON1FCLR   : 1;            /*!< [1..1] MON1 Falling Edge Interrupt Status Clear                           */
      __OM  uint32_t MON2RCLR   : 1;            /*!< [2..2] MON2 Rising Edge Interrupt Status Clear                            */
      __OM  uint32_t MON2FCLR   : 1;            /*!< [3..3] MON2 Falling Edge Interrupt Status Clear                           */
      __OM  uint32_t MON3RCLR   : 1;            /*!< [4..4] MON3 Rising Edge Interrupt Status Clear                            */
      __OM  uint32_t MON3FCLR   : 1;            /*!< [5..5] MON3 Falling Edge Interrupt Status Clear                           */
            uint32_t            : 26;
    } bit;
  } MONISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) MON Interrupt Status Set Register                          */
    
    struct {
      __OM  uint32_t MON1RSET   : 1;            /*!< [0..0] MON1 Rising Edge Interrupt Status Set                              */
      __OM  uint32_t MON1FSET   : 1;            /*!< [1..1] MON1 Fallinging Edge Interrupt Status Set                          */
      __OM  uint32_t MON2RSET   : 1;            /*!< [2..2] MON2 Rising Edge Interrupt Status Set                              */
      __OM  uint32_t MON2FSET   : 1;            /*!< [3..3] MON2 Fallinging Edge Interrupt Status Set                          */
      __OM  uint32_t MON3RSET   : 1;            /*!< [4..4] MON3 Rising Edge Interrupt Status Set                              */
      __OM  uint32_t MON3FSET   : 1;            /*!< [5..5] MON3 Fallinging Edge Interrupt Status Set                          */
            uint32_t            : 26;
    } bit;
  } MONISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) MON Interrupt Configuration Register                       */
    
    struct {
      __IOM uint32_t MON1IEV    : 2;            /*!< [1..0] MON1 Interrupt Event Select                                        */
      __IOM uint32_t MON2IEV    : 2;            /*!< [3..2] MON2 Interrupt Event Select                                        */
      __IOM uint32_t MON3IEV    : 2;            /*!< [5..4] MON3 Interrupt Event Select                                        */
            uint32_t            : 26;
    } bit;
  } MONCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) External Interrupt Enable Register                         */
    
    struct {
      __IOM uint32_t EXTINT0EN  : 1;            /*!< [0..0] External EXTINT0 Interrupt Enable                                  */
      __IOM uint32_t EXTINT1EN  : 1;            /*!< [1..1] External EXTINT1 Interrupt Enable                                  */
      __IOM uint32_t EXTINT2EN  : 1;            /*!< [2..2] External EXTINT2 Interrupt Enable                                  */
      __IOM uint32_t EXTINT3EN  : 1;            /*!< [3..3] External EXTINT3 Interrupt Enable                                  */
            uint32_t            : 28;
    } bit;
  } EXTIEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000006C) External Interrupt Status Register                         */
    
    struct {
      __IM  uint32_t EXTINT0R   : 1;            /*!< [0..0] External EXTINT0 Rising Edge Interrupt Status                      */
      __IM  uint32_t EXTINT0F   : 1;            /*!< [1..1] External EXTINT0 Falling Edge Interrupt Status                     */
      __IM  uint32_t EXTINT1R   : 1;            /*!< [2..2] External EXTINT1 Rising Edge Interrupt Status                      */
      __IM  uint32_t EXTINT1F   : 1;            /*!< [3..3] External EXTINT1 Falling Edge Interrupt Status                     */
      __IM  uint32_t EXTINT2R   : 1;            /*!< [4..4] External EXTINT2 Rising Edge Interrupt Status                      */
      __IM  uint32_t EXTINT2F   : 1;            /*!< [5..5] External EXTINT2 Falling Edge Interrupt Status                     */
      __IM  uint32_t EXTINT3R   : 1;            /*!< [6..6] External EXTINT3 Rising Edge Interrupt Status                      */
      __IM  uint32_t EXTINT3F   : 1;            /*!< [7..7] External EXTINT3 Falling Edge Interrupt Status                     */
            uint32_t            : 24;
    } bit;
  } EXTIS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) External Interrupt Status Clear Register                   */
    
