popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t EXTINT0RCLR : 1;           /*!< [0..0] External EXTINT0 Rising Edge Interrupt Status Clear                */
      __OM  uint32_t EXTINT0FCLR : 1;           /*!< [1..1] External EXTINT0 Falling Edge Interrupt Status Clear               */
      __OM  uint32_t EXTINT1RCLR : 1;           /*!< [2..2] External EXTINT1 Rising Edge Interrupt Status Clear                */
      __OM  uint32_t EXTINT1FCLR : 1;           /*!< [3..3] External EXTINT1 Falling Edge Interrupt Status Clear               */
      __OM  uint32_t EXTINT2RCLR : 1;           /*!< [4..4] External EXTINT2 Rising Edge Interrupt Status Clear                */
      __OM  uint32_t EXTINT2FCLR : 1;           /*!< [5..5] External EXTINT2 Falling Edge Interrupt Status Clear               */
      __OM  uint32_t EXTINT3RCLR : 1;           /*!< [6..6] External EXTINT3 Rising Edge Interrupt Status Clear                */
      __OM  uint32_t EXTINT3FCLR : 1;           /*!< [7..7] External EXTINT3 Falling Edge Interrupt Status Clear               */
            uint32_t            : 24;
    } bit;
  } EXTISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) External Interrupt Status Set Register                     */
    
    struct {
      __OM  uint32_t EXTINT0RSET : 1;           /*!< [0..0] External EXTINT0 Rising Edge Interrupt Status Set                  */
      __OM  uint32_t EXTINT0FSET : 1;           /*!< [1..1] External EXTINT0 Falling Edge Interrupt Status Set                 */
      __OM  uint32_t EXTINT1RSET : 1;           /*!< [2..2] External EXTINT1Rising Edge Interrupt Status Set                   */
      __OM  uint32_t EXTINT1FSET : 1;           /*!< [3..3] External EXTINT1Falling Edge Interrupt Status Set                  */
      __OM  uint32_t EXTINT2RSET : 1;           /*!< [4..4] External EXTINT2 Rising Edge Interrupt Status Set                  */
      __OM  uint32_t EXTINT2FSET : 1;           /*!< [5..5] External EXTINT2 Falling Edge Interrupt Status Set                 */
      __OM  uint32_t EXTINT3RSET : 1;           /*!< [6..6] External EXTINT3 Rising Edge Interrupt Status Set                  */
      __OM  uint32_t EXTINT3FSET : 1;           /*!< [7..7] External EXTINT3 Falling Edge Interrupt Status Set                 */
            uint32_t            : 24;
    } bit;
  } EXTISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) EXT Interrupt Configuration Register                       */
    
    struct {
      __IOM uint32_t EXTINT0IEV : 2;            /*!< [1..0] External EXTINT0 Interrupt Event Select                            */
      __IOM uint32_t EXTINT1IEV : 2;            /*!< [3..2] External EXTINT1 Interrupt Event Select                            */
      __IOM uint32_t EXTINT2IEV : 2;            /*!< [5..4] External EXTINT2 Interrupt Event Select                            */
      __IOM uint32_t EXTINT3IEV : 2;            /*!< [7..6] External EXTINT3Interrupt Event Select                             */
      __IOM uint32_t EXTINT0INSEL : 2;          /*!< [9..8] External EXTINT0 Input Select                                      */
      __IOM uint32_t EXTINT1INSEL : 2;          /*!< [11..10] External EXTINT1 Input Select                                    */
      __IOM uint32_t EXTINT2INSEL : 2;          /*!< [13..12] External EXTINT2 Input Select                                    */
      __IOM uint32_t EXTINT3INSEL : 2;          /*!< [15..14] External EXTINT3 Input Select                                    */
            uint32_t            : 16;
    } bit;
  } EXTCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) General Purpose Timer 12 Interrupt Enable Register         */
    
    struct {
      __IOM uint32_t GPT1T2EN   : 1;            /*!< [0..0] General Purpose Timer 1 T2 Interrupt Enable                        */
      __IOM uint32_t GPT1T3EN   : 1;            /*!< [1..1] General Purpose Timer 1 T3 Interrupt Enable                        */
      __IOM uint32_t GPT1T4EN   : 1;            /*!< [2..2] General Purpose Timer 1 T4 Interrupt Enable                        */
      __IOM uint32_t GPT2T5EN   : 1;            /*!< [3..3] General Purpose Timer 2 T5 Interrupt Enable                        */
      __IOM uint32_t GPT2T6EN   : 1;            /*!< [4..4] General Purpose Timer 2 T6 Interrupt Enable                        */
      __IOM uint32_t GPT2CREN   : 1;            /*!< [5..5] General Purpose Timer 2 CR Interrupt Enable                        */
            uint32_t            : 26;
    } bit;
  } GPTIEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000080) General Purpose Timer 12 Interrupt Status Register         */
    
    struct {
      __IM  uint32_t GPT1T2     : 1;            /*!< [0..0] General Purpose Timer 1 T2 Interrupt Status                        */
      __IM  uint32_t GPT1T3     : 1;            /*!< [1..1] General Purpose Timer 1 T3 Interrupt Status                        */
      __IM  uint32_t GPT1T4     : 1;            /*!< [2..2] General Purpose Timer 1 T4 Interrupt Status                        */
      __IM  uint32_t GPT2T5     : 1;            /*!< [3..3] General Purpose Timer 2 T5 Interrupt Status                        */
      __IM  uint32_t GPT2T6     : 1;            /*!< [4..4] General Purpose Timer 2 T6 Interrupt Status                        */
      __IM  uint32_t GPT2CR     : 1;            /*!< [5..5] General Purpose Timer 2 CR Interrupt Status                        */
            uint32_t            : 26;
    } bit;
  } GPTIS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) General Purpose Timer 12 Interrupt Status Clear
                                                                    Register                                                   */
    
    struct {
      __OM  uint32_t GPT1T2CLR  : 1;            /*!< [0..0] General Purpose Timer 1 T2 Interrupt Status Clear                  */
      __OM  uint32_t GPT1T3CLR  : 1;            /*!< [1..1] General Purpose Timer 1 T3 Interrupt Status Clear                  */
      __OM  uint32_t GPT1T4CLR  : 1;            /*!< [2..2] General Purpose Timer 1 T4 Interrupt Status Clear                  */
      __OM  uint32_t GPT2T5CLR  : 1;            /*!< [3..3] General Purpose Timer 2 T5 Interrupt Status Clear                  */
      __OM  uint32_t GPT2T6CLR  : 1;            /*!< [4..4] General Purpose Timer 2 T6 Interrupt Status Clear                  */
      __OM  uint32_t GPT2CRCLR  : 1;            /*!< [5..5] General Purpose Timer 2 CR Interrupt Status Clear                  */
            uint32_t            : 26;
    } bit;
  } GPTISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) General Purpose Timer 12 Interrupt Status Set
                                                                    Register                                                   */
    
