popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t GPT1T2SET  : 1;            /*!< [0..0] General Purpose Timer 1 T2 Interrupt Status Set                    */
      __OM  uint32_t GPT1T3SET  : 1;            /*!< [1..1] General Purpose Timer 1 T3 Interrupt Status Set                    */
      __OM  uint32_t GPT1T4SET  : 1;            /*!< [2..2] General Purpose Timer 1 T4 Interrupt Status Set                    */
      __OM  uint32_t GPT2T5SET  : 1;            /*!< [3..3] General Purpose Timer 2 T5 Interrupt Status Set                    */
      __OM  uint32_t GPT2T6SET  : 1;            /*!< [4..4] General Purpose Timer 2 T6 Interrupt Status Set                    */
      __OM  uint32_t GPT2CRSET  : 1;            /*!< [5..5] General Purpose Timer 2 CR Interrupt Status Set                    */
            uint32_t            : 26;
    } bit;
  } GPTISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) DMA Interrupt Enable Register                              */
    
    struct {
      __IOM uint32_t DMACH0EN   : 1;            /*!< [0..0] DMA Channel 0 Interrupt Enable                                     */
      __IOM uint32_t DMACH1EN   : 1;            /*!< [1..1] DMA Channel 1 Interrupt Enable                                     */
      __IOM uint32_t DMACH2EN   : 1;            /*!< [2..2] DMA Channel 2 Interrupt Enable                                     */
      __IOM uint32_t DMACH3EN   : 1;            /*!< [3..3] DMA Channel 3 Interrupt Enable                                     */
      __IOM uint32_t DMACH4EN   : 1;            /*!< [4..4] DMA Channel 4 Interrupt Enable                                     */
      __IOM uint32_t DMACH5EN   : 1;            /*!< [5..5] DMA Channel 5 Interrupt Enable                                     */
      __IOM uint32_t DMACH6EN   : 1;            /*!< [6..6] DMA Channel 6 Interrupt Enable                                     */
      __IOM uint32_t DMACH7EN   : 1;            /*!< [7..7] DMA Channel 7 Interrupt Enable                                     */
      __IOM uint32_t DMATRERREN : 1;            /*!< [8..8] DMA Error Interrupt Enable                                         */
            uint32_t            : 23;
    } bit;
  } DMAIEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000090) DMA Interrupt Status Register                              */
    
    struct {
      __IM  uint32_t DMACH0     : 1;            /*!< [0..0] DMA Channel 0 Interrupt Status                                     */
      __IM  uint32_t DMACH1     : 1;            /*!< [1..1] DMA Channel 1 Interrupt Status                                     */
      __IM  uint32_t DMACH2     : 1;            /*!< [2..2] DMA Channel 2 Interrupt Status                                     */
      __IM  uint32_t DMACH3     : 1;            /*!< [3..3] DMA Channel 3 Interrupt Status                                     */
      __IM  uint32_t DMACH4     : 1;            /*!< [4..4] DMA Channel 4 Interrupt Status                                     */
      __IM  uint32_t DMACH5     : 1;            /*!< [5..5] DMA Channel 5 Interrupt Status                                     */
      __IM  uint32_t DMACH6     : 1;            /*!< [6..6] DMA Channel 6 Interrupt Status                                     */
      __IM  uint32_t DMACH7     : 1;            /*!< [7..7] DMA Channel 7 Interrupt Status                                     */
            uint32_t            : 24;
    } bit;
  } DMAIS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) DAM Interrupt Status Clear Register                        */
    
    struct {
      __OM  uint32_t DMACH0CLR  : 1;            /*!< [0..0] DMA Channel 0 Interrupt Status Clear                               */
      __OM  uint32_t DMACH1CLR  : 1;            /*!< [1..1] DMA Channel 1 Interrupt Status Clear                               */
      __OM  uint32_t DMACH2CLR  : 1;            /*!< [2..2] DMA Channel 2 Interrupt Status Clear                               */
      __OM  uint32_t DMACH3CLR  : 1;            /*!< [3..3] DMA Channel 3 Interrupt Status Clear                               */
      __OM  uint32_t DMACH4CLR  : 1;            /*!< [4..4] DMA Channel 4 Interrupt Status Clear                               */
      __OM  uint32_t DMACH5CLR  : 1;            /*!< [5..5] DMA Channel 5 Interrupt Status Clear                               */
      __OM  uint32_t DMACH6CLR  : 1;            /*!< [6..6] DMA Channel 6 Interrupt Status Clear                               */
      __OM  uint32_t DMACH7CLR  : 1;            /*!< [7..7] DMA Channel 7 Interrupt Status Clear                               */
            uint32_t            : 24;
    } bit;
  } DMAISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) DMA Interrupt Status Set Register                          */
    
    struct {
      __OM  uint32_t DMACH0SET  : 1;            /*!< [0..0] DMA Channel 0 Interrupt Status Set                                 */
      __OM  uint32_t DMACH1SET  : 1;            /*!< [1..1] DMA Channel 1 Interrupt Status Set                                 */
      __OM  uint32_t DMACH2SET  : 1;            /*!< [2..2] DMA Channel 2 Interrupt Status Set                                 */
      __OM  uint32_t DMACH3SET  : 1;            /*!< [3..3] DMA Channel 3 Interrupt Status Set                                 */
      __OM  uint32_t DMACH4SET  : 1;            /*!< [4..4] DMA Channel 4 Interrupt Status Set                                 */
      __OM  uint32_t DMACH5SET  : 1;            /*!< [5..5] DMA Channel 5 Interrupt Status Set                                 */
      __OM  uint32_t DMACH6SET  : 1;            /*!< [6..6] DMA Channel 6 Interrupt Status Set                                 */
      __OM  uint32_t DMACH7SET  : 1;            /*!< [7..7] DMA Channel 7 Interrupt Status Set                                 */
            uint32_t            : 24;
    } bit;
  } DMAISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) DMA Channel Select Register CCU7                           */
    
