popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t T12CM70    : 2;            /*!< [1..0] DMA Channel Request Select                                         */
      __IOM uint32_t T12CM71    : 2;            /*!< [3..2] DMA Channel Request Select                                         */
      __IOM uint32_t T12CM72    : 2;            /*!< [5..4] DMA Channel Request Select                                         */
      __IOM uint32_t T12PM      : 2;            /*!< [7..6] DMA Channel Request Select                                         */
      __IOM uint32_t T12ZM      : 2;            /*!< [9..8] DMA Channel Request Select                                         */
      __IOM uint32_t T13CM      : 2;            /*!< [11..10] DMA Channel Request Select                                       */
      __IOM uint32_t T13PM      : 2;            /*!< [13..12] DMA Channel Request Select                                       */
      __IOM uint32_t T13ZM      : 2;            /*!< [15..14] DMA Channel Request Select                                       */
      __IOM uint32_t T14CM      : 2;            /*!< [17..16] DMA Channel Request Select                                       */
      __IOM uint32_t T14PM      : 2;            /*!< [19..18] DMA Channel Request Select                                       */
      __IOM uint32_t T15CM      : 2;            /*!< [21..20] DMA Channel Request Select                                       */
      __IOM uint32_t T15PM      : 2;            /*!< [23..22] DMA Channel Request Select                                       */
      __IOM uint32_t T16CM      : 2;            /*!< [25..24] DMA Channel Request Select                                       */
      __IOM uint32_t T16PM      : 2;            /*!< [27..26] DMA Channel Request Select                                       */
      __IOM uint32_t CHE        : 2;            /*!< [29..28] DMA Channel Request Select                                       */
            uint32_t            : 2;
    } bit;
  } DMAP_CCU7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) DMA Channel Select Register ADCs                           */
    
    struct {
      __IOM uint32_t ADC1_RES0  : 2;            /*!< [1..0] DMA Channel Request Select                                         */
      __IOM uint32_t ADC1_RES1  : 2;            /*!< [3..2] DMA Channel Request Select                                         */
      __IOM uint32_t ADC1_RES2  : 2;            /*!< [5..4] DMA Channel Request Select                                         */
      __IOM uint32_t ADC1_RES3  : 2;            /*!< [7..6] DMA Channel Request Select                                         */
      __IOM uint32_t ADC1_RES4  : 2;            /*!< [9..8] DMA Channel Request Select                                         */
      __IOM uint32_t ADC1_RES5  : 2;            /*!< [11..10] DMA Channel Request Select                                       */
      __IOM uint32_t ADC1_RES6  : 2;            /*!< [13..12] DMA Channel Request Select                                       */
      __IOM uint32_t ADC1_RES7  : 2;            /*!< [15..14] DMA Channel Request Select                                       */
      __IOM uint32_t ADC1_SQ0   : 2;            /*!< [17..16] DMA Channel Request Select                                       */
      __IOM uint32_t ADC1_SQ1   : 2;            /*!< [19..18] DMA Channel Request Select                                       */
      __IOM uint32_t ADC1_CMPLO : 2;            /*!< [21..20] DMA Channel Request Select                                       */
      __IOM uint32_t ADC1_CMPHI : 2;            /*!< [23..22] DMA Channel Request Select                                       */
      __IOM uint32_t SDADC_RES0 : 2;            /*!< [25..24] DMA Channel Request Select                                       */
      __IOM uint32_t SDADC_RES1 : 2;            /*!< [27..26] DMA Channel Request Select                                       */
            uint32_t            : 4;
    } bit;
  } DMAP_ADC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) DMA Channel Select Register Timer                          */
    
    struct {
      __IOM uint32_t T2OV       : 1;            /*!< [0..0] DMA Channel Request Select                                         */
      __IOM uint32_t T21OV      : 1;            /*!< [1..1] DMA Channel Request Select                                         */
            uint32_t            : 6;
      __IOM uint32_t GPT12T2    : 1;            /*!< [8..8] DMA Channel Request Select                                         */
      __IOM uint32_t GPT12T3    : 1;            /*!< [9..9] DMA Channel Request Select                                         */
      __IOM uint32_t GPT12T4    : 1;            /*!< [10..10] DMA Channel Request Select                                       */
      __IOM uint32_t GPT12T5    : 1;            /*!< [11..11] DMA Channel Request Select                                       */
      __IOM uint32_t GPT12T6    : 1;            /*!< [12..12] DMA Channel Request Select                                       */
      __IOM uint32_t GPT12CR    : 1;            /*!< [13..13] DMA Channel Request Select                                       */
            uint32_t            : 18;
    } bit;
  } DMAP_TIM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) DMA Channel Select Register COM Modules                    */
    
    struct {
      __IOM uint32_t SSC0_RIR   : 2;            /*!< [1..0] DMA Channel Request Select                                         */
      __IOM uint32_t SSC0_TIR   : 2;            /*!< [3..2] DMA Channel Request Select                                         */
      __IOM uint32_t SSC1_RIR   : 2;            /*!< [5..4] DMA Channel Request Select                                         */
      __IOM uint32_t SSC1_TIR   : 2;            /*!< [7..6] DMA Channel Request Select                                         */
      __IOM uint32_t UART0_RI   : 2;            /*!< [9..8] DMA Channel Request Select                                         */
      __IOM uint32_t UART0_TI   : 2;            /*!< [11..10] DMA Channel Request Select                                       */
      __IOM uint32_t UART1_RI   : 2;            /*!< [13..12] DMA Channel Request Select                                       */
      __IOM uint32_t UART1_TI   : 2;            /*!< [15..14] DMA Channel Request Select                                       */
      __IOM uint32_t CAN_IR0    : 1;            /*!< [16..16] DMA Channel Request Select                                       */
            uint32_t            : 1;
      __IOM uint32_t CAN_IR1    : 1;            /*!< [18..18] DMA Channel Request Select                                       */
            uint32_t            : 13;
    } bit;
  } DMAP_COM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Power Mode Control Register                                */
    
