popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
            uint32_t            : 1;
      __OM  uint32_t SLEEP      : 1;            /*!< [1..1] Sleep Mode Enable                                                  */
      __OM  uint32_t STOP       : 1;            /*!< [2..2] STOP Mode Enable                                                   */
            uint32_t            : 29;
    } bit;
  } PMCON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Peripheral Management Control Register                     */
    
    struct {
      __IOM uint32_t SSC0_DIS   : 1;            /*!< [0..0] SSC0 Module Disable                                                */
      __IOM uint32_t SSC1_DIS   : 1;            /*!< [1..1] SSC1 Module Disable                                                */
      __IOM uint32_t T2_DIS     : 1;            /*!< [2..2] Timer 20 Module Disable                                            */
      __IOM uint32_t T21_DIS    : 1;            /*!< [3..3] Timer 21 Module Disable                                            */
      __IOM uint32_t GPT12_DIS  : 1;            /*!< [4..4] Gerneral Purpose Timer 12 Module Disable                           */
            uint32_t            : 27;
    } bit;
  } PMCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) Module Suspend Control Register                            */
    
    struct {
      __IOM uint32_t SSC0SUS    : 1;            /*!< [0..0] SSC0 Suspend                                                       */
      __IOM uint32_t SSC1SUS    : 1;            /*!< [1..1] SSC1 Suspend                                                       */
      __IOM uint32_t T2SUS      : 1;            /*!< [2..2] Timer 20 Suspend                                                   */
      __IOM uint32_t T21SUS     : 1;            /*!< [3..3] Timer 21 Suspend                                                   */
      __IOM uint32_t GPT12SUS   : 1;            /*!< [4..4] Gerneral Purpose Timer 12 Suspend                                  */
      __IOM uint32_t WDTSUS     : 1;            /*!< [5..5] SCU Watchdog Timer Suspend                                         */
            uint32_t            : 26;
    } bit;
  } SUSCTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) PCU Control Register                                       */
    
    struct {
      __IOM uint32_t OT_SLEEP_EN : 1;           /*!< [0..0] System Overtemperature Sleep Mode Enable                           */
            uint32_t            : 13;
      __IOM uint32_t OTWARN_SD_DIS : 1;         /*!< [14..14] Overtemperature Warning Peripherals Shutdown Disable             */
      __IOM uint32_t XTALWDG_SD_DIS : 1;        /*!< [15..15] XTAL Watchdog Peripherals Shutdown Disable                       */
            uint32_t            : 8;
      __IOM uint32_t BDRV_SD_EN : 1;            /*!< [24..24] BDRV Shutdown Enable                                             */
            uint32_t            : 7;
    } bit;
  } PCU_CTRL;
  __IM  uint32_t  RESERVED1[9];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) DMA Control Register                                       */
    
    struct {
      __IOM uint32_t DEMEN_CH0  : 1;            /*!< [0..0] DMA Endless Mode Enable Channel 0                                  */
      __IOM uint32_t DEMEN_CH1  : 1;            /*!< [1..1] DMA Endless Mode Enable Channel 1                                  */
      __IOM uint32_t DEMEN_CH2  : 1;            /*!< [2..2] DMA Endless Mode Enable Channel 2                                  */
      __IOM uint32_t DEMEN_CH3  : 1;            /*!< [3..3] DMA Endless Mode Enable Channel 3                                  */
      __IOM uint32_t DEMEN_CH4  : 1;            /*!< [4..4] DMA Endless Mode Enable Channel 4                                  */
      __IOM uint32_t DEMEN_CH5  : 1;            /*!< [5..5] DMA Endless Mode Enable Channel 5                                  */
      __IOM uint32_t DEMEN_CH6  : 1;            /*!< [6..6] DMA Endless Mode Enable Channel 6                                  */
      __IOM uint32_t DEMEN_CH7  : 1;            /*!< [7..7] DMA Endless Mode Enable Channel 7                                  */
      __IOM uint32_t DMAREQINTEN_CH0 : 1;       /*!< [8..8] DMA Pending Request Interrupt Enable Channel 0                     */
      __IOM uint32_t DMAREQINTEN_CH1 : 1;       /*!< [9..9] DMA Pending Request Interrupt Enable Channel 1                     */
      __IOM uint32_t DMAREQINTEN_CH2 : 1;       /*!< [10..10] DMA Pending Request Interrupt Enable Channel 2                   */
      __IOM uint32_t DMAREQINTEN_CH3 : 1;       /*!< [11..11] DMA Pending Request Interrupt Enable Channel 3                   */
      __IOM uint32_t DMAREQINTEN_CH4 : 1;       /*!< [12..12] DMA Pending Request Interrupt Enable Channel 4                   */
      __IOM uint32_t DMAREQINTEN_CH5 : 1;       /*!< [13..13] DMA Pending Request Interrupt Enable Channel 5                   */
      __IOM uint32_t DMAREQINTEN_CH6 : 1;       /*!< [14..14] DMA Pending Request Interrupt Enable Channel 6                   */
      __IOM uint32_t DMAREQINTEN_CH7 : 1;       /*!< [15..15] DMA Pending Request Interrupt Enable Channel 7                   */
            uint32_t            : 16;
    } bit;
  } DMACTRL;
} SCU_Type;                                     /*!< Size = 228 (0xe4)                                                         */



/* =========================================================================================================================== */
/* ================                                           SDADC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Sigma Delta Analog/Digital Converter (SDADC)
  */

typedef struct {                                /*!< (@ 0x40004000) SDADC Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Configuration Register 0                                   */
    
