popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t EN0        : 1;            /*!< [0..0] Enable Channel 0                                                   */
      __IOM uint32_t CICMODE0   : 1;            /*!< [1..1] CIC Filter Mode channel 0                                          */
      __IOM uint32_t WFREN0     : 1;            /*!< [2..2] Wait for Read of Result Register Channel 0                         */
            uint32_t            : 5;
      __IOM uint32_t EN1        : 1;            /*!< [8..8] Enable Channel 1                                                   */
      __IOM uint32_t CICMODE1   : 1;            /*!< [9..9] CIC Filter Mode channel 1                                          */
      __IOM uint32_t WFREN1     : 1;            /*!< [10..10] Wait for Read of Result Register Channel 1                       */
            uint32_t            : 5;
      __IOM uint32_t PRE        : 3;            /*!< [18..16] Prescaler for Modulator and CIC clock                            */
      __IOM uint32_t DITHEREN   : 1;            /*!< [19..19] Dithering of SD ADC Clock for channel 0/1                        */
            uint32_t            : 12;
    } bit;
  } CFG0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Configuration Register 1                                   */
    
    struct {
      __IOM uint32_t DECF0      : 9;            /*!< [8..0] Decimation Factor channel 0                                        */
            uint32_t            : 3;
      __IOM uint32_t RESSHIFT0  : 4;            /*!< [15..12] Result Left shift channel 0                                      */
      __IOM uint32_t DECF1      : 9;            /*!< [24..16] Decimation factor channel 1                                      */
            uint32_t            : 3;
      __IOM uint32_t RESSHIFT1  : 4;            /*!< [31..28] Result Left shift channel 1                                      */
    } bit;
  } CFG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Alternate function selection                               */
    
    struct {
      __IOM uint32_t MCLK       : 2;            /*!< [1..0] MCLK output mapping                                                */
            uint32_t            : 2;
      __IOM uint32_t DOUT0      : 2;            /*!< [5..4] DOUT0 mapping                                                      */
            uint32_t            : 2;
      __IOM uint32_t DOUT1      : 2;            /*!< [9..8] DOUT1 mapping                                                      */
            uint32_t            : 22;
    } bit;
  } ALTSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Input Port Selection                                       */
    
    struct {
      __IOM uint32_t IN0PSEL    : 2;            /*!< [1..0] Selection for positive analog input of channel 0                   */
      __IOM uint32_t IN0NSEL    : 2;            /*!< [3..2] Selection for negative analog input of channel 0                   */
      __IOM uint32_t DIN0SEL    : 2;            /*!< [5..4] Selection of digital input of channel 0                            */
      __IOM uint32_t TRG0SEL    : 1;            /*!< [6..6] Trigger Event Selection                                            */
            uint32_t            : 9;
      __IOM uint32_t IN1PSEL    : 2;            /*!< [17..16] Selection for positive analog input of channel 0                 */
      __IOM uint32_t IN1NSEL    : 2;            /*!< [19..18] INN Input Select 1                                               */
      __IOM uint32_t DIN1SEL    : 2;            /*!< [21..20] External Digital Input Selection 1                               */
      __IOM uint32_t TRG1SEL    : 1;            /*!< [22..22] Trigger Event Selection                                          */
            uint32_t            : 9;
    } bit;
  } INSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32_t RES0_EN    : 1;            /*!< [0..0] Result interupt channel 0                                          */
      __IOM uint32_t CMP0_UP_EN : 1;            /*!< [1..1] Upper Compare Level Interupt channel 0                             */
      __IOM uint32_t CMP0_LO_EN : 1;            /*!< [2..2] Lower compare level Interupt channel 0                             */
            uint32_t            : 1;
      __IOM uint32_t RES1_EN    : 1;            /*!< [4..4] Result interupt channel 1                                          */
      __IOM uint32_t CMP1_UP_EN : 1;            /*!< [5..5] Upper Compare Level Interupt channel 1                             */
      __IOM uint32_t CMP1_LO_EN : 1;            /*!< [6..6] Lower compare level Interupt channel 1                             */
            uint32_t            : 25;
    } bit;
  } IEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Event Register                                             */
    
    struct {
      __IOM uint32_t RES0_IS    : 1;            /*!< [0..0] Result Interupt channel 0                                          */
      __IOM uint32_t CMP0_UP_IS : 1;            /*!< [1..1] Upper Compare level Interupt channel 0                             */
      __IOM uint32_t CMP0_LO_IS : 1;            /*!< [2..2] Lower compare level interupt channel 0                             */
            uint32_t            : 1;
      __IOM uint32_t RES1_IS    : 1;            /*!< [4..4] Result interupt channel 1                                          */
      __IOM uint32_t CMP1_UP_IS : 1;            /*!< [5..5] Upper Compare level Interupt channel 1                             */
      __IOM uint32_t CMP1_LO_IS : 1;            /*!< [6..6] Lower compare level interupt channel 1                             */
            uint32_t            : 25;
    } bit;
  } IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Event Clear Register                                       */
    
