popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t RES0_ISC   : 1;            /*!< [0..0] Result Interupt clear channel 0                                    */
      __OM  uint32_t CMP0_UP_ISC : 1;           /*!< [1..1] Upper Compare Level Interupt clear channel 0                       */
      __OM  uint32_t CMP0_LO_ISC : 1;           /*!< [2..2] Lower Compare Level Interupt clear channel 0                       */
            uint32_t            : 1;
      __OM  uint32_t RES1_ISC   : 1;            /*!< [4..4] Result Interupt clear channel 1                                    */
      __OM  uint32_t CMP1_UP_ISC : 1;           /*!< [5..5] Upper Compare Level Interupt clear channel 1                       */
      __OM  uint32_t CMP1_LO_ISC : 1;           /*!< [6..6] Lower Compare Level Interupt clear channel 1                       */
            uint32_t            : 25;
    } bit;
  } ISR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Event Set Register                                         */
    
    struct {
      __OM  uint32_t RES0_ISS   : 1;            /*!< [0..0] Result Interupt set channel 0                                      */
      __OM  uint32_t CMP0_UP_ISS : 1;           /*!< [1..1] Upper Compare Level Interupt set channel 0                         */
      __OM  uint32_t CMP0_LO_ISS : 1;           /*!< [2..2] Lower Compare Level Interrupt set channel 0                        */
            uint32_t            : 1;
      __OM  uint32_t RES1_ISS   : 1;            /*!< [4..4] Result Interupt set channel 1                                      */
      __OM  uint32_t CMP1_UP_ISS : 1;           /*!< [5..5] Upper Compare Level Interupt set channel 1                         */
      __OM  uint32_t CMP1_LO_ISS : 1;           /*!< [6..6] Lower Compare Level Interupt set channel 1                         */
            uint32_t            : 25;
    } bit;
  } ISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Interupt Node Pointer                                      */
    
    struct {
      __IOM uint32_t RES0_INP   : 1;            /*!< [0..0] Result Interupt Node Pointer channel 0                             */
      __IOM uint32_t CMP0_UP_INP : 1;           /*!< [1..1] Upper Compare Level Interupt Pointer channel 0                     */
      __IOM uint32_t CMP0_LO_INP : 1;           /*!< [2..2] Lower Compare Level Interupt Pointer channel 0                     */
            uint32_t            : 1;
      __IOM uint32_t RES1_INP   : 1;            /*!< [4..4] Result Interupt Node Pointer channel 1                             */
      __IOM uint32_t CMP1_UP_INP : 1;           /*!< [5..5] Upper Compare Level Interupt Pointer channel 1                     */
      __IOM uint32_t CMP1_LO_INP : 1;           /*!< [6..6] Lower Compare Level Interupt Pointer channel 1                     */
            uint32_t            : 25;
    } bit;
  } INP;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Suspend Control                                            */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Suspend Mode Enable                                                */
            uint32_t            : 31;
    } bit;
  } SUSCTR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000028) Suspend Status                                             */
    
    struct {
      __IM  uint32_t STAT       : 1;            /*!< [0..0] Suspend Status                                                     */
            uint32_t            : 31;
    } bit;
  } SUSSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Compare Channel 0 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 9;            /*!< [8..0] Lower Compare Level for channel 0                                  */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold channel
                                                     0                                                                         */
      __IOM uint32_t UPLO_OUTSEL : 2;           /*!< [15..14] Signal output selection for UPLO output of channel
                                                     0                                                                         */
      __IOM uint32_t UPPER      : 9;            /*!< [24..16] Upper Compare Level for channel 0                                */
            uint32_t            : 3;
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold channel
                                                     0                                                                         */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode channel 0                                           */
    } bit;
  } CMP0_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Compare Channel 1 Control Register                         */
    
    struct {
      __IOM uint32_t LOWER      : 9;            /*!< [8..0] Lower Compare Level for channel 1                                  */
            uint32_t            : 3;
      __IOM uint32_t HYST_LO    : 2;            /*!< [13..12] Hysteresis setting for lower compare threshold channel
                                                     1                                                                         */
      __IOM uint32_t UPLO_OUTSEL : 2;           /*!< [15..14] Signal output selection for UPLO output of channel
                                                     1                                                                         */
      __IOM uint32_t UPPER      : 9;            /*!< [24..16] Upper Compare Level for channel 1                                */
            uint32_t            : 3;
      __IOM uint32_t HYST_UP    : 2;            /*!< [29..28] Hysteresis setting for upper compare threshold channel
                                                     1                                                                         */
      __IOM uint32_t MODE       : 2;            /*!< [31..30] Compare Mode channel 1                                           */
    } bit;
  } CMP1_CTRL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000034) Result Register channel 0                                  */
    
