popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] Result Register 2s complement                                     */
      __IM  uint32_t TIMVAL     : 9;            /*!< [24..16] Timestamp Value                                                  */
            uint32_t            : 3;
      __IM  uint32_t VALCNT     : 3;            /*!< [30..28] Valid Counter                                                    */
      __IM  uint32_t RESVALID   : 1;            /*!< [31..31] Result valid                                                     */
    } bit;
  } RES0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000038) Result Register channel 1                                  */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] Result Register 2s complement                                     */
      __IM  uint32_t TIMVAL     : 9;            /*!< [24..16] Timestamp Value                                                  */
            uint32_t            : 3;
      __IM  uint32_t VALCNT     : 3;            /*!< [30..28] Valid Counter                                                    */
      __IM  uint32_t RESVALID   : 1;            /*!< [31..31] Result valid                                                     */
    } bit;
  } RES1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000003C) Captured Timestamp channel 0                               */
    
    struct {
      __IM  uint32_t TIMVAL     : 9;            /*!< [8..0] Captured Timestamp Value                                           */
            uint32_t            : 23;
    } bit;
  } CTIM0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000040) Captured Timestamp channel 1                               */
    
    struct {
      __IM  uint32_t TIMVAL     : 9;            /*!< [8..0] Captured Timestamp Value                                           */
            uint32_t            : 23;
    } bit;
  } CTIM1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Dither Configuration Register                              */
    
    struct {
      __IOM uint32_t DITH_VOLT_SEL : 4;         /*!< [3..0] Dither voltage Selection                                           */
            uint32_t            : 28;
    } bit;
  } DITHCFG;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Status Clear Register                                      */
    
    struct {
            uint32_t            : 1;
      __OM  uint32_t CMP0_UP_SC : 1;            /*!< [1..1] Upper Compare level Status clear channel 0                         */
      __OM  uint32_t CMP0_LO_SC : 1;            /*!< [2..2] Lower compare level Status clear channel 0                         */
      __OM  uint32_t WFR0_SC    : 1;            /*!< [3..3] Wait for Read Status clear channel 0                               */
            uint32_t            : 1;
      __OM  uint32_t CMP1_UP_SC : 1;            /*!< [5..5] Upper Compare level Status clear channel 1                         */
      __OM  uint32_t CMP1_LO_SC : 1;            /*!< [6..6] Lower compare level Status clear channel 1                         */
      __OM  uint32_t WFR1_SC    : 1;            /*!< [7..7] Wait for Read Status clear channel 1                               */
            uint32_t            : 24;
    } bit;
  } STSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Status Register                                            */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t CMP0_UP_STS : 1;           /*!< [1..1] Upper Compare level Status channel 0                               */
      __IOM uint32_t CMP0_LO_STS : 1;           /*!< [2..2] Lower compare level Status channel 0                               */
      __IOM uint32_t WFR0_STS   : 1;            /*!< [3..3] Result discarded channel 0                                         */
            uint32_t            : 1;
      __IOM uint32_t CMP1_UP_STS : 1;           /*!< [5..5] Upper Compare level Status channel 1                               */
      __IOM uint32_t CMP1_LO_STS : 1;           /*!< [6..6] Lower compare level Status channel 1                               */
      __IOM uint32_t WFR1_STS   : 1;            /*!< [7..7] Result discarded channel 1                                         */
            uint32_t            : 24;
    } bit;
  } STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Status Set Register                                        */
    
    struct {
            uint32_t            : 1;
      __OM  uint32_t CMP0_UP_SS : 1;            /*!< [1..1] Upper Compare level Status set channel 0                           */
      __OM  uint32_t CMP0_LO_SS : 1;            /*!< [2..2] Lower compare level Status set channel 0                           */
      __OM  uint32_t WFR0_SS    : 1;            /*!< [3..3] Wait for Read Status set channel 0                                 */
            uint32_t            : 1;
      __OM  uint32_t CMP1_UP_SS : 1;            /*!< [5..5] Upper Compare level Status set channel 1                           */
      __OM  uint32_t CMP1_LO_SS : 1;            /*!< [6..6] Lower compare level Status set channel 1                           */
      __OM  uint32_t WFR1_SS    : 1;            /*!< [7..7] Wait for Read Status set channel 1                                 */
            uint32_t            : 24;
    } bit;
  } STSS;
} SDADC_Type;                                   /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                           SSC0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSC0 (SSC0)
  */

typedef struct {                                /*!< (@ 0x48020000) SSC0 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control Register                                           */
    
