popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t BM         : 6;            /*!< [5..0] Data Width Selection - Number of bits per transfer                 */
      __IOM uint32_t HB         : 1;            /*!< [6..6] Heading Control                                                    */
      __IOM uint32_t PH         : 1;            /*!< [7..7] Clock Phase Control                                                */
      __IOM uint32_t PO         : 1;            /*!< [8..8] Clock Polarity Control                                             */
      __IOM uint32_t LB         : 1;            /*!< [9..9] Loop Back Control                                                  */
            uint32_t            : 2;
      __IOM uint32_t AREN       : 1;            /*!< [12..12] Automatic Reset Enable                                           */
            uint32_t            : 1;
      __IOM uint32_t MS         : 1;            /*!< [14..14] Master Select                                                    */
      __IOM uint32_t EN         : 1;            /*!< [15..15] Enable Bit                                                       */
      __IOM uint32_t SLCSEN     : 1;            /*!< [16..16] Slave Chip Select Enable                                         */
      __IOM uint32_t MSCSEN     : 1;            /*!< [17..17] Master Chip Select Enable                                        */
      __IOM uint32_t MSCSSEL    : 4;            /*!< [21..18] Master Chip Select Output Selection                              */
      __OM  uint32_t MSTXSTART  : 1;            /*!< [22..22] Master Mode Transmit Start Bit                                   */
      __IOM uint32_t MSTXENSEL  : 2;            /*!< [24..23] Master Mode Transmit Start Trigger Select                        */
            uint32_t            : 7;
    } bit;
  } CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Port Input Select Register                                 */
    
    struct {
      __IOM uint32_t MRSTSEL    : 2;            /*!< [1..0] Master Mode Data Input Select                                      */
      __IOM uint32_t SLCLKSEL   : 2;            /*!< [3..2] Slave Mode Clock Input Select                                      */
      __IOM uint32_t MTSRSEL    : 2;            /*!< [5..4] Slave Mode Data Input Select                                       */
      __IOM uint32_t SLCSSEL    : 2;            /*!< [7..6] Slave Mode Chip Select Input Select                                */
      __IOM uint32_t TXEVSEL    : 2;            /*!< [9..8] Master Mode TX Start Event Input Select                            */
            uint32_t            : 22;
    } bit;
  } INSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Master Mode Chip Select Timings Register                   */
    
    struct {
      __IOM uint32_t ST         : 6;            /*!< [5..0] CS Low Time At Start Of Transmission                               */
            uint32_t            : 2;
      __IOM uint32_t END        : 6;            /*!< [13..8] CS Low Time At End Of Transmission                                */
            uint32_t            : 2;
      __IOM uint32_t HIGH       : 6;            /*!< [21..16] Minimum CS High Time After Transmission                          */
            uint32_t            : 10;
    } bit;
  } CSTIM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32_t TIREN      : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Enable                             */
      __IOM uint32_t RIREN      : 1;            /*!< [1..1] Receive Buffer Updated Interrupt Enable                            */
      __IOM uint32_t TEIREN     : 1;            /*!< [2..2] Transmit Error Interrupt Enable                                    */
      __IOM uint32_t REIREN     : 1;            /*!< [3..3] Receive Error Interrupt Enable                                     */
      __IOM uint32_t PEIREN     : 1;            /*!< [4..4] Phase Error Interrupt Enable                                       */
      __IOM uint32_t BEIREN     : 1;            /*!< [5..5] Baud Rate Error Interrupt Enable                                   */
            uint32_t            : 26;
    } bit;
  } IEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t TIR        : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Flag                               */
      __IM  uint32_t RIR        : 1;            /*!< [1..1] Receive Buffer Full Interrupt Flag                                 */
      __IM  uint32_t TEIR       : 1;            /*!< [2..2] Transmit Error Interrupt Flag                                      */
      __IM  uint32_t REIR       : 1;            /*!< [3..3] Receive Error Interrupt Flag                                       */
      __IM  uint32_t PEIR       : 1;            /*!< [4..4] Phase Error Interrupt Flag                                         */
      __IM  uint32_t BEIR       : 1;            /*!< [5..5] Baud Rate Error Interrupt Flag                                     */
            uint32_t            : 26;
    } bit;
  } IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Interrupt Status Set Register                              */
    
    struct {
      __OM  uint32_t TIRSET     : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Set                                */
      __OM  uint32_t RIRSET     : 1;            /*!< [1..1] Receive Buffer Updated Interrupt Set                               */
      __OM  uint32_t TEIRSET    : 1;            /*!< [2..2] Transmit Error Interrupt Set                                       */
      __OM  uint32_t REIRSET    : 1;            /*!< [3..3] Receive Error Interrupt Set                                        */
      __OM  uint32_t PEIRSET    : 1;            /*!< [4..4] Phase Error Interrupt Set                                          */
      __OM  uint32_t BEIRSET    : 1;            /*!< [5..5] Baud Rate Error Interrupt Set                                      */
            uint32_t            : 26;
    } bit;
  } ISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Interrupt Status Clear Register                            */
    
