popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t TIRCLR     : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Clear                              */
      __OM  uint32_t RIRCLR     : 1;            /*!< [1..1] Receive Buffer Updated Interrupt Clear                             */
      __OM  uint32_t TEIRCLR    : 1;            /*!< [2..2] Transmit Error Interrupt Clear                                     */
      __OM  uint32_t REIRCLR    : 1;            /*!< [3..3] Receive Error Interrupt Clear                                      */
      __OM  uint32_t PEIRCLR    : 1;            /*!< [4..4] Phase Error Interrupt Clear                                        */
      __OM  uint32_t BEIRCLR    : 1;            /*!< [5..5] Baud Rate Error Interrupt Clear                                    */
            uint32_t            : 26;
    } bit;
  } ISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Baud Rate Timer Register                                   */
    
    struct {
      __IOM uint32_t BR_VALUE   : 16;           /*!< [15..0] Baud Rate Timer Value                                             */
            uint32_t            : 16;
    } bit;
  } BR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Transmitter Buffer Register Bits [31:0]                    */
    
    struct {
      __IOM uint32_t TB_VALUE_LOWER : 32;       /*!< [31..0] Transmit Data [31:0]                                              */
    } bit;
  } TB0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Transmitter Buffer Register Bits [63:32]                   */
    
    struct {
      __IOM uint32_t TB_VALUE_UPPER : 32;       /*!< [31..0] Transmit Data [63:32]                                             */
    } bit;
  } TB1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000028) Receiver Buffer Register Bits [31:0]                       */
    
    struct {
      __IM  uint32_t RB_VALUE_LOWER : 32;       /*!< [31..0] Receive Data [31:0]                                               */
    } bit;
  } RB0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) Receiver Buffer Register Bits [63:32]                      */
    
    struct {
      __IM  uint32_t RB_VALUE_UPPER : 32;       /*!< [31..0] Receive Data [63:32]                                              */
    } bit;
  } RB1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) Status Register                                            */
    
    struct {
      __IM  uint32_t BC         : 6;            /*!< [5..0] Bit Count Field                                                    */
      __IM  uint32_t BSY        : 1;            /*!< [6..6] Busy Flag                                                          */
            uint32_t            : 25;
    } bit;
  } STAT;
} SSC0_Type;                                    /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                           SSC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSC1 (SSC1)
  */

typedef struct {                                /*!< (@ 0x48024000) SSC1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control Register                                           */
    
    struct {
      __IOM uint32_t BM         : 6;            /*!< [5..0] Data Width Selection - Number of bits per transfer                 */
      __IOM uint32_t HB         : 1;            /*!< [6..6] Heading Control                                                    */
      __IOM uint32_t PH         : 1;            /*!< [7..7] Clock Phase Control                                                */
      __IOM uint32_t PO         : 1;            /*!< [8..8] Clock Polarity Control                                             */
      __IOM uint32_t LB         : 1;            /*!< [9..9] Loop Back Control                                                  */
            uint32_t            : 2;
      __IOM uint32_t AREN       : 1;            /*!< [12..12] Automatic Reset Enable                                           */
            uint32_t            : 1;
      __IOM uint32_t MS         : 1;            /*!< [14..14] Master Select                                                    */
      __IOM uint32_t EN         : 1;            /*!< [15..15] Enable Bit                                                       */
      __IOM uint32_t SLCSEN     : 1;            /*!< [16..16] Slave Chip Select Enable                                         */
      __IOM uint32_t MSCSEN     : 1;            /*!< [17..17] Master Chip Select Enable                                        */
      __IOM uint32_t MSCSSEL    : 4;            /*!< [21..18] Master Chip Select Output Selection                              */
      __OM  uint32_t MSTXSTART  : 1;            /*!< [22..22] Master Mode Transmit Start Bit                                   */
      __IOM uint32_t MSTXENSEL  : 2;            /*!< [24..23] Master Mode Transmit Start Trigger Select                        */
            uint32_t            : 7;
    } bit;
  } CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Port Input Select Register                                 */
    
    struct {
      __IOM uint32_t MRSTSEL    : 2;            /*!< [1..0] Master Mode Data Input Select                                      */
      __IOM uint32_t SLCLKSEL   : 2;            /*!< [3..2] Slave Mode Clock Input Select                                      */
      __IOM uint32_t MTSRSEL    : 2;            /*!< [5..4] Slave Mode Data Input Select                                       */
      __IOM uint32_t SLCSSEL    : 2;            /*!< [7..6] Slave Mode Chip Select Input Select                                */
      __IOM uint32_t TXEVSEL    : 2;            /*!< [9..8] Master Mode TX Start Event Input Select                            */
            uint32_t            : 22;
    } bit;
  } INSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Master Mode Chip Select Timings Register                   */
    
