popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t ST         : 6;            /*!< [5..0] CS Low Time At Start Of Transmission                               */
            uint32_t            : 2;
      __IOM uint32_t END        : 6;            /*!< [13..8] CS Low Time At End Of Transmission                                */
            uint32_t            : 2;
      __IOM uint32_t HIGH       : 6;            /*!< [21..16] Minimum CS High Time After Transmission                          */
            uint32_t            : 10;
    } bit;
  } CSTIM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32_t TIREN      : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Enable                             */
      __IOM uint32_t RIREN      : 1;            /*!< [1..1] Receive Buffer Updated Interrupt Enable                            */
      __IOM uint32_t TEIREN     : 1;            /*!< [2..2] Transmit Error Interrupt Enable                                    */
      __IOM uint32_t REIREN     : 1;            /*!< [3..3] Receive Error Interrupt Enable                                     */
      __IOM uint32_t PEIREN     : 1;            /*!< [4..4] Phase Error Interrupt Enable                                       */
      __IOM uint32_t BEIREN     : 1;            /*!< [5..5] Baud Rate Error Interrupt Enable                                   */
            uint32_t            : 26;
    } bit;
  } IEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t TIR        : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Flag                               */
      __IM  uint32_t RIR        : 1;            /*!< [1..1] Receive Buffer Full Interrupt Flag                                 */
      __IM  uint32_t TEIR       : 1;            /*!< [2..2] Transmit Error Interrupt Flag                                      */
      __IM  uint32_t REIR       : 1;            /*!< [3..3] Receive Error Interrupt Flag                                       */
      __IM  uint32_t PEIR       : 1;            /*!< [4..4] Phase Error Interrupt Flag                                         */
      __IM  uint32_t BEIR       : 1;            /*!< [5..5] Baud Rate Error Interrupt Flag                                     */
            uint32_t            : 26;
    } bit;
  } IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Interrupt Status Set Register                              */
    
    struct {
      __OM  uint32_t TIRSET     : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Set                                */
      __OM  uint32_t RIRSET     : 1;            /*!< [1..1] Receive Buffer Updated Interrupt Set                               */
      __OM  uint32_t TEIRSET    : 1;            /*!< [2..2] Transmit Error Interrupt Set                                       */
      __OM  uint32_t REIRSET    : 1;            /*!< [3..3] Receive Error Interrupt Set                                        */
      __OM  uint32_t PEIRSET    : 1;            /*!< [4..4] Phase Error Interrupt Set                                          */
      __OM  uint32_t BEIRSET    : 1;            /*!< [5..5] Baud Rate Error Interrupt Set                                      */
            uint32_t            : 26;
    } bit;
  } ISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Interrupt Status Clear Register                            */
    
    struct {
      __OM  uint32_t TIRCLR     : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Clear                              */
      __OM  uint32_t RIRCLR     : 1;            /*!< [1..1] Receive Buffer Updated Interrupt Clear                             */
      __OM  uint32_t TEIRCLR    : 1;            /*!< [2..2] Transmit Error Interrupt Clear                                     */
      __OM  uint32_t REIRCLR    : 1;            /*!< [3..3] Receive Error Interrupt Clear                                      */
      __OM  uint32_t PEIRCLR    : 1;            /*!< [4..4] Phase Error Interrupt Clear                                        */
      __OM  uint32_t BEIRCLR    : 1;            /*!< [5..5] Baud Rate Error Interrupt Clear                                    */
            uint32_t            : 26;
    } bit;
  } ISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Baud Rate Timer Register                                   */
    
    struct {
      __IOM uint32_t BR_VALUE   : 16;           /*!< [15..0] Baud Rate Timer Value                                             */
            uint32_t            : 16;
    } bit;
  } BR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Transmitter Buffer Register Bits [31:0]                    */
    
    struct {
      __IOM uint32_t TB_VALUE_LOWER : 32;       /*!< [31..0] Transmit Data [31:0]                                              */
    } bit;
  } TB0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Transmitter Buffer Register Bits [63:32]                   */
    
    struct {
      __IOM uint32_t TB_VALUE_UPPER : 32;       /*!< [31..0] Transmit Data [63:32]                                             */
    } bit;
  } TB1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000028) Receiver Buffer Register Bits [31:0]                       */
    
    struct {
      __IM  uint32_t RB_VALUE_LOWER : 32;       /*!< [31..0] Receive Data [31:0]                                               */
    } bit;
  } RB0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) Receiver Buffer Register Bits [63:32]                      */
    
    struct {
      __IM  uint32_t RB_VALUE_UPPER : 32;       /*!< [31..0] Receive Data [63:32]                                              */
    } bit;
  } RB1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) Status Register                                            */
    
