popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __IOM uint32_t CP_RL2     : 1;            /*!< [0..0] Capture/Reload Select                                              */
      __IOM uint32_t C_T2       : 1;            /*!< [1..1] Timer or Counter Select                                            */
      __IOM uint32_t TR2        : 1;            /*!< [2..2] Timer 2 Start/Stop Control                                         */
      __IOM uint32_t EXEN2      : 1;            /*!< [3..3] Timer 2 External Enable Control                                    */
            uint32_t            : 2;
      __IM  uint32_t EXF2       : 1;            /*!< [6..6] Timer 2 External Flag                                              */
      __IM  uint32_t TF2        : 1;            /*!< [7..7] Timer 2 Overflow/Underflow Flag                                    */
      __IOM uint32_t T2INSEL    : 2;            /*!< [9..8] Timer 2 count input selection                                      */
      __IOM uint32_t T2EXINSEL  : 2;            /*!< [11..10] Timer 2 capture input selection                                  */
            uint32_t            : 20;
    } bit;
  } CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Timer 2 Mode Register                                      */
    
    struct {
      __IOM uint32_t DCEN       : 1;            /*!< [0..0] Up/Down Counter Enable                                             */
      __IOM uint32_t T2PRE      : 3;            /*!< [3..1] Timer 2 Prescaler Bit                                              */
      __IOM uint32_t PREN       : 1;            /*!< [4..4] Prescaler Enable                                                   */
      __IOM uint32_t EDGESEL    : 1;            /*!< [5..5] Edge Select in Capture Mode/Reload Mode/Baud-rate Generator
                                                     Mode                                                                      */
      __IOM uint32_t T2RHEN     : 1;            /*!< [6..6] Timer 2 External Start Enable                                      */
      __IOM uint32_t T2REGS     : 1;            /*!< [7..7] Edge Select for Timer 2 External Start                             */
            uint32_t            : 24;
    } bit;
  } MOD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Timer 2 Reload/Capture Register                            */
    
    struct {
      __IOM uint32_t RCL2       : 8;            /*!< [7..0] Reload/Capture Value                                               */
      __IOM uint32_t RCH2       : 8;            /*!< [15..8] Reload/Capture Value                                              */
            uint32_t            : 16;
    } bit;
  } RC;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Timer 2 Count Register                                     */
    
    struct {
      __IOM uint32_t T2L        : 8;            /*!< [7..0] Timer 2 Value                                                      */
      __IOM uint32_t T2H        : 8;            /*!< [15..8] Timer 2 Value                                                     */
            uint32_t            : 16;
    } bit;
  } CNT;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Timer 2 Interrupt Clear Register                           */
    
    struct {
            uint32_t            : 6;
      __OM  uint32_t EXF2CLR    : 1;            /*!< [6..6] External Interrupt Clear Flag                                      */
      __OM  uint32_t TF2CLR     : 1;            /*!< [7..7] Overflow/Underflow Interrupt Clear Flag                            */
            uint32_t            : 24;
    } bit;
  } ICLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Timer 2 Control Register 1                                 */
    
    struct {
      __IOM uint32_t EXF2EN     : 1;            /*!< [0..0] External Interrupt Enable                                          */
      __IOM uint32_t TF2EN      : 1;            /*!< [1..1] Overflow/Underflow Interrupt Enable                                */
            uint32_t            : 30;
    } bit;
  } CON1;
} T21_Type;                                     /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART0 (UART0)
  */

typedef struct {                                /*!< (@ 0x48018000) UART0 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port Input Select Register                                 */
    
    struct {
      __IOM uint32_t RXDSEL     : 2;            /*!< [1..0] RXD Input Select                                                   */
      __IOM uint32_t TXEVSEL    : 2;            /*!< [3..2] TX Start Event Input Select                                        */
            uint32_t            : 28;
    } bit;
  } INSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Serial Channel Control Register                            */
    
    struct {
      __IOM uint32_t SM0        : 1;            /*!< [0..0] Serial Port Operating Mode Selection                               */
      __IOM uint32_t SM1        : 1;            /*!< [1..1] Serial Port Operating Mode Selection                               */
      __IOM uint32_t SM2        : 1;            /*!< [2..2] Enable Serial Port Multiprocessor Communication in Mode
                                                     2 and 3                                                                   */
      __IOM uint32_t REN        : 1;            /*!< [3..3] Enable Receiver of Serial Port                                     */
      __IOM uint32_t RMOD       : 1;            /*!< [4..4] Receiver Mode                                                      */
      __IOM uint32_t TXINV      : 1;            /*!< [5..5] TX Data Inverter Enable                                            */
            uint32_t            : 2;
      __IOM uint32_t TXENSEL    : 2;            /*!< [9..8] Transmit Start Trigger Select                                      */
            uint32_t            : 22;
    } bit;
  } SCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Transmit Start Register                                    */
    
