popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t TXSTART    : 1;            /*!< [0..0] Transmit Start Bit                                                 */
            uint32_t            : 31;
    } bit;
  } TSTART;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Serial TX Data Buffer                                      */
    
    struct {
      __IOM uint32_t TXDATA     : 8;            /*!< [7..0] Serial Interface TxBuffer Register                                 */
      __IOM uint32_t TB8        : 1;            /*!< [8..8] Serial Port Transmitter Bit 9                                      */
            uint32_t            : 23;
    } bit;
  } TXBUF;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) Serial RX Data Buffer                                      */
    
    struct {
      __IM  uint32_t RXDATA     : 8;            /*!< [7..0] Serial Interface RxBuffer Register                                 */
      __IM  uint32_t RB8        : 1;            /*!< [8..8] Serial Port Receiver Bit 9                                         */
            uint32_t            : 23;
    } bit;
  } RXBUF;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32_t TIEN       : 1;            /*!< [0..0] Transmit Interrupt Enable                                          */
      __IOM uint32_t RIEN       : 1;            /*!< [1..1] Receive Interrupt Enable                                           */
            uint32_t            : 6;
      __IOM uint32_t ERRSYNEN   : 1;            /*!< [8..8] SYN Error Interrupt Enable                                         */
      __IOM uint32_t EOFSYNEN   : 1;            /*!< [9..9] End of SYN Byte Interrupt Enable                                   */
            uint32_t            : 22;
    } bit;
  } IEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t TI         : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Flag                               */
      __IM  uint32_t RI         : 1;            /*!< [1..1] Receive Interrupt Flag                                             */
            uint32_t            : 6;
      __IM  uint32_t ERRSYN     : 1;            /*!< [8..8] SYN Error Interrupt Flag                                           */
      __IM  uint32_t EOFSYN     : 1;            /*!< [9..9] End of SYN Byte Interrupt Flag                                     */
            uint32_t            : 22;
    } bit;
  } IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Interrupt Status Set Register                              */
    
    struct {
      __OM  uint32_t TISET      : 1;            /*!< [0..0] Transmit Interrupt Set                                             */
      __OM  uint32_t RISET      : 1;            /*!< [1..1] Receive Interrupt Set                                              */
            uint32_t            : 6;
      __OM  uint32_t ERRSYNSET  : 1;            /*!< [8..8] SYN Error Interrupt Set                                            */
      __OM  uint32_t EOFSYNSET  : 1;            /*!< [9..9] End of SYN Byte Interrupt Set                                      */
            uint32_t            : 22;
    } bit;
  } ISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Interrupt Status Clear Register                            */
    
    struct {
      __OM  uint32_t TICLR      : 1;            /*!< [0..0] Transmit Interrupt Clear                                           */
      __OM  uint32_t RICLR      : 1;            /*!< [1..1] Receive Interrupt Clear                                            */
            uint32_t            : 6;
      __OM  uint32_t ERRSYNCLR  : 1;            /*!< [8..8] SYN Error Interrupt Clear                                          */
      __OM  uint32_t EOFSYNCLR  : 1;            /*!< [9..9] End of SYN Byte Interrupt Clear                                    */
            uint32_t            : 22;
    } bit;
  } ISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Baud Rate Control Register                                 */
    
    struct {
      __IOM uint32_t BR_R       : 1;            /*!< [0..0] Baud Rate Generator Enable Bit                                     */
            uint32_t            : 3;
      __IOM uint32_t BR_PRE     : 3;            /*!< [6..4] Prescaler Bit                                                      */
            uint32_t            : 9;
      __IOM uint32_t BG_FD_SEL  : 5;            /*!< [20..16] Fractional Divider Selection                                     */
      __IOM uint32_t BG_BR_VALUE : 11;          /*!< [31..21] Baud Rate Reload Value                                           */
    } bit;
  } BCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) LIN Control Register                                       */
    
    struct {
      __IOM uint32_t BREN       : 1;            /*!< [0..0] Baud Rate Detection Enable                                         */
      __IOM uint32_t BGSEL      : 2;            /*!< [2..1] Baud Rate Select for Detection                                     */
            uint32_t            : 29;
    } bit;
  } LINCON;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) LIN Status Register                                        */
    
    struct {
      __IM  uint32_t BRK        : 1;            /*!< [0..0] Break Field Detection Flag                                         */
            uint32_t            : 31;
    } bit;
  } LINST;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) LIN Status Clear Register                                  */
    
