popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t BRKCLR     : 1;            /*!< [0..0] Break Field Flag Clear                                             */
            uint32_t            : 31;
    } bit;
  } LINSTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) LIN Status Set Register                                    */
    
    struct {
      __OM  uint32_t BRKSET     : 1;            /*!< [0..0] Break Field Flag Set                                               */
            uint32_t            : 31;
    } bit;
  } LINSTS;
} UART0_Type;                                   /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART1 (UART1)
  */

typedef struct {                                /*!< (@ 0x4801C000) UART1 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port Input Select Register                                 */
    
    struct {
      __IOM uint32_t RXDSEL     : 2;            /*!< [1..0] RXD Input Select                                                   */
      __IOM uint32_t TXEVSEL    : 2;            /*!< [3..2] TX Start Event Input Select                                        */
            uint32_t            : 28;
    } bit;
  } INSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Serial Channel Control Register                            */
    
    struct {
      __IOM uint32_t SM0        : 1;            /*!< [0..0] Serial Port Operating Mode Selection                               */
      __IOM uint32_t SM1        : 1;            /*!< [1..1] Serial Port Operating Mode Selection                               */
      __IOM uint32_t SM2        : 1;            /*!< [2..2] Enable Serial Port Multiprocessor Communication in Mode
                                                     2 and 3                                                                   */
      __IOM uint32_t REN        : 1;            /*!< [3..3] Enable Receiver of Serial Port                                     */
      __IOM uint32_t RMOD       : 1;            /*!< [4..4] Receiver Mode                                                      */
      __IOM uint32_t TXINV      : 1;            /*!< [5..5] TX Data Inverter Enable                                            */
            uint32_t            : 2;
      __IOM uint32_t TXENSEL    : 2;            /*!< [9..8] Transmit Start Trigger Select                                      */
            uint32_t            : 22;
    } bit;
  } SCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Transmit Start Register                                    */
    
    struct {
      __OM  uint32_t TXSTART    : 1;            /*!< [0..0] Transmit Start Bit                                                 */
            uint32_t            : 31;
    } bit;
  } TSTART;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Serial TX Data Buffer                                      */
    
    struct {
      __IOM uint32_t TXDATA     : 8;            /*!< [7..0] Serial Interface TxBuffer Register                                 */
      __IOM uint32_t TB8        : 1;            /*!< [8..8] Serial Port Transmitter Bit 9                                      */
            uint32_t            : 23;
    } bit;
  } TXBUF;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) Serial RX Data Buffer                                      */
    
    struct {
      __IM  uint32_t RXDATA     : 8;            /*!< [7..0] Serial Interface RxBuffer Register                                 */
      __IM  uint32_t RB8        : 1;            /*!< [8..8] Serial Port Receiver Bit 9                                         */
            uint32_t            : 23;
    } bit;
  } RXBUF;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32_t TIEN       : 1;            /*!< [0..0] Transmit Interrupt Enable                                          */
      __IOM uint32_t RIEN       : 1;            /*!< [1..1] Receive Interrupt Enable                                           */
            uint32_t            : 6;
      __IOM uint32_t ERRSYNEN   : 1;            /*!< [8..8] SYN Error Interrupt Enable                                         */
      __IOM uint32_t EOFSYNEN   : 1;            /*!< [9..9] End of SYN Byte Interrupt Enable                                   */
            uint32_t            : 22;
    } bit;
  } IEN;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t TI         : 1;            /*!< [0..0] Transmit Buffer Empty Interrupt Flag                               */
      __IM  uint32_t RI         : 1;            /*!< [1..1] Receive Interrupt Flag                                             */
            uint32_t            : 6;
      __IM  uint32_t ERRSYN     : 1;            /*!< [8..8] SYN Error Interrupt Flag                                           */
      __IM  uint32_t EOFSYN     : 1;            /*!< [9..9] End of SYN Byte Interrupt Flag                                     */
            uint32_t            : 22;
    } bit;
  } IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Interrupt Status Set Register                              */
    
