popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
    struct {
      __OM  uint32_t TISET      : 1;            /*!< [0..0] Transmit Interrupt Set                                             */
      __OM  uint32_t RISET      : 1;            /*!< [1..1] Receive Interrupt Set                                              */
            uint32_t            : 6;
      __OM  uint32_t ERRSYNSET  : 1;            /*!< [8..8] SYN Error Interrupt Set                                            */
      __OM  uint32_t EOFSYNSET  : 1;            /*!< [9..9] End of SYN Byte Interrupt Set                                      */
            uint32_t            : 22;
    } bit;
  } ISS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Interrupt Status Clear Register                            */
    
    struct {
      __OM  uint32_t TICLR      : 1;            /*!< [0..0] Transmit Interrupt Clear                                           */
      __OM  uint32_t RICLR      : 1;            /*!< [1..1] Receive Interrupt Clear                                            */
            uint32_t            : 6;
      __OM  uint32_t ERRSYNCLR  : 1;            /*!< [8..8] SYN Error Interrupt Clear                                          */
      __OM  uint32_t EOFSYNCLR  : 1;            /*!< [9..9] End of SYN Byte Interrupt Clear                                    */
            uint32_t            : 22;
    } bit;
  } ISC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Baud Rate Control Register                                 */
    
    struct {
      __IOM uint32_t BR_R       : 1;            /*!< [0..0] Baud Rate Generator Enable Bit                                     */
            uint32_t            : 3;
      __IOM uint32_t BR_PRE     : 3;            /*!< [6..4] Prescaler Bit                                                      */
            uint32_t            : 9;
      __IOM uint32_t BG_FD_SEL  : 5;            /*!< [20..16] Fractional Divider Selection                                     */
      __IOM uint32_t BG_BR_VALUE : 11;          /*!< [31..21] Baud Rate Reload Value                                           */
    } bit;
  } BCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) LIN Control Register                                       */
    
    struct {
      __IOM uint32_t BREN       : 1;            /*!< [0..0] Baud Rate Detection Enable                                         */
      __IOM uint32_t BGSEL      : 2;            /*!< [2..1] Baud Rate Select for Detection                                     */
            uint32_t            : 29;
    } bit;
  } LINCON;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) LIN Status Register                                        */
    
    struct {
      __IM  uint32_t BRK        : 1;            /*!< [0..0] Break Field Detection Flag                                         */
            uint32_t            : 31;
    } bit;
  } LINST;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) LIN Status Clear Register                                  */
    
    struct {
      __OM  uint32_t BRKCLR     : 1;            /*!< [0..0] Break Field Flag Clear                                             */
            uint32_t            : 31;
    } bit;
  } LINSTC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) LIN Status Set Register                                    */
    
    struct {
      __OM  uint32_t BRKSET     : 1;            /*!< [0..0] Break Field Flag Set                                               */
            uint32_t            : 31;
    } bit;
  } LINSTS;
} UART1_Type;                                   /*!< Size = 56 (0x38)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define ADC1_BASE                   0x40000000UL
#define ADC2_BASE                   0x4804C000UL
#define ARVG_BASE                   0x48038000UL
#define BDRV_BASE                   0x4000C000UL
#define CACHE_BASE                  0x48048000UL
#define CANNODE_BASE                0x48010000UL
#define CANNODEFD_BASE              0x48010010UL
#define CANMSGOBJ0_BASE             0x48010100UL
#define CANMSGOBJ1_BASE             0x48010400UL
#define CANMSGOBJ2_BASE             0x48010800UL
#define CANTRX_BASE                 0x4800C000UL
#define CCU7_BASE                   0x40008000UL
#define CPU_BASE                    0xE000E000UL
#define CSACSC_BASE                 0x40010000UL
#define DMA_BASE                    0x48034000UL
#define GPIO_BASE                   0x48030000UL
#define GPT12_BASE                  0x40014000UL
#define MEMCTRL_BASE                0x48044000UL
#define PLL_BASE                    0x48008000UL
#define PMU_BASE                    0x48000000UL
#define SCU_BASE                    0x48004000UL
#define SDADC_BASE                  0x40004000UL
#define SSC0_BASE                   0x48020000UL
#define SSC1_BASE                   0x48024000UL
#define T20_BASE                    0x48028000UL
#define T21_BASE                    0x4802C000UL
#define UART0_BASE                  0x48018000UL
#define UART1_BASE                  0x4801C000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#ifndef UNIT_TESTING_OCN                                                                                                   
#define ADC1                        ((ADC1_Type*)              ADC1_BASE)
#define ADC2                        ((ADC2_Type*)              ADC2_BASE)
#define ARVG                        ((ARVG_Type*)              ARVG_BASE)
#define BDRV                        ((BDRV_Type*)              BDRV_BASE)
#define CACHE                       ((CACHE_Type*)             CACHE_BASE)
#define CANNODE                     ((CANNODE_Type*)           CANNODE_BASE)
#define CANNODEFD                   ((CANNODEFD_Type*)         CANNODEFD_BASE)
#define CANMSGOBJ0                  ((CANMSGOBJ0_Type*)        CANMSGOBJ0_BASE)
#define CANMSGOBJ1                  ((CANMSGOBJ1_Type*)        CANMSGOBJ1_BASE)
#define CANMSGOBJ2                  ((CANMSGOBJ2_Type*)        CANMSGOBJ2_BASE)
#define CANTRX                      ((CANTRX_Type*)            CANTRX_BASE)
#define CCU7                        ((CCU7_Type*)              CCU7_BASE)
#define CPU                         ((CPU_Type*)               CPU_BASE)
#define CSACSC                      ((CSACSC_Type*)            CSACSC_BASE)
#define DMA                         ((DMA_Type*)               DMA_BASE)
#define GPIO                        ((GPIO_Type*)              GPIO_BASE)
#define GPT12                       ((GPT12_Type*)             GPT12_BASE)
#define MEMCTRL                     ((MEMCTRL_Type*)           MEMCTRL_BASE)
#define PLL                         ((PLL_Type*)               PLL_BASE)
#define PMU                         ((PMU_Type*)               PMU_BASE)
#define SCU                         ((SCU_Type*)               SCU_BASE)
#define SDADC                       ((SDADC_Type*)             SDADC_BASE)
#define SSC0                        ((SSC0_Type*)              SSC0_BASE)
#define SSC1                        ((SSC1_Type*)              SSC1_BASE)
#define T20                         ((T20_Type*)               T20_BASE)
#define T21                         ((T21_Type*)               T21_BASE)
#define UART0                       ((UART0_Type*)             UART0_BASE)
#define UART1                       ((UART1_Type*)             UART1_BASE)
#else
  extern ADC1_Type*         ADC1;
  extern ADC2_Type*         ADC2;
  extern ARVG_Type*         ARVG;
  extern BDRV_Type*         BDRV;
  extern CACHE_Type*        CACHE;
  extern CANTRX_Type*       CANTRX;
  extern CANNODE_Type*      CANNODE;
  extern CANNODEFD_Type*    CANNODEFD;
  extern CANMSGOBJ0_Type*   CANMSGOBJ0;
  extern CANMSGOBJ1_Type*   CANMSGOBJ1;
  extern CANMSGOBJ2_Type*   CANMSGOBJ2;
  extern CCU7_Type*         CCU7;
  extern CPU_Type*          CPU;
  extern CSACSC_Type*       CSACSC;
  extern DMA_Type*          DMA;
  extern GPIO_Type*         GPIO;
  extern GPT12_Type*        GPT12;
  extern MEMCTRL_Type*      MEMCTRL;
  extern PLL_Type*          PLL;
  extern PMU_Type*          PMU;
  extern SCU_Type*          SCU;
  extern SDADC_Type*        SDADC;
  extern SSC0_Type*         SSC0;
  extern SSC1_Type*         SSC1;
  extern T20_Type*          T20;
  extern T21_Type*          T21;
  extern UART0_Type*        UART0;
  extern UART1_Type*        UART1;
#endif /* UNIT_TESTING_OCN */     
/** @} */ /* End of group Device_Peripheral_declaration */

/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */


/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  GLOBCONF  ======================================================== */
#define ADC1_GLOBCONF_EN_Pos              (0UL)                     /*!< EN (Bit 0)                                            */
#define ADC1_GLOBCONF_EN_Msk              (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  INP0  ========================================================== */
#define ADC1_INP0_INP_CH0_Pos             (0UL)                     /*!< INP_CH0 (Bit 0)                                       */
#define ADC1_INP0_INP_CH0_Msk             (0x3UL)                   /*!< INP_CH0 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH1_Pos             (2UL)                     /*!< INP_CH1 (Bit 2)                                       */
#define ADC1_INP0_INP_CH1_Msk             (0xcUL)                   /*!< INP_CH1 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH2_Pos             (4UL)                     /*!< INP_CH2 (Bit 4)                                       */
#define ADC1_INP0_INP_CH2_Msk             (0x30UL)                  /*!< INP_CH2 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH3_Pos             (6UL)                     /*!< INP_CH3 (Bit 6)                                       */
#define ADC1_INP0_INP_CH3_Msk             (0xc0UL)                  /*!< INP_CH3 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH4_Pos             (8UL)                     /*!< INP_CH4 (Bit 8)                                       */
#define ADC1_INP0_INP_CH4_Msk             (0x300UL)                 /*!< INP_CH4 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH5_Pos             (10UL)                    /*!< INP_CH5 (Bit 10)                                      */
#define ADC1_INP0_INP_CH5_Msk             (0xc00UL)                 /*!< INP_CH5 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH6_Pos             (12UL)                    /*!< INP_CH6 (Bit 12)                                      */
#define ADC1_INP0_INP_CH6_Msk             (0x3000UL)                /*!< INP_CH6 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH7_Pos             (14UL)                    /*!< INP_CH7 (Bit 14)                                      */
#define ADC1_INP0_INP_CH7_Msk             (0xc000UL)                /*!< INP_CH7 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH8_Pos             (16UL)                    /*!< INP_CH8 (Bit 16)                                      */
#define ADC1_INP0_INP_CH8_Msk             (0x30000UL)               /*!< INP_CH8 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH9_Pos             (18UL)                    /*!< INP_CH9 (Bit 18)                                      */
#define ADC1_INP0_INP_CH9_Msk             (0xc0000UL)               /*!< INP_CH9 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP0_INP_CH10_Pos            (20UL)                    /*!< INP_CH10 (Bit 20)                                     */
#define ADC1_INP0_INP_CH10_Msk            (0x300000UL)              /*!< INP_CH10 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP0_INP_CH11_Pos            (22UL)                    /*!< INP_CH11 (Bit 22)                                     */
#define ADC1_INP0_INP_CH11_Msk            (0xc00000UL)              /*!< INP_CH11 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP0_INP_CH12_Pos            (24UL)                    /*!< INP_CH12 (Bit 24)                                     */
#define ADC1_INP0_INP_CH12_Msk            (0x3000000UL)             /*!< INP_CH12 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP0_INP_CH13_Pos            (26UL)                    /*!< INP_CH13 (Bit 26)                                     */
#define ADC1_INP0_INP_CH13_Msk            (0xc000000UL)             /*!< INP_CH13 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP0_INP_CH14_Pos            (28UL)                    /*!< INP_CH14 (Bit 28)                                     */
#define ADC1_INP0_INP_CH14_Msk            (0x30000000UL)            /*!< INP_CH14 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP0_INP_CH15_Pos            (30UL)                    /*!< INP_CH15 (Bit 30)                                     */
#define ADC1_INP0_INP_CH15_Msk            (0xc0000000UL)            /*!< INP_CH15 (Bitfield-Mask: 0x03)                        */
/* =========================================================  INP1  ========================================================== */
#define ADC1_INP1_INP_CH16_Pos            (0UL)                     /*!< INP_CH16 (Bit 0)                                      */
#define ADC1_INP1_INP_CH16_Msk            (0x3UL)                   /*!< INP_CH16 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP1_INP_CH17_Pos            (2UL)                     /*!< INP_CH17 (Bit 2)                                      */
#define ADC1_INP1_INP_CH17_Msk            (0xcUL)                   /*!< INP_CH17 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP1_INP_CH18_Pos            (4UL)                     /*!< INP_CH18 (Bit 4)                                      */
#define ADC1_INP1_INP_CH18_Msk            (0x30UL)                  /*!< INP_CH18 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP1_INP_CH19_Pos            (6UL)                     /*!< INP_CH19 (Bit 6)                                      */
#define ADC1_INP1_INP_CH19_Msk            (0xc0UL)                  /*!< INP_CH19 (Bitfield-Mask: 0x03)                        */
/* =========================================================  INP2  ========================================================== */
#define ADC1_INP2_INP_CMP_LO0_Pos         (0UL)                     /*!< INP_CMP_LO0 (Bit 0)                                   */
#define ADC1_INP2_INP_CMP_LO0_Msk         (0x3UL)                   /*!< INP_CMP_LO0 (Bitfield-Mask: 0x03)                     */
#define ADC1_INP2_INP_CMP_LO1_Pos         (2UL)                     /*!< INP_CMP_LO1 (Bit 2)                                   */
#define ADC1_INP2_INP_CMP_LO1_Msk         (0xcUL)                   /*!< INP_CMP_LO1 (Bitfield-Mask: 0x03)                     */
#define ADC1_INP2_INP_CMP_LO2_Pos         (4UL)                     /*!< INP_CMP_LO2 (Bit 4)                                   */
#define ADC1_INP2_INP_CMP_LO2_Msk         (0x30UL)                  /*!< INP_CMP_LO2 (Bitfield-Mask: 0x03)                     */
#define ADC1_INP2_INP_CMP_LO3_Pos         (6UL)                     /*!< INP_CMP_LO3 (Bit 6)                                   */
#define ADC1_INP2_INP_CMP_LO3_Msk         (0xc0UL)                  /*!< INP_CMP_LO3 (Bitfield-Mask: 0x03)                     */
#define ADC1_INP2_INP_CMP_UP0_Pos         (8UL)                     /*!< INP_CMP_UP0 (Bit 8)                                   */
#define ADC1_INP2_INP_CMP_UP0_Msk         (0x300UL)                 /*!< INP_CMP_UP0 (Bitfield-Mask: 0x03)                     */
#define ADC1_INP2_INP_CMP_UP1_Pos         (10UL)                    /*!< INP_CMP_UP1 (Bit 10)                                  */
#define ADC1_INP2_INP_CMP_UP1_Msk         (0xc00UL)                 /*!< INP_CMP_UP1 (Bitfield-Mask: 0x03)                     */
#define ADC1_INP2_INP_CMP_UP2_Pos         (12UL)                    /*!< INP_CMP_UP2 (Bit 12)                                  */
#define ADC1_INP2_INP_CMP_UP2_Msk         (0x3000UL)                /*!< INP_CMP_UP2 (Bitfield-Mask: 0x03)                     */
#define ADC1_INP2_INP_CMP_UP3_Pos         (14UL)                    /*!< INP_CMP_UP3 (Bit 14)                                  */
#define ADC1_INP2_INP_CMP_UP3_Msk         (0xc000UL)                /*!< INP_CMP_UP3 (Bitfield-Mask: 0x03)                     */
/* =========================================================  INP3  ========================================================== */
#define ADC1_INP3_INP_SQ0_Pos             (0UL)                     /*!< INP_SQ0 (Bit 0)                                       */
#define ADC1_INP3_INP_SQ0_Msk             (0x3UL)                   /*!< INP_SQ0 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP3_INP_SQ1_Pos             (2UL)                     /*!< INP_SQ1 (Bit 2)                                       */
#define ADC1_INP3_INP_SQ1_Msk             (0xcUL)                   /*!< INP_SQ1 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP3_INP_SQ2_Pos             (4UL)                     /*!< INP_SQ2 (Bit 4)                                       */
#define ADC1_INP3_INP_SQ2_Msk             (0x30UL)                  /*!< INP_SQ2 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP3_INP_SQ3_Pos             (6UL)                     /*!< INP_SQ3 (Bit 6)                                       */
#define ADC1_INP3_INP_SQ3_Msk             (0xc0UL)                  /*!< INP_SQ3 (Bitfield-Mask: 0x03)                         */
#define ADC1_INP3_INP_COLL0_Pos           (8UL)                     /*!< INP_COLL0 (Bit 8)                                     */
#define ADC1_INP3_INP_COLL0_Msk           (0x300UL)                 /*!< INP_COLL0 (Bitfield-Mask: 0x03)                       */
#define ADC1_INP3_INP_COLL1_Pos           (10UL)                    /*!< INP_COLL1 (Bit 10)                                    */
#define ADC1_INP3_INP_COLL1_Msk           (0xc00UL)                 /*!< INP_COLL1 (Bitfield-Mask: 0x03)                       */
#define ADC1_INP3_INP_COLL2_Pos           (12UL)                    /*!< INP_COLL2 (Bit 12)                                    */
#define ADC1_INP3_INP_COLL2_Msk           (0x3000UL)                /*!< INP_COLL2 (Bitfield-Mask: 0x03)                       */
#define ADC1_INP3_INP_COLL3_Pos           (14UL)                    /*!< INP_COLL3 (Bit 14)                                    */
#define ADC1_INP3_INP_COLL3_Msk           (0xc000UL)                /*!< INP_COLL3 (Bitfield-Mask: 0x03)                       */
#define ADC1_INP3_INP_WFR0_Pos            (16UL)                    /*!< INP_WFR0 (Bit 16)                                     */
#define ADC1_INP3_INP_WFR0_Msk            (0x30000UL)               /*!< INP_WFR0 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP3_INP_WFR1_Pos            (18UL)                    /*!< INP_WFR1 (Bit 18)                                     */
#define ADC1_INP3_INP_WFR1_Msk            (0xc0000UL)               /*!< INP_WFR1 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP3_INP_WFR2_Pos            (20UL)                    /*!< INP_WFR2 (Bit 20)                                     */
#define ADC1_INP3_INP_WFR2_Msk            (0x300000UL)              /*!< INP_WFR2 (Bitfield-Mask: 0x03)                        */
#define ADC1_INP3_INP_WFR3_Pos            (22UL)                    /*!< INP_WFR3 (Bit 22)                                     */
#define ADC1_INP3_INP_WFR3_Msk            (0xc00000UL)              /*!< INP_WFR3 (Bitfield-Mask: 0x03)                        */

/* =========================================================================================================================== */
/* ================                                           ADC2                                            ================ */
/* =========================================================================================================================== */

