popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
/* ========================================================  FILTCFG  ======================================================== */
#define ADC2_FILTCFG_COEF_A6_Pos          (24UL)                    /*!< COEF_A6 (Bit 24)                                      */
#define ADC2_FILTCFG_COEF_A6_Msk          (0x3000000UL)             /*!< COEF_A6 (Bitfield-Mask: 0x03)                         */
#define ADC2_FILTCFG_COEF_A7_Pos          (28UL)                    /*!< COEF_A7 (Bit 28)                                      */
#define ADC2_FILTCFG_COEF_A7_Msk          (0x30000000UL)            /*!< COEF_A7 (Bitfield-Mask: 0x03)                         */
/* =======================================================  GLOBCONF  ======================================================== */
#define ADC2_GLOBCONF_EN_Pos              (0UL)                     /*!< EN (Bit 0)                                            */
#define ADC2_GLOBCONF_EN_Msk              (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  INP0  ========================================================== */
#define ADC2_INP0_INP_CH0_Pos             (0UL)                     /*!< INP_CH0 (Bit 0)                                       */
#define ADC2_INP0_INP_CH0_Msk             (0x3UL)                   /*!< INP_CH0 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH1_Pos             (2UL)                     /*!< INP_CH1 (Bit 2)                                       */
#define ADC2_INP0_INP_CH1_Msk             (0xcUL)                   /*!< INP_CH1 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH2_Pos             (4UL)                     /*!< INP_CH2 (Bit 4)                                       */
#define ADC2_INP0_INP_CH2_Msk             (0x30UL)                  /*!< INP_CH2 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH3_Pos             (6UL)                     /*!< INP_CH3 (Bit 6)                                       */
#define ADC2_INP0_INP_CH3_Msk             (0xc0UL)                  /*!< INP_CH3 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH4_Pos             (8UL)                     /*!< INP_CH4 (Bit 8)                                       */
#define ADC2_INP0_INP_CH4_Msk             (0x300UL)                 /*!< INP_CH4 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH5_Pos             (10UL)                    /*!< INP_CH5 (Bit 10)                                      */
#define ADC2_INP0_INP_CH5_Msk             (0xc00UL)                 /*!< INP_CH5 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH6_Pos             (12UL)                    /*!< INP_CH6 (Bit 12)                                      */
#define ADC2_INP0_INP_CH6_Msk             (0x3000UL)                /*!< INP_CH6 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH7_Pos             (14UL)                    /*!< INP_CH7 (Bit 14)                                      */
#define ADC2_INP0_INP_CH7_Msk             (0xc000UL)                /*!< INP_CH7 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH8_Pos             (16UL)                    /*!< INP_CH8 (Bit 16)                                      */
#define ADC2_INP0_INP_CH8_Msk             (0x30000UL)               /*!< INP_CH8 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH9_Pos             (18UL)                    /*!< INP_CH9 (Bit 18)                                      */
#define ADC2_INP0_INP_CH9_Msk             (0xc0000UL)               /*!< INP_CH9 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP0_INP_CH10_Pos            (20UL)                    /*!< INP_CH10 (Bit 20)                                     */
#define ADC2_INP0_INP_CH10_Msk            (0x300000UL)              /*!< INP_CH10 (Bitfield-Mask: 0x03)                        */
#define ADC2_INP0_INP_CH11_Pos            (22UL)                    /*!< INP_CH11 (Bit 22)                                     */
#define ADC2_INP0_INP_CH11_Msk            (0xc00000UL)              /*!< INP_CH11 (Bitfield-Mask: 0x03)                        */
#define ADC2_INP0_INP_CH12_Pos            (24UL)                    /*!< INP_CH12 (Bit 24)                                     */
#define ADC2_INP0_INP_CH12_Msk            (0x3000000UL)             /*!< INP_CH12 (Bitfield-Mask: 0x03)                        */
#define ADC2_INP0_INP_CH13_Pos            (26UL)                    /*!< INP_CH13 (Bit 26)                                     */
#define ADC2_INP0_INP_CH13_Msk            (0xc000000UL)             /*!< INP_CH13 (Bitfield-Mask: 0x03)                        */
#define ADC2_INP0_INP_CH14_Pos            (28UL)                    /*!< INP_CH14 (Bit 28)                                     */
#define ADC2_INP0_INP_CH14_Msk            (0x30000000UL)            /*!< INP_CH14 (Bitfield-Mask: 0x03)                        */
/* =========================================================  INP2  ========================================================== */
#define ADC2_INP2_INP_CMP_LO0_Pos         (0UL)                     /*!< INP_CMP_LO0 (Bit 0)                                   */
#define ADC2_INP2_INP_CMP_LO0_Msk         (0x3UL)                   /*!< INP_CMP_LO0 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_LO1_Pos         (2UL)                     /*!< INP_CMP_LO1 (Bit 2)                                   */
#define ADC2_INP2_INP_CMP_LO1_Msk         (0xcUL)                   /*!< INP_CMP_LO1 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_LO2_Pos         (4UL)                     /*!< INP_CMP_LO2 (Bit 4)                                   */
#define ADC2_INP2_INP_CMP_LO2_Msk         (0x30UL)                  /*!< INP_CMP_LO2 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_LO3_Pos         (6UL)                     /*!< INP_CMP_LO3 (Bit 6)                                   */
#define ADC2_INP2_INP_CMP_LO3_Msk         (0xc0UL)                  /*!< INP_CMP_LO3 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_LO4_Pos         (8UL)                     /*!< INP_CMP_LO4 (Bit 8)                                   */
#define ADC2_INP2_INP_CMP_LO4_Msk         (0x300UL)                 /*!< INP_CMP_LO4 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_LO5_Pos         (10UL)                    /*!< INP_CMP_LO5 (Bit 10)                                  */
#define ADC2_INP2_INP_CMP_LO5_Msk         (0xc00UL)                 /*!< INP_CMP_LO5 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_LO6_Pos         (12UL)                    /*!< INP_CMP_LO6 (Bit 12)                                  */
#define ADC2_INP2_INP_CMP_LO6_Msk         (0x3000UL)                /*!< INP_CMP_LO6 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_LO7_Pos         (14UL)                    /*!< INP_CMP_LO7 (Bit 14)                                  */
#define ADC2_INP2_INP_CMP_LO7_Msk         (0xc000UL)                /*!< INP_CMP_LO7 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP0_Pos         (16UL)                    /*!< INP_CMP_UP0 (Bit 16)                                  */
#define ADC2_INP2_INP_CMP_UP0_Msk         (0x30000UL)               /*!< INP_CMP_UP0 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP1_Pos         (18UL)                    /*!< INP_CMP_UP1 (Bit 18)                                  */
#define ADC2_INP2_INP_CMP_UP1_Msk         (0xc0000UL)               /*!< INP_CMP_UP1 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP2_Pos         (20UL)                    /*!< INP_CMP_UP2 (Bit 20)                                  */
#define ADC2_INP2_INP_CMP_UP2_Msk         (0x300000UL)              /*!< INP_CMP_UP2 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP3_Pos         (22UL)                    /*!< INP_CMP_UP3 (Bit 22)                                  */
#define ADC2_INP2_INP_CMP_UP3_Msk         (0xc00000UL)              /*!< INP_CMP_UP3 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP4_Pos         (24UL)                    /*!< INP_CMP_UP4 (Bit 24)                                  */
#define ADC2_INP2_INP_CMP_UP4_Msk         (0x3000000UL)             /*!< INP_CMP_UP4 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP5_Pos         (26UL)                    /*!< INP_CMP_UP5 (Bit 26)                                  */
#define ADC2_INP2_INP_CMP_UP5_Msk         (0xc000000UL)             /*!< INP_CMP_UP5 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP6_Pos         (28UL)                    /*!< INP_CMP_UP6 (Bit 28)                                  */
#define ADC2_INP2_INP_CMP_UP6_Msk         (0x30000000UL)            /*!< INP_CMP_UP6 (Bitfield-Mask: 0x03)                     */
#define ADC2_INP2_INP_CMP_UP7_Pos         (30UL)                    /*!< INP_CMP_UP7 (Bit 30)                                  */
#define ADC2_INP2_INP_CMP_UP7_Msk         (0xc0000000UL)            /*!< INP_CMP_UP7 (Bitfield-Mask: 0x03)                     */
/* =========================================================  INP3  ========================================================== */
#define ADC2_INP3_INP_SQ0_Pos             (0UL)                     /*!< INP_SQ0 (Bit 0)                                       */
#define ADC2_INP3_INP_SQ0_Msk             (0x3UL)                   /*!< INP_SQ0 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP3_INP_SQ1_Pos             (2UL)                     /*!< INP_SQ1 (Bit 2)                                       */
#define ADC2_INP3_INP_SQ1_Msk             (0xcUL)                   /*!< INP_SQ1 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP3_INP_SQ2_Pos             (4UL)                     /*!< INP_SQ2 (Bit 4)                                       */
#define ADC2_INP3_INP_SQ2_Msk             (0x30UL)                  /*!< INP_SQ2 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP3_INP_SQ3_Pos             (6UL)                     /*!< INP_SQ3 (Bit 6)                                       */
#define ADC2_INP3_INP_SQ3_Msk             (0xc0UL)                  /*!< INP_SQ3 (Bitfield-Mask: 0x03)                         */
#define ADC2_INP3_INP_COLL0_Pos           (8UL)                     /*!< INP_COLL0 (Bit 8)                                     */
#define ADC2_INP3_INP_COLL0_Msk           (0x300UL)                 /*!< INP_COLL0 (Bitfield-Mask: 0x03)                       */
#define ADC2_INP3_INP_COLL1_Pos           (10UL)                    /*!< INP_COLL1 (Bit 10)                                    */
#define ADC2_INP3_INP_COLL1_Msk           (0xc00UL)                 /*!< INP_COLL1 (Bitfield-Mask: 0x03)                       */
#define ADC2_INP3_INP_COLL2_Pos           (12UL)                    /*!< INP_COLL2 (Bit 12)                                    */
#define ADC2_INP3_INP_COLL2_Msk           (0x3000UL)                /*!< INP_COLL2 (Bitfield-Mask: 0x03)                       */
#define ADC2_INP3_INP_COLL3_Pos           (14UL)                    /*!< INP_COLL3 (Bit 14)                                    */
#define ADC2_INP3_INP_COLL3_Msk           (0xc000UL)                /*!< INP_COLL3 (Bitfield-Mask: 0x03)                       */

/* =========================================================================================================================== */
/* ================                                           BDRV                                            ================ */
/* =========================================================================================================================== */

