popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
/* ========================================================  CP_CTRL  ======================================================== */
#define BDRV_CP_CTRL_CP_RDY_EN_Pos        (2UL)                     /*!< CP_RDY_EN (Bit 2)                                     */
#define BDRV_CP_CTRL_CP_RDY_EN_Msk        (0x4UL)                   /*!< CP_RDY_EN (Bitfield-Mask: 0x01)                       */
#define BDRV_CP_CTRL_CP_1STAGE_Pos        (16UL)                    /*!< CP_1STAGE (Bit 16)                                    */
#define BDRV_CP_CTRL_CP_1STAGE_Msk        (0x10000UL)               /*!< CP_1STAGE (Bitfield-Mask: 0x01)                       */

/* =========================================================================================================================== */
/* ================                                         CANCONTR                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  CAN_NIPR0  ======================================================= */
#define CANCONTR_CAN_NIPR0_ALINP_Pos      (0UL)                     /*!< ALINP (Bit 0)                                         */
#define CANCONTR_CAN_NIPR0_ALINP_Msk      (0xfUL)                   /*!< ALINP (Bitfield-Mask: 0x0f)                           */
#define CANCONTR_CAN_NIPR0_LECINP_Pos     (4UL)                     /*!< LECINP (Bit 4)                                        */
#define CANCONTR_CAN_NIPR0_LECINP_Msk     (0xf0UL)                  /*!< LECINP (Bitfield-Mask: 0x0f)                          */
#define CANCONTR_CAN_NIPR0_TRINP_Pos      (8UL)                     /*!< TRINP (Bit 8)                                         */
#define CANCONTR_CAN_NIPR0_TRINP_Msk      (0xf00UL)                 /*!< TRINP (Bitfield-Mask: 0x0f)                           */
#define CANCONTR_CAN_NIPR0_CFCINP_Pos     (12UL)                    /*!< CFCINP (Bit 12)                                       */
#define CANCONTR_CAN_NIPR0_CFCINP_Msk     (0xf000UL)                /*!< CFCINP (Bitfield-Mask: 0x0f)                          */

/* =========================================================================================================================== */
/* ================                                          CANTRX                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define CANTRX_CTRL_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define CANTRX_CTRL_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */

/* =========================================================================================================================== */
/* ================                                           CCU7                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CMPSTAT  ======================================================== */
#define CCU7_CMPSTAT_CCPOS0_Pos           (3UL)                     /*!< CCPOS0 (Bit 3)                                        */
#define CCU7_CMPSTAT_CCPOS0_Msk           (0x8UL)                   /*!< CCPOS0 (Bitfield-Mask: 0x01)                          */
#define CCU7_CMPSTAT_CCPOS1_Pos           (4UL)                     /*!< CCPOS1 (Bit 4)                                        */
#define CCU7_CMPSTAT_CCPOS1_Msk           (0x10UL)                  /*!< CCPOS1 (Bitfield-Mask: 0x01)                          */
#define CCU7_CMPSTAT_CCPOS2_Pos           (5UL)                     /*!< CCPOS2 (Bit 5)                                        */
#define CCU7_CMPSTAT_CCPOS2_Msk           (0x20UL)                  /*!< CCPOS2 (Bitfield-Mask: 0x01)                          */
/* ==========================================================  INP  ========================================================== */
#define CCU7_INP_INPCC70_Pos              (0UL)                     /*!< INPCC70 (Bit 0)                                       */
#define CCU7_INP_INPCC70_Msk              (0x3UL)                   /*!< INPCC70 (Bitfield-Mask: 0x03)                         */
#define CCU7_INP_INPCC71_Pos              (2UL)                     /*!< INPCC71 (Bit 2)                                       */
#define CCU7_INP_INPCC71_Msk              (0xcUL)                   /*!< INPCC71 (Bitfield-Mask: 0x03)                         */
#define CCU7_INP_INPCC72_Pos              (4UL)                     /*!< INPCC72 (Bit 4)                                       */
#define CCU7_INP_INPCC72_Msk              (0x30UL)                  /*!< INPCC72 (Bitfield-Mask: 0x03)                         */
#define CCU7_INP_INPCHE_Pos               (6UL)                     /*!< INPCHE (Bit 6)                                        */
#define CCU7_INP_INPCHE_Msk               (0xc0UL)                  /*!< INPCHE (Bitfield-Mask: 0x03)                          */
#define CCU7_INP_INPERR_Pos               (8UL)                     /*!< INPERR (Bit 8)                                        */
#define CCU7_INP_INPERR_Msk               (0x300UL)                 /*!< INPERR (Bitfield-Mask: 0x03)                          */
#define CCU7_INP_INPT12_Pos               (10UL)                    /*!< INPT12 (Bit 10)                                       */
#define CCU7_INP_INPT12_Msk               (0xc00UL)                 /*!< INPT12 (Bitfield-Mask: 0x03)                          */
#define CCU7_INP_INPT13_Pos               (12UL)                    /*!< INPT13 (Bit 12)                                       */
#define CCU7_INP_INPT13_Msk               (0x3000UL)                /*!< INPT13 (Bitfield-Mask: 0x03)                          */
/* =========================================================  INP_2  ========================================================= */
#define CCU7_INP_2_INPCC70B_Pos           (0UL)                     /*!< INPCC70B (Bit 0)                                      */
#define CCU7_INP_2_INPCC70B_Msk           (0x3UL)                   /*!< INPCC70B (Bitfield-Mask: 0x03)                        */
#define CCU7_INP_2_INPCC71B_Pos           (2UL)                     /*!< INPCC71B (Bit 2)                                      */
#define CCU7_INP_2_INPCC71B_Msk           (0xcUL)                   /*!< INPCC71B (Bitfield-Mask: 0x03)                        */
#define CCU7_INP_2_INPCC72B_Pos           (4UL)                     /*!< INPCC72B (Bit 4)                                      */
#define CCU7_INP_2_INPCC72B_Msk           (0x30UL)                  /*!< INPCC72B (Bitfield-Mask: 0x03)                        */
#define CCU7_INP_2_INPT14_Pos             (8UL)                     /*!< INPT14 (Bit 8)                                        */
#define CCU7_INP_2_INPT14_Msk             (0x300UL)                 /*!< INPT14 (Bitfield-Mask: 0x03)                          */
#define CCU7_INP_2_INPT15_Pos             (10UL)                    /*!< INPT15 (Bit 10)                                       */
#define CCU7_INP_2_INPT15_Msk             (0xc00UL)                 /*!< INPT15 (Bitfield-Mask: 0x03)                          */
#define CCU7_INP_2_INPT16_Pos             (12UL)                    /*!< INPT16 (Bit 12)                                       */
#define CCU7_INP_2_INPT16_Msk             (0x3000UL)                /*!< INPT16 (Bitfield-Mask: 0x03)                          */
/* ==========================================================  LI  =========================================================== */
#define CCU7_LI_INPLBE_Pos                (14UL)                    /*!< INPLBE (Bit 14)                                       */
#define CCU7_LI_INPLBE_Msk                (0xc000UL)                /*!< INPLBE (Bitfield-Mask: 0x03)                          */

/* =========================================================================================================================== */
/* ================                                            CPU                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  NVIC_ISER  ======================================================= */
#define CPU_NVIC_ISER_IRQEN0_Pos          (0UL)                     /*!< IRQEN0 (Bit 0)                                        */
#define CPU_NVIC_ISER_IRQEN0_Msk          (0x1UL)                   /*!< IRQEN0 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN1_Pos          (1UL)                     /*!< IRQEN1 (Bit 1)                                        */
#define CPU_NVIC_ISER_IRQEN1_Msk          (0x2UL)                   /*!< IRQEN1 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN2_Pos          (2UL)                     /*!< IRQEN2 (Bit 2)                                        */
#define CPU_NVIC_ISER_IRQEN2_Msk          (0x4UL)                   /*!< IRQEN2 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN3_Pos          (3UL)                     /*!< IRQEN3 (Bit 3)                                        */
#define CPU_NVIC_ISER_IRQEN3_Msk          (0x8UL)                   /*!< IRQEN3 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN4_Pos          (4UL)                     /*!< IRQEN4 (Bit 4)                                        */
#define CPU_NVIC_ISER_IRQEN4_Msk          (0x10UL)                  /*!< IRQEN4 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN5_Pos          (5UL)                     /*!< IRQEN5 (Bit 5)                                        */
#define CPU_NVIC_ISER_IRQEN5_Msk          (0x20UL)                  /*!< IRQEN5 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN6_Pos          (6UL)                     /*!< IRQEN6 (Bit 6)                                        */
#define CPU_NVIC_ISER_IRQEN6_Msk          (0x40UL)                  /*!< IRQEN6 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN7_Pos          (7UL)                     /*!< IRQEN7 (Bit 7)                                        */
#define CPU_NVIC_ISER_IRQEN7_Msk          (0x80UL)                  /*!< IRQEN7 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN8_Pos          (8UL)                     /*!< IRQEN8 (Bit 8)                                        */
#define CPU_NVIC_ISER_IRQEN8_Msk          (0x100UL)                 /*!< IRQEN8 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN9_Pos          (9UL)                     /*!< IRQEN9 (Bit 9)                                        */
#define CPU_NVIC_ISER_IRQEN9_Msk          (0x200UL)                 /*!< IRQEN9 (Bitfield-Mask: 0x01)                          */
#define CPU_NVIC_ISER_IRQEN10_Pos         (10UL)                    /*!< IRQEN10 (Bit 10)                                      */
#define CPU_NVIC_ISER_IRQEN10_Msk         (0x400UL)                 /*!< IRQEN10 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN11_Pos         (11UL)                    /*!< IRQEN11 (Bit 11)                                      */
#define CPU_NVIC_ISER_IRQEN11_Msk         (0x800UL)                 /*!< IRQEN11 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN12_Pos         (12UL)                    /*!< IRQEN12 (Bit 12)                                      */
#define CPU_NVIC_ISER_IRQEN12_Msk         (0x1000UL)                /*!< IRQEN12 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN13_Pos         (13UL)                    /*!< IRQEN13 (Bit 13)                                      */
#define CPU_NVIC_ISER_IRQEN13_Msk         (0x2000UL)                /*!< IRQEN13 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN14_Pos         (14UL)                    /*!< IRQEN14 (Bit 14)                                      */
#define CPU_NVIC_ISER_IRQEN14_Msk         (0x4000UL)                /*!< IRQEN14 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN15_Pos         (15UL)                    /*!< IRQEN15 (Bit 15)                                      */
#define CPU_NVIC_ISER_IRQEN15_Msk         (0x8000UL)                /*!< IRQEN15 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN16_Pos         (16UL)                    /*!< IRQEN16 (Bit 16)                                      */
#define CPU_NVIC_ISER_IRQEN16_Msk         (0x10000UL)               /*!< IRQEN16 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN17_Pos         (17UL)                    /*!< IRQEN17 (Bit 17)                                      */
#define CPU_NVIC_ISER_IRQEN17_Msk         (0x20000UL)               /*!< IRQEN17 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN18_Pos         (18UL)                    /*!< IRQEN18 (Bit 18)                                      */
#define CPU_NVIC_ISER_IRQEN18_Msk         (0x40000UL)               /*!< IRQEN18 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN19_Pos         (19UL)                    /*!< IRQEN19 (Bit 19)                                      */
#define CPU_NVIC_ISER_IRQEN19_Msk         (0x80000UL)               /*!< IRQEN19 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN20_Pos         (20UL)                    /*!< IRQEN20 (Bit 20)                                      */
#define CPU_NVIC_ISER_IRQEN20_Msk         (0x100000UL)              /*!< IRQEN20 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN21_Pos         (21UL)                    /*!< IRQEN21 (Bit 21)                                      */
#define CPU_NVIC_ISER_IRQEN21_Msk         (0x200000UL)              /*!< IRQEN21 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN22_Pos         (22UL)                    /*!< IRQEN22 (Bit 22)                                      */
#define CPU_NVIC_ISER_IRQEN22_Msk         (0x400000UL)              /*!< IRQEN22 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN23_Pos         (23UL)                    /*!< IRQEN23 (Bit 23)                                      */
#define CPU_NVIC_ISER_IRQEN23_Msk         (0x800000UL)              /*!< IRQEN23 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN24_Pos         (24UL)                    /*!< IRQEN24 (Bit 24)                                      */
#define CPU_NVIC_ISER_IRQEN24_Msk         (0x1000000UL)             /*!< IRQEN24 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN25_Pos         (25UL)                    /*!< IRQEN25 (Bit 25)                                      */
#define CPU_NVIC_ISER_IRQEN25_Msk         (0x2000000UL)             /*!< IRQEN25 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN26_Pos         (26UL)                    /*!< IRQEN26 (Bit 26)                                      */
#define CPU_NVIC_ISER_IRQEN26_Msk         (0x4000000UL)             /*!< IRQEN26 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN27_Pos         (27UL)                    /*!< IRQEN27 (Bit 27)                                      */
#define CPU_NVIC_ISER_IRQEN27_Msk         (0x8000000UL)             /*!< IRQEN27 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN28_Pos         (28UL)                    /*!< IRQEN28 (Bit 28)                                      */
#define CPU_NVIC_ISER_IRQEN28_Msk         (0x10000000UL)            /*!< IRQEN28 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN29_Pos         (29UL)                    /*!< IRQEN29 (Bit 29)                                      */
#define CPU_NVIC_ISER_IRQEN29_Msk         (0x20000000UL)            /*!< IRQEN29 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN30_Pos         (30UL)                    /*!< IRQEN30 (Bit 30)                                      */
#define CPU_NVIC_ISER_IRQEN30_Msk         (0x40000000UL)            /*!< IRQEN30 (Bitfield-Mask: 0x01)                         */
#define CPU_NVIC_ISER_IRQEN31_Pos         (31UL)                    /*!< IRQEN31 (Bit 31)                                      */
#define CPU_NVIC_ISER_IRQEN31_Msk         (0x80000000UL)            /*!< IRQEN31 (Bitfield-Mask: 0x01)                         */

/* =========================================================================================================================== */
/* ================                                          CSACSC                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL1  ========================================================= */
#define CSACSC_CTRL1_CSAC_EN_Pos          (0UL)                     /*!< CSAC_EN (Bit 0)                                       */
#define CSACSC_CTRL1_CSAC_EN_Msk          (0x1UL)                   /*!< CSAC_EN (Bitfield-Mask: 0x01)                         */

/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  P0_OMR  ========================================================= */
#define GPIO_P0_OMR_PS0_Pos               (0UL)                     /*!< PS0 (Bit 0)                                           */
#define GPIO_P0_OMR_PS0_Msk               (0x1UL)                   /*!< PS0 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS1_Pos               (1UL)                     /*!< PS1 (Bit 1)                                           */
#define GPIO_P0_OMR_PS1_Msk               (0x2UL)                   /*!< PS1 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS2_Pos               (2UL)                     /*!< PS2 (Bit 2)                                           */
#define GPIO_P0_OMR_PS2_Msk               (0x4UL)                   /*!< PS2 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS3_Pos               (3UL)                     /*!< PS3 (Bit 3)                                           */
#define GPIO_P0_OMR_PS3_Msk               (0x8UL)                   /*!< PS3 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS4_Pos               (4UL)                     /*!< PS4 (Bit 4)                                           */
#define GPIO_P0_OMR_PS4_Msk               (0x10UL)                  /*!< PS4 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS5_Pos               (5UL)                     /*!< PS5 (Bit 5)                                           */
#define GPIO_P0_OMR_PS5_Msk               (0x20UL)                  /*!< PS5 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS6_Pos               (6UL)                     /*!< PS6 (Bit 6)                                           */
#define GPIO_P0_OMR_PS6_Msk               (0x40UL)                  /*!< PS6 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS7_Pos               (7UL)                     /*!< PS7 (Bit 7)                                           */
#define GPIO_P0_OMR_PS7_Msk               (0x80UL)                  /*!< PS7 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS8_Pos               (8UL)                     /*!< PS8 (Bit 8)                                           */
#define GPIO_P0_OMR_PS8_Msk               (0x100UL)                 /*!< PS8 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS9_Pos               (9UL)                     /*!< PS9 (Bit 9)                                           */
#define GPIO_P0_OMR_PS9_Msk               (0x200UL)                 /*!< PS9 (Bitfield-Mask: 0x01)                             */
#define GPIO_P0_OMR_PS10_Pos              (10UL)                    /*!< PS10 (Bit 10)                                         */
#define GPIO_P0_OMR_PS10_Msk              (0x400UL)                 /*!< PS10 (Bitfield-Mask: 0x01)                            */
/* ========================================================  P1_OMR  ========================================================= */
#define GPIO_P1_OMR_PS0_Pos               (0UL)                     /*!< PS0 (Bit 0)                                           */
#define GPIO_P1_OMR_PS0_Msk               (0x1UL)                   /*!< PS0 (Bitfield-Mask: 0x01)                             */
#define GPIO_P1_OMR_PS1_Pos               (1UL)                     /*!< PS1 (Bit 1)                                           */
#define GPIO_P1_OMR_PS1_Msk               (0x2UL)                   /*!< PS1 (Bitfield-Mask: 0x01)                             */
#define GPIO_P1_OMR_PS2_Pos               (2UL)                     /*!< PS2 (Bit 2)                                           */
#define GPIO_P1_OMR_PS2_Msk               (0x4UL)                   /*!< PS2 (Bitfield-Mask: 0x01)                             */
#define GPIO_P1_OMR_PS3_Pos               (3UL)                     /*!< PS3 (Bit 3)                                           */
#define GPIO_P1_OMR_PS3_Msk               (0x8UL)                   /*!< PS3 (Bitfield-Mask: 0x01)                             */
#define GPIO_P1_OMR_PS4_Pos               (4UL)                     /*!< PS4 (Bit 4)                                           */
#define GPIO_P1_OMR_PS4_Msk               (0x10UL)                  /*!< PS4 (Bitfield-Mask: 0x01)                             */

/* =========================================================================================================================== */
/* ================                                            PLL                                            ================ */
/* =========================================================================================================================== */

