popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
/* =========================================================  CON0  ========================================================== */
#define PLL_CON0_PLLEN_Pos                (31UL)                    /*!< PLLEN (Bit 31)                                        */
#define PLL_CON0_PLLEN_Msk                (0x80000000UL)            /*!< PLLEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  CON1  ========================================================== */
#define PLL_CON1_PLLEN_Pos                (31UL)                    /*!< PLLEN (Bit 31)                                        */
#define PLL_CON1_PLLEN_Msk                (0x80000000UL)            /*!< PLLEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  SPCTR  ========================================================= */
#define PLL_SPCTR_SPEN0_Pos               (0UL)                     /*!< SPEN0 (Bit 0)                                         */
#define PLL_SPCTR_SPEN0_Msk               (0x1UL)                   /*!< SPEN0 (Bitfield-Mask: 0x01)                           */
#define PLL_SPCTR_SPEN1_Pos               (16UL)                    /*!< SPEN1 (Bit 16)                                        */
#define PLL_SPCTR_SPEN1_Msk               (0x10000UL)               /*!< SPEN1 (Bitfield-Mask: 0x01)                           */
/* =========================================================  STATC  ========================================================= */
#define PLL_STATC_PLL0_LOL_STSCLR_Pos     (0UL)                     /*!< PLL0_LOL_STSCLR (Bit 0)                               */
#define PLL_STATC_PLL0_LOL_STSCLR_Msk     (0x1UL)                   /*!< PLL0_LOL_STSCLR (Bitfield-Mask: 0x01)                 */
#define PLL_STATC_PLL1_LOL_STSCLR_Pos     (1UL)                     /*!< PLL1_LOL_STSCLR (Bit 1)                               */
#define PLL_STATC_PLL1_LOL_STSCLR_Msk     (0x2UL)                   /*!< PLL1_LOL_STSCLR (Bitfield-Mask: 0x01)                 */

/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  FS_SSD_CLR  ======================================================= */
#define PMU_FS_SSD_CLR_SSD_STS_CLR_Pos    (0UL)                     /*!< SSD_STS_CLR (Bit 0)                                   */
#define PMU_FS_SSD_CLR_SSD_STS_CLR_Msk    (0x1UL)                   /*!< SSD_STS_CLR (Bitfield-Mask: 0x01)                     */
#define PMU_FS_SSD_CLR_FO_STS_CLR_Pos     (1UL)                     /*!< FO_STS_CLR (Bit 1)                                    */
#define PMU_FS_SSD_CLR_FO_STS_CLR_Msk     (0x2UL)                   /*!< FO_STS_CLR (Bitfield-Mask: 0x01)                      */
/* ========================================================  WD_CTRL  ======================================================== */
#define PMU_WD_CTRL_WDP_Pos               (16UL)                    /*!< WDP (Bit 16)                                          */
#define PMU_WD_CTRL_WDP_Msk               (0x3f0000UL)              /*!< WDP (Bitfield-Mask: 0x3f)                             */
#define PMU_WD_CTRL_SOW_Pos               (24UL)                    /*!< SOW (Bit 24)                                          */
#define PMU_WD_CTRL_SOW_Msk               (0x3000000UL)             /*!< SOW (Bitfield-Mask: 0x03)                             */
/* =======================================================  WAKE_CTRL  ======================================================= */
#define PMU_WAKE_CTRL_CAN_WAKE_EN_Pos     (0UL)                     /*!< CAN_WAKE_EN (Bit 0)                                   */
#define PMU_WAKE_CTRL_CAN_WAKE_EN_Msk     (0x1UL)                   /*!< CAN_WAKE_EN (Bitfield-Mask: 0x01)                     */
#define PMU_WAKE_CTRL_MON0_WAKE_EN_Pos    (12UL)                    /*!< MON0_WAKE_EN (Bit 12)                                 */
#define PMU_WAKE_CTRL_MON0_WAKE_EN_Msk    (0x1000UL)                /*!< MON0_WAKE_EN (Bitfield-Mask: 0x01)                    */
#define PMU_WAKE_CTRL_MON1_WAKE_EN_Pos    (13UL)                    /*!< MON1_WAKE_EN (Bit 13)                                 */
#define PMU_WAKE_CTRL_MON1_WAKE_EN_Msk    (0x2000UL)                /*!< MON1_WAKE_EN (Bitfield-Mask: 0x01)                    */
#define PMU_WAKE_CTRL_MON2_WAKE_EN_Pos    (14UL)                    /*!< MON2_WAKE_EN (Bit 14)                                 */
#define PMU_WAKE_CTRL_MON2_WAKE_EN_Msk    (0x4000UL)                /*!< MON2_WAKE_EN (Bitfield-Mask: 0x01)                    */
#define PMU_WAKE_CTRL_GPIO0_WAKE_EN_Pos   (4UL)                     /*!< GPIO0_WAKE_EN (Bit 4)                                 */
#define PMU_WAKE_CTRL_GPIO0_WAKE_EN_Msk   (0x10UL)                  /*!< GPIO0_WAKE_EN (Bitfield-Mask: 0x01)                   */
#define PMU_WAKE_CTRL_GPIO1_WAKE_EN_Pos   (5UL)                     /*!< GPIO1_WAKE_EN (Bit 5)                                 */
#define PMU_WAKE_CTRL_GPIO1_WAKE_EN_Msk   (0x20UL)                  /*!< GPIO1_WAKE_EN (Bitfield-Mask: 0x01)                   */
#define PMU_WAKE_CTRL_GPIO2_WAKE_EN_Pos   (6UL)                     /*!< GPIO2_WAKE_EN (Bit 6)                                 */
#define PMU_WAKE_CTRL_GPIO2_WAKE_EN_Msk   (0x40UL)                  /*!< GPIO2_WAKE_EN (Bitfield-Mask: 0x01)                   */
#define PMU_WAKE_CTRL_GPIO3_WAKE_EN_Pos   (7UL)                     /*!< GPIO3_WAKE_EN (Bit 7)                                 */
#define PMU_WAKE_CTRL_GPIO3_WAKE_EN_Msk   (0x80UL)                  /*!< GPIO3_WAKE_EN (Bitfield-Mask: 0x01)                   */
#define PMU_WAKE_CTRL_GPIO4_WAKE_EN_Pos   (8UL)                     /*!< GPIO4_WAKE_EN (Bit 8)                                 */
#define PMU_WAKE_CTRL_GPIO4_WAKE_EN_Msk   (0x100UL)                 /*!< GPIO4_WAKE_EN (Bitfield-Mask: 0x01)                   */
#define PMU_WAKE_CTRL_GPIO5_WAKE_EN_Pos   (9UL)                     /*!< GPIO5_WAKE_EN (Bit 9)                                 */
#define PMU_WAKE_CTRL_GPIO5_WAKE_EN_Msk   (0x200UL)                 /*!< GPIO5_WAKE_EN (Bitfield-Mask: 0x01)                   */
#define PMU_WAKE_CTRL_LIN_WAKE_EN_Pos     (1UL)                     /*!< LIN_WAKE_EN (Bit 1)                                   */
#define PMU_WAKE_CTRL_LIN_WAKE_EN_Msk     (0x2UL)                   /*!< LIN_WAKE_EN (Bitfield-Mask: 0x01)                     */
#define PMU_WAKE_CTRL_CYC_WAKE_EN_Pos     (2UL)                     /*!< CYC_WAKE_EN (Bit 2)                                   */
#define PMU_WAKE_CTRL_CYC_WAKE_EN_Msk     (0x4UL)                   /*!< CYC_WAKE_EN (Bitfield-Mask: 0x01)                     */
#define PMU_WAKE_CTRL_VDDP_UVWARN_WAKE_EN_Pos (16UL)                /*!< VDDP_UVWARN_WAKE_EN (Bit 16)                          */
#define PMU_WAKE_CTRL_VDDP_UVWARN_WAKE_EN_Msk (0x10000UL)           /*!< VDDP_UVWARN_WAKE_EN (Bitfield-Mask: 0x01)             */
#define PMU_WAKE_CTRL_VDDP_OV_WAKE_EN_Pos (17UL)                    /*!< VDDP_OV_WAKE_EN (Bit 17)                              */
#define PMU_WAKE_CTRL_VDDP_OV_WAKE_EN_Msk (0x20000UL)               /*!< VDDP_OV_WAKE_EN (Bitfield-Mask: 0x01)                 */
#define PMU_WAKE_CTRL_VDDP_HCM_WAKE_EN_Pos (18UL)                   /*!< VDDP_HCM_WAKE_EN (Bit 18)                             */
#define PMU_WAKE_CTRL_VDDP_HCM_WAKE_EN_Msk (0x40000UL)              /*!< VDDP_HCM_WAKE_EN (Bitfield-Mask: 0x01)                */
#define PMU_WAKE_CTRL_VDDC_UVWARN_WAKE_EN_Pos (19UL)                /*!< VDDC_UVWARN_WAKE_EN (Bit 19)                          */
#define PMU_WAKE_CTRL_VDDC_UVWARN_WAKE_EN_Msk (0x80000UL)           /*!< VDDC_UVWARN_WAKE_EN (Bitfield-Mask: 0x01)             */
#define PMU_WAKE_CTRL_VDDC_OV_WAKE_EN_Pos (20UL)                    /*!< VDDC_OV_WAKE_EN (Bit 20)                              */
#define PMU_WAKE_CTRL_VDDC_OV_WAKE_EN_Msk (0x100000UL)              /*!< VDDC_OV_WAKE_EN (Bitfield-Mask: 0x01)                 */
#define PMU_WAKE_CTRL_VDDC_HCM_WAKE_EN_Pos (21UL)                   /*!< VDDC_HCM_WAKE_EN (Bit 21)                             */
#define PMU_WAKE_CTRL_VDDC_HCM_WAKE_EN_Msk (0x200000UL)             /*!< VDDC_HCM_WAKE_EN (Bitfield-Mask: 0x01)                */
#define PMU_WAKE_CTRL_VDDEXT_OT_WAKE_EN_Pos (22UL)                  /*!< VDDEXT_OT_WAKE_EN (Bit 22)                            */
#define PMU_WAKE_CTRL_VDDEXT_OT_WAKE_EN_Msk (0x400000UL)            /*!< VDDEXT_OT_WAKE_EN (Bitfield-Mask: 0x01)               */
#define PMU_WAKE_CTRL_VDDEXT_UV_WAKE_EN_Pos (23UL)                  /*!< VDDEXT_UV_WAKE_EN (Bit 23)                            */
#define PMU_WAKE_CTRL_VDDEXT_UV_WAKE_EN_Msk (0x800000UL)            /*!< VDDEXT_UV_WAKE_EN (Bitfield-Mask: 0x01)               */
#define PMU_WAKE_CTRL_VSDOV_WAKE_EN_Pos   (24UL)                    /*!< VSDOV_WAKE_EN (Bit 24)                                */
#define PMU_WAKE_CTRL_VSDOV_WAKE_EN_Msk   (0x1000000UL)             /*!< VSDOV_WAKE_EN (Bitfield-Mask: 0x01)                   */
#define PMU_WAKE_CTRL_WAKE_W_RST_Pos      (28UL)                    /*!< WAKE_W_RST (Bit 28)                                   */
#define PMU_WAKE_CTRL_WAKE_W_RST_Msk      (0x10000000UL)            /*!< WAKE_W_RST (Bitfield-Mask: 0x01)                      */
#define PMU_WAKE_CTRL_VDDC_RED_EN_Pos     (29UL)                    /*!< VDDC_RED_EN (Bit 29)                                  */
#define PMU_WAKE_CTRL_VDDC_RED_EN_Msk     (0x20000000UL)            /*!< VDDC_RED_EN (Bitfield-Mask: 0x01)                     */

/* =========================================================================================================================== */
/* ================                                            SCU                                            ================ */
/* =========================================================================================================================== */

