popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/APP1/RTE/Device/TLE9893_2QKW62/tle989x.h
/* ========================================================  CLKSEL  ========================================================= */
#define SCU_CLKSEL_CLKOUTEN_Pos           (19UL)                    /*!< CLKOUTEN (Bit 19)                                     */
#define SCU_CLKSEL_CLKOUTEN_Msk           (0x80000UL)               /*!< CLKOUTEN (Bitfield-Mask: 0x01)                        */

/* =========================================================  INP0  ========================================================== */
#define SCU_INP0_INP_PMU_Pos              (0UL)                     /*!< INP_PMU (Bit 0)                                       */
#define SCU_INP0_INP_PMU_Msk              (0x1UL)                   /*!< INP_PMU (Bitfield-Mask: 0x01)                         */
#define SCU_INP0_INP_BDRV_IRQ0_Pos        (1UL)                     /*!< INP_BDRV_IRQ0 (Bit 1)                                 */
#define SCU_INP0_INP_BDRV_IRQ0_Msk        (0x2UL)                   /*!< INP_BDRV_IRQ0 (Bitfield-Mask: 0x01)                   */
#define SCU_INP0_INP_BDRV_IRQ1_Pos        (2UL)                     /*!< INP_BDRV_IRQ1 (Bit 2)                                 */
#define SCU_INP0_INP_BDRV_IRQ1_Msk        (0x4UL)                   /*!< INP_BDRV_IRQ1 (Bitfield-Mask: 0x01)                   */
#define SCU_INP0_INP_CANTX_Pos            (3UL)                     /*!< INP_CANTX (Bit 3)                                     */
#define SCU_INP0_INP_CANTX_Msk            (0x8UL)                   /*!< INP_CANTX (Bitfield-Mask: 0x01)                       */
#define SCU_INP0_INP_ARVG_Pos             (4UL)                     /*!< INP_ARVG (Bit 4)                                      */
#define SCU_INP0_INP_ARVG_Msk             (0x10UL)                  /*!< INP_ARVG (Bitfield-Mask: 0x01)                        */
#define SCU_INP0_INP_CSC_Pos              (5UL)                     /*!< INP_CSC (Bit 5)                                       */
#define SCU_INP0_INP_CSC_Msk              (0x20UL)                  /*!< INP_CSC (Bitfield-Mask: 0x01)                         */
/* =========================================================  INP1  ========================================================== */
#define SCU_INP1_INP_GPT1T2_Pos           (0UL)                     /*!< INP_GPT1T2 (Bit 0)                                    */
#define SCU_INP1_INP_GPT1T2_Msk           (0x1UL)                   /*!< INP_GPT1T2 (Bitfield-Mask: 0x01)                      */
#define SCU_INP1_INP_GPT1T3_Pos           (1UL)                     /*!< INP_GPT1T3 (Bit 1)                                    */
#define SCU_INP1_INP_GPT1T3_Msk           (0x2UL)                   /*!< INP_GPT1T3 (Bitfield-Mask: 0x01)                      */
#define SCU_INP1_INP_GPT1T4_Pos           (2UL)                     /*!< INP_GPT1T4 (Bit 2)                                    */
#define SCU_INP1_INP_GPT1T4_Msk           (0x4UL)                   /*!< INP_GPT1T4 (Bitfield-Mask: 0x01)                      */
#define SCU_INP1_INP_GPT2T5_Pos           (3UL)                     /*!< INP_GPT2T5 (Bit 3)                                    */
#define SCU_INP1_INP_GPT2T5_Msk           (0x8UL)                   /*!< INP_GPT2T5 (Bitfield-Mask: 0x01)                      */
#define SCU_INP1_INP_GPT2T6_Pos           (4UL)                     /*!< INP_GPT2T6 (Bit 4)                                    */
#define SCU_INP1_INP_GPT2T6_Msk           (0x10UL)                  /*!< INP_GPT2T6 (Bitfield-Mask: 0x01)                      */
#define SCU_INP1_INP_GPT2CR_Pos           (5UL)                     /*!< INP_GPT2CR (Bit 5)                                    */
#define SCU_INP1_INP_GPT2CR_Msk           (0x20UL)                  /*!< INP_GPT2CR (Bitfield-Mask: 0x01)                      */
/* =========================================================  INP2  ========================================================== */
#define SCU_INP2_INP_MON1_Pos             (0UL)                     /*!< INP_MON1 (Bit 0)                                      */
#define SCU_INP2_INP_MON1_Msk             (0x1UL)                   /*!< INP_MON1 (Bitfield-Mask: 0x01)                        */
#define SCU_INP2_INP_MON2_Pos             (1UL)                     /*!< INP_MON2 (Bit 1)                                      */
#define SCU_INP2_INP_MON2_Msk             (0x2UL)                   /*!< INP_MON2 (Bitfield-Mask: 0x01)                        */
#define SCU_INP2_INP_MON3_Pos             (2UL)                     /*!< INP_MON3 (Bit 2)                                      */
#define SCU_INP2_INP_MON3_Msk             (0x4UL)                   /*!< INP_MON3 (Bitfield-Mask: 0x01)                        */
/* =========================================================  INP3  ========================================================== */
#define SCU_INP3_INP_SDADC0_Pos           (0UL)                     /*!< INP_SDADC0 (Bit 0)                                    */
#define SCU_INP3_INP_SDADC0_Msk           (0x1UL)                   /*!< INP_SDADC0 (Bitfield-Mask: 0x01)                      */
#define SCU_INP3_INP_SDADC1_Pos           (1UL)                     /*!< INP_SDADC1 (Bit 1)                                    */
#define SCU_INP3_INP_SDADC1_Msk           (0x2UL)                   /*!< INP_SDADC1 (Bitfield-Mask: 0x01)                      */
#define SCU_INP3_INP_BEMF0_Pos            (2UL)                     /*!< INP_BEMF0 (Bit 2)                                     */
#define SCU_INP3_INP_BEMF0_Msk            (0x4UL)                   /*!< INP_BEMF0 (Bitfield-Mask: 0x01)                       */
#define SCU_INP3_INP_BEMF1_Pos            (3UL)                     /*!< INP_BEMF1 (Bit 3)                                     */
#define SCU_INP3_INP_BEMF1_Msk            (0x8UL)                   /*!< INP_BEMF1 (Bitfield-Mask: 0x01)                       */
#define SCU_INP3_INP_BEMF2_Pos            (4UL)                     /*!< INP_BEMF2 (Bit 4)                                     */
#define SCU_INP3_INP_BEMF2_Msk            (0x10UL)                  /*!< INP_BEMF2 (Bitfield-Mask: 0x01)                       */
/* =========================================================  INP4  ========================================================== */
#define SCU_INP4_INP_EXINT0_Pos           (0UL)                     /*!< INP_EXINT0 (Bit 0)                                    */
#define SCU_INP4_INP_EXINT0_Msk           (0x1UL)                   /*!< INP_EXINT0 (Bitfield-Mask: 0x01)                      */
#define SCU_INP4_INP_EXINT1_Pos           (1UL)                     /*!< INP_EXINT1 (Bit 1)                                    */
#define SCU_INP4_INP_EXINT1_Msk           (0x2UL)                   /*!< INP_EXINT1 (Bitfield-Mask: 0x01)                      */
#define SCU_INP4_INP_EXINT2_Pos           (2UL)                     /*!< INP_EXINT2 (Bit 2)                                    */
#define SCU_INP4_INP_EXINT2_Msk           (0x4UL)                   /*!< INP_EXINT2 (Bitfield-Mask: 0x01)                      */
#define SCU_INP4_INP_EXINT3_Pos           (3UL)                     /*!< INP_EXINT3 (Bit 3)                                    */
#define SCU_INP4_INP_EXINT3_Msk           (0x8UL)                   /*!< INP_EXINT3 (Bitfield-Mask: 0x01)                      */
/* =========================================================  INP5  ========================================================== */
#define SCU_INP5_INP_LIN0_EOFSYN_Pos      (0UL)                     /*!< INP_LIN0_EOFSYN (Bit 0)                               */
#define SCU_INP5_INP_LIN0_EOFSYN_Msk      (0x1UL)                   /*!< INP_LIN0_EOFSYN (Bitfield-Mask: 0x01)                 */
#define SCU_INP5_INP_LIN0_ERRSYN_Pos      (1UL)                     /*!< INP_LIN0_ERRSYN (Bit 1)                               */
#define SCU_INP5_INP_LIN0_ERRSYN_Msk      (0x2UL)                   /*!< INP_LIN0_ERRSYN (Bitfield-Mask: 0x01)                 */
#define SCU_INP5_INP_LIN1_EOFSYN_Pos      (2UL)                     /*!< INP_LIN1_EOFSYN (Bit 2)                               */
#define SCU_INP5_INP_LIN1_EOFSYN_Msk      (0x4UL)                   /*!< INP_LIN1_EOFSYN (Bitfield-Mask: 0x01)                 */
#define SCU_INP5_INP_LIN1_ERRSYN_Pos      (3UL)                     /*!< INP_LIN1_ERRSYN (Bit 3)                               */
#define SCU_INP5_INP_LIN1_ERRSYN_Msk      (0x8UL)                   /*!< INP_LIN1_ERRSYN (Bitfield-Mask: 0x01)                 */
#define SCU_INP5_INP_UART0_RI_Pos         (4UL)                     /*!< INP_UART0_RI (Bit 4)                                  */
#define SCU_INP5_INP_UART0_RI_Msk         (0x10UL)                  /*!< INP_UART0_RI (Bitfield-Mask: 0x01)                    */
#define SCU_INP5_INP_UART0_TI_Pos         (5UL)                     /*!< INP_UART0_TI (Bit 5)                                  */
#define SCU_INP5_INP_UART0_TI_Msk         (0x20UL)                  /*!< INP_UART0_TI (Bitfield-Mask: 0x01)                    */
#define SCU_INP5_INP_UART1_RI_Pos         (6UL)                     /*!< INP_UART1_RI (Bit 6)                                  */
#define SCU_INP5_INP_UART1_RI_Msk         (0x40UL)                  /*!< INP_UART1_RI (Bitfield-Mask: 0x01)                    */
#define SCU_INP5_INP_UART1_TI_Pos         (7UL)                     /*!< INP_UART1_TI (Bit 7)                                  */
#define SCU_INP5_INP_UART1_TI_Msk         (0x80UL)                  /*!< INP_UART1_TI (Bitfield-Mask: 0x01)                    */
/* =========================================================  INP6  ========================================================== */
#define SCU_INP6_INP_SSC0_RIR_Pos         (0UL)                     /*!< INP_SSC0_RIR (Bit 0)                                  */
#define SCU_INP6_INP_SSC0_RIR_Msk         (0x1UL)                   /*!< INP_SSC0_RIR (Bitfield-Mask: 0x01)                    */
#define SCU_INP6_INP_SSC0_TIR_Pos         (1UL)                     /*!< INP_SSC0_TIR (Bit 1)                                  */
#define SCU_INP6_INP_SSC0_TIR_Msk         (0x2UL)                   /*!< INP_SSC0_TIR (Bitfield-Mask: 0x01)                    */
#define SCU_INP6_INP_SSC0_EIR_Pos         (2UL)                     /*!< INP_SSC0_EIR (Bit 2)                                  */
#define SCU_INP6_INP_SSC0_EIR_Msk         (0x4UL)                   /*!< INP_SSC0_EIR (Bitfield-Mask: 0x01)                    */
#define SCU_INP6_INP_SSC1_RIR_Pos         (4UL)                     /*!< INP_SSC1_RIR (Bit 4)                                  */
#define SCU_INP6_INP_SSC1_RIR_Msk         (0x10UL)                  /*!< INP_SSC1_RIR (Bitfield-Mask: 0x01)                    */
#define SCU_INP6_INP_SSC1_TIR_Pos         (5UL)                     /*!< INP_SSC1_TIR (Bit 5)                                  */
#define SCU_INP6_INP_SSC1_TIR_Msk         (0x20UL)                  /*!< INP_SSC1_TIR (Bitfield-Mask: 0x01)                    */
#define SCU_INP6_INP_SSC1_EIR_Pos         (6UL)                     /*!< INP_SSC1_EIR (Bit 6)                                  */
#define SCU_INP6_INP_SSC1_EIR_Msk         (0x40UL)                  /*!< INP_SSC1_EIR (Bitfield-Mask: 0x01)                    */
/* =========================================================  INP7  ========================================================== */
#define SCU_INP7_INP_DMACH0_Pos           (0UL)                     /*!< INP_DMACH0 (Bit 0)                                    */
#define SCU_INP7_INP_DMACH0_Msk           (0x1UL)                   /*!< INP_DMACH0 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMACH1_Pos           (1UL)                     /*!< INP_DMACH1 (Bit 1)                                    */
#define SCU_INP7_INP_DMACH1_Msk           (0x2UL)                   /*!< INP_DMACH1 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMACH2_Pos           (2UL)                     /*!< INP_DMACH2 (Bit 2)                                    */
#define SCU_INP7_INP_DMACH2_Msk           (0x4UL)                   /*!< INP_DMACH2 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMACH3_Pos           (3UL)                     /*!< INP_DMACH3 (Bit 3)                                    */
#define SCU_INP7_INP_DMACH3_Msk           (0x8UL)                   /*!< INP_DMACH3 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMACH4_Pos           (4UL)                     /*!< INP_DMACH4 (Bit 4)                                    */
#define SCU_INP7_INP_DMACH4_Msk           (0x10UL)                  /*!< INP_DMACH4 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMACH5_Pos           (5UL)                     /*!< INP_DMACH5 (Bit 5)                                    */
#define SCU_INP7_INP_DMACH5_Msk           (0x20UL)                  /*!< INP_DMACH5 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMACH6_Pos           (6UL)                     /*!< INP_DMACH6 (Bit 6)                                    */
#define SCU_INP7_INP_DMACH6_Msk           (0x40UL)                  /*!< INP_DMACH6 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMACH7_Pos           (7UL)                     /*!< INP_DMACH7 (Bit 7)                                    */
#define SCU_INP7_INP_DMACH7_Msk           (0x80UL)                  /*!< INP_DMACH7 (Bitfield-Mask: 0x01)                      */
#define SCU_INP7_INP_DMATRERR_Pos         (8UL)                     /*!< INP_DMATRERR (Bit 8)                                  */
#define SCU_INP7_INP_DMATRERR_Msk         (0x100UL)                 /*!< INP_DMATRERR (Bitfield-Mask: 0x01)                    */
/* ========================================================  NMISRC  ========================================================= */
#define SCU_NMISRC_NMIXTALCLR_Pos         (0UL)                     /*!< NMIXTALCLR (Bit 0)                                    */
#define SCU_NMISRC_NMIXTALCLR_Msk         (0x1UL)                   /*!< NMIXTALCLR (Bitfield-Mask: 0x01)                      */
#define SCU_NMISRC_NMIPLL0CLR_Pos         (1UL)                     /*!< NMIPLL0CLR (Bit 1)                                    */
#define SCU_NMISRC_NMIPLL0CLR_Msk         (0x2UL)                   /*!< NMIPLL0CLR (Bitfield-Mask: 0x01)                      */
#define SCU_NMISRC_NMIPLL1CLR_Pos         (2UL)                     /*!< NMIPLL1CLR (Bit 2)                                    */
#define SCU_NMISRC_NMIPLL1CLR_Msk         (0x4UL)                   /*!< NMIPLL1CLR (Bitfield-Mask: 0x01)                      */
/* =========================================================  PMCON  ========================================================= */
#define SCU_PMCON_SSC0_DIS_Pos            (0UL)                     /*!< SSC0_DIS (Bit 0)                                      */
#define SCU_PMCON_SSC0_DIS_Msk            (0x1UL)                   /*!< SSC0_DIS (Bitfield-Mask: 0x01)                        */
#define SCU_PMCON_SSC1_DIS_Pos            (1UL)                     /*!< SSC1_DIS (Bit 1)                                      */
#define SCU_PMCON_SSC1_DIS_Msk            (0x2UL)                   /*!< SSC1_DIS (Bitfield-Mask: 0x01)                        */
#define SCU_PMCON_T2_DIS_Pos              (2UL)                     /*!< T2_DIS (Bit 2)                                        */
#define SCU_PMCON_T2_DIS_Msk              (0x4UL)                   /*!< T2_DIS (Bitfield-Mask: 0x01)                          */
#define SCU_PMCON_T21_DIS_Pos             (3UL)                     /*!< T21_DIS (Bit 3)                                       */
#define SCU_PMCON_T21_DIS_Msk             (0x8UL)                   /*!< T21_DIS (Bitfield-Mask: 0x01)                         */
#define SCU_PMCON_GPT12_DIS_Pos           (4UL)                     /*!< GPT12_DIS (Bit 4)                                     */
#define SCU_PMCON_GPT12_DIS_Msk           (0x10UL)                  /*!< GPT12_DIS (Bitfield-Mask: 0x01)                       */
/* ========================================================  XTALCON  ======================================================== */
#define SCU_XTALCON_XPD_Pos               (0UL)                     /*!< XPD (Bit 0)                                           */
#define SCU_XTALCON_XPD_Msk               (0x1UL)                   /*!< XPD (Bitfield-Mask: 0x01)                             */
/* =======================================================  XTALSTATC  ======================================================= */
#define SCU_XTALSTATC_XTAL_FAIL_STSCLR_Pos (0UL)                    /*!< XTAL_FAIL_STSCLR (Bit 0)                              */
#define SCU_XTALSTATC_XTAL_FAIL_STSCLR_Msk (0x1UL)                  /*!< XTAL_FAIL_STSCLR (Bitfield-Mask: 0x01)                */

/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  BCON  ========================================================== */
#define UART0_BCON_BR_R_Pos               (0UL)                     /*!< BR_R (Bit 0)                                          */
#define UART0_BCON_BR_R_Msk               (0x1UL)                   /*!< BR_R (Bitfield-Mask: 0x01)                            */
/* =========================================================  SCON  ========================================================== */
#define UART0_SCON_SM1_Pos                (1UL)                     /*!< SM1 (Bit 1)                                           */
#define UART0_SCON_SM1_Msk                (0x2UL)                   /*!< SM1 (Bitfield-Mask: 0x01)                             */

/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  BCON  ========================================================== */
#define UART1_BCON_BR_R_Pos               (0UL)                     /*!< BR_R (Bit 0)                                          */
#define UART1_BCON_BR_R_Msk               (0x1UL)                   /*!< BR_R (Bitfield-Mask: 0x01)                            */
/* =========================================================  SCON  ========================================================== */
#define UART1_SCON_SM1_Pos                (1UL)                     /*!< SM1 (Bit 1)                                           */
#define UART1_SCON_SM1_Msk                (0x2UL)                   /*!< SM1 (Bitfield-Mask: 0x01)                             */


/** @} */ /* End of group PosMask_peripherals */                                                                                                                                 

/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* TLE989X_H */


/** @} */ /* End of group tle989x */

/** @} */ /* End of group Infineon */
